{
    "1614081297865": {
        "name": "Truyện cười song ngữ",
        "description": "Tủyện tập truyện cười sọng ngữ",
        "photo": "https://tonytran99.github.io/truyen-song-ngu-data/files/photo/categories/1614081297865.jpg",
        "createdAt": "2021-02-23T11:55:04.914Z",
        "updatedAt": "2021-02-23T11:55:04.914Z",
        "stories": {
            "1614089886730": {
                "id": "1614089886730",
                "nameEn": "DUMMY HUSBAND",
                "nameVi": "NGƯỜI CHỒNG NGỜ NGHỆCH",
                "descriptionEn": "",
                "descriptionVi": "",
                "contentEn": "A man asked his wife, \"if you could have anything in the world for one day, what would you want?\"  \"I'd love to be six again,\" she replied.             On the morning of her birthday, he got her up bright and early and off they went to a local theme park. What a day! He put her on every ride in the park: the Death Slide, the Screaming Loop, the Wall of Fear, everything there was! Wow! Five hours later she staggered out of the theme park, her head reeling and her stomach upside down. Off to a McDonald's they went, where her husband ordered her a Big Mac along with extra fries and a refreshing chocolate shake. Then it was off to a movie: the latest Hollywood blockbuster, hot dogs, popcorn, Pepsi Cola and M & M's. What a fabulous adventure! \nFinally she wobbled home with her husband and collapsed into bed. He leaned over and lovingly asked, \"Well, dear, what was it like being six again?\" \nOne eye opened. \"You dummy, I meant my \ndress size.\" \n",
                "contentVi": "Một người đàn ông hỏi vợ:”Nếu em có thể được mọi thứ trên thế giới trong một ngày, em sẽ muốn gì?” \n“Em muốn trở lại như hồi sáu,” nàng đáp. Vào buổi sáng sinh nhật nàng, anh ta đánh thức nàng dậy rất sớm và họ  đi đến một công viên chủ đề1 trong vùng. Đúng là một ngày vui! Anh ta đặt nàng lên mọi thứ trò chơi trong công viên: Đường trượt Chết người, Vòng nhào lộn Kêu thét, Bức tướng Sợ hãi, mọi thứ! Hết xẩy! Năm tiếng sau nàng lảo đảo đi ra khỏi công viên, đầu óc quay cuồng và bụng như lộn xuống. Họ đi vào một nhà hàng McDonald, người chồng gọi một  cái bánh kẹp thịt lớn thêm với thịt ram và một ly sôcôla trứng khuấy.Sau đó họ đi tới một rạp chiếu phim: bộ phim thành công nhất, mới nhất Hollywood, hot dog, bắp nổ, Pepsi Cola. Quả là một cuộc chơi tuyệt vời!             Sau cùng nàng đi loạng choạng về nhà với chồng và đổ sụp xuống giường. Anh ta ngã người và hỏi một cách âu yếm:” Đấy, em yêu, trở lại như hồi sáu tuổi thì như thế nào?” \nNàng mở một mắt:” Oi anh ngờ nghệch, ý em muốn nói cỡ áo số sáu.”",
                "photo": "https://tonytran99.github.io/truyen-song-ngu-data/files/photo/stories/1614089886730.jpg",
                "audio": null,
                "createdAt": "2021-02-23T14:18:07.845Z",
                "updatedAt": "2021-02-23T14:18:07.845Z"
            },
            "1614089629885": {
                "id": "1614089629885",
                "nameEn": "WHERE’S THE SHOE?",
                "nameVi": "CHIẾC GIÀY Đ U RỒI ?",
                "descriptionEn": "",
                "descriptionVi": "",
                "contentEn": "One night a fellow drove his secretary home after she had imbibed a little too much at an office reception. Although this was an innocent gesture, he decided not to mention it to his wife, who tended to get jealous easily. \nThe next night the man and his wife were driving to a restaurant. Suddenly he looked down and spotted a high-heel shoe half hidden under the passenger seat. Not wanting to be conspicuous, he waited until his wife was looking out her window before he scooped up the shoe and tossed it out of the car. \nWith a sigh of relief, he pulled into the restaurant parking lot. That's when he noticed his wife squirming around in her seat. \"Honey,\" she asked, \"have you seen my other shoe?\"\n",
                "contentVi": "Một buổi tối có một người đàn ông lái xe chở cô thư ký về nhà sau khi cô ta uống hơi nhiều tại bữa tiệc chiêu đãi cơ quan. Mặc dù đây là một hành vi vô tư nhưng anh ta quyết định không nói cho vợ- người hay nổi ghen dễ dàng – nghe.\nTối hôm sau, người đàn ông và vợ đánh xe đến một nhà hàng. Thình lình anh ta nhìn xuống và nhận ra một chiếc giày cao gót ẩn một nửa dưới ghế khách. Không muốn bị chú ý, anh ta đợi tới lúc vợ nhìn ra cửa sổ trước khi anh ta anh ta hất chiếc giày lên và quăng khỏi xe. \nVới một hơi thở nhẹ nhõm, anh ta lái xe vào bãi đậu xe. Chính lúc đó anh ta chú ý thấy vợ loay hoay quanh ghế ngồi. “Anh yêu,” cô ta hỏi, “ anh có thấy chiếc giày kia của em không?” ",
                "photo": "https://tonytran99.github.io/truyen-song-ngu-data/files/photo/stories/1614089629885.jpg",
                "audio": null,
                "createdAt": "2021-02-23T14:13:51.089Z",
                "updatedAt": "2021-02-23T14:13:51.089Z"
            },
            "1614089472754": {
                "id": "1614089472754",
                "nameEn": "THE NEIGHBORS CAN NOT SEE YOU",
                "nameVi": "HÀNG XÓM KHÔNG THỂ NHÌN THẤY EM ĐƯỢC",
                "descriptionEn": "",
                "descriptionVi": "",
                "contentEn": "Having been married ten years and still living in an apartment, the wife would often complain about anything, as she was tired of saving every penny to buy a \"dream home\".\nTrying to placate her, the husband found a new \tapartment, within their budget. \nHowever, after the first week, she began complaining again. \n\"Joel,\" she said, \"I don't like this place at all. \nThere are no curtains in the bathroom. The neighbors can see me every time I take a bath.\"           \n\"Don't worry.\" replied her husband. \"If the neighbors do see you, they'll buy curtains.\" ",
                "contentVi": "Đã cưới nhau mười năm nhưng vẫn sống trong một căn hộ, người vợ thường phàn nàn đủ thứ vì cô ta mệt mỏi về việc tiết kiệm tứng xu để mua một “ngôi nhà mơ ước”. \nVới cố gắng an ủi vợ, người chồng tìm một căn hộ mới hợp túi tiền của họ. Tuy vậy, sau tuần lễ đầu, người vợ lại bắt đầu phàn nàn. \n“Joel,” cô ta nói, “em không thích nơi này tí nào. Không có tấm màn nào trong phòng tắm. Hàng xóm có thể thấy em khi em tắm.” \n“Đừng lo,” chồng trả lời. Nếu quả thực hàng \nxóm thấy em, họ sẽ mua màn.” ",
                "photo": "https://tonytran99.github.io/truyen-song-ngu-data/files/photo/stories/1614089472754.jpg",
                "audio": null,
                "createdAt": "2021-02-23T14:11:14.906Z",
                "updatedAt": "2021-02-23T14:11:14.906Z"
            },
            "1614082978628": {
                "id": "1614082978628",
                "nameEn": "A HUSBAND WHO NEVER FEELS ASHAMED",
                "nameVi": "MỘT NGƯỜI CHỒNG KHÔNG BAO GIỜ  BIẾT XẤU HỔ",
                "descriptionEn": "",
                "descriptionVi": "",
                "contentEn": "I'm ashamed of the way we live,\" a young wife says to her lazy husband who refuses to find a job. \"My father pays our rent. My mother buys all of our food. My sister buys our clothes. My aunt bought us a car. \nI'm just so ashamed.\" The husband rolls over on the couch. \"And you damn well should be,\" he agrees. \"Those two worthless brothers of yours ain't never give us a cent!\" \n",
                "contentVi": "“Em xấu hổ về cách sống của chúng ta,” một người vợ trẻ nói với ông chồng lười – người từ chối đi tìm một việc làm.” Ba em trả tiền thuê nhà. Má em mua tất cả đồ ăn.Chị em mua quần áo chúng ta. Cô em mua xe hơi cho chúng ta. Em quá xấu hổ.” Người chồng lăn tròn trên đi văng. “Và em nên tiếp tục chỉ trích nữa,” anh ta đồng ý. “Hai ông anh vô dụng của em không bao giờ cho chúng ta một xu!” \n",
                "photo": "https://tonytran99.github.io/truyen-song-ngu-data/files/photo/stories/1614082978628.jpg",
                "audio": null,
                "createdAt": "2021-02-23T12:22:59.804Z",
                "updatedAt": "2021-02-23T12:22:59.804Z"
            },
            "1614082389740": {
                "id": "1614082389740",
                "nameEn": "THEY HAD NO PRIVACY",
                "nameVi": "HỌ KHÔNG CÓ CHÚT RIÊNG TƯ NÀO CẢ",
                "descriptionEn": "",
                "descriptionVi": "",
                "contentEn": "As a young married couple, a husband and a wife lived in a cheap housing complex near the base where he was working. Their chief complaint was that the walls were paper-thin and that they had no privacy. This was painfully obvious when one morning the husband was upstairs and the wife was downstairs on the telephone. She was interrupted by the doorbell and went to greet her neighbor. \n           \"Give this to your husband,\" he said thrusting a roll of toilet paper into her hands. \"He's been yelling for it for 15 minutes!\"\n",
                "contentVi": "Khi là một cặp vợ chồng trẻ mới cưới, người chồng và người vợ sống trong một khu nhà ở liên hợp rẻ tiền gần cơ sở người chồng làm việc.Điều đáng phàn nàn chủ yếu của họ là các bức tường mỏng như giấy và họ không có được sự kín đáo.Điều này lộ ra hiển nhiên một cách đáng buồn vào một buổi sáng người chồng ở tầng trên và người vợ ở tầng dưới đang gọi điện thoại.Người vợ bị cắt ngang bởi tiếng chuông cửa và đi ra chào người hàng xóm. \n“Đưa cái này cho chồng cô,” ông ta nói và giúi một cuộn giấy vệ sinh  vào tay cô ta.”Anh ấy đã hét đòi nó 15 phút!” \n ",
                "photo": "https://tonytran99.github.io/truyen-song-ngu-data/files/photo/stories/1614082389740.jpg",
                "audio": null,
                "createdAt": "2021-02-23T12:13:12.775Z",
                "updatedAt": "2021-02-23T12:13:12.775Z"
            },
            "1614082207026": {
                "id": "1614082207026",
                "nameEn": "HOW TO LIVE?",
                "nameVi": "LÀM SAO ĐỂ SỐNG?",
                "descriptionEn": "",
                "descriptionVi": "",
                "contentEn": "\"Darling,\" said the young man to his new bride. \"Now that we are married, do you think you will be able to live on my modest income?\" \"Of course, dearest, no trouble,\" she answered. \"But what will you live on?\"\n",
                "contentVi": "“Em yêu,” một người đàn ông trẻ nói với cô dâu mới.”Vì rằng chúng ta cưới nhau, em có nghĩ em sẽ có thể sống bằng thu nhập khiêm tốn của anh?” “Dĩ nhiên, anh yêu, không sao cả,” cô ta trả lời. “Nhưng anh sẽ sống bằng gì?” ",
                "photo": "https://tonytran99.github.io/truyen-song-ngu-data/files/photo/stories/1614082207026.jpg",
                "audio": null,
                "createdAt": "2021-02-23T12:10:09.107Z",
                "updatedAt": "2021-02-23T12:10:09.107Z"
            },
            "1614081484301": {
                "id": "1614081484301",
                "nameEn": "THE BUM …",
                "nameVi": "KẺ ĂN MÀY …",
                "descriptionEn": "",
                "descriptionVi": "",
                "contentEn": "A bum approaches a well dressed gentleman on the street. \"Hey, Buddy, can you spare two dollars?\" The well-dressed gentleman responds, \"You are not going to spend in on liquor are you?\" \n \"No, sir, I don't drink,\" retorts the bum.            \"You are not going to throw it away in some crap game, are you?\" asks the gentleman.            \"No way, I don't gamble,\" answers the bum.            \"You wouldn't waste the money at a golf course for greens fees, would you?\" asks the man.            \"Never,\" says the bum, \"I don't play golf.\"            The man asks the bum if he would like to come home with him for a home cooked meal. The bum accepts eagerly. While they are heading for the man's house, the bum's curiosity gets the better of him. \"Isn't your wife going to be angry when she sees a guy like me at your table?\" \n\"Probably,\" says the man, \"but it will be worth it. I want her to see what happens to a guy who doesn't \ndrink, gamble or play golf.\"\n",
                "contentVi": "Một gã ăn mày tiến gần một quý ông ăn mặt sang trọng trên đường phố. “Này, ông bạn quý, ông có thể cho hai đô la được không?” Người đàn ông ăn mặc sang trọng trả lời:” Bạn sẽ không tiêu tiền vào rượu chè, phải không?” \n“Không, thưa ngài, tôi không uống rượu,” gã ăn mày cãi lại. \n“Bạn sẽ không quẳng nó vào những ván chơi tào lao, phải không?” người đàn ông thượng lưu hỏi. “ Không theo lối đó. Tôi không chơi bài,” gã ăn mày trả lời. \n“ Bạn sẽ không tiêu hoang tiền vào những khoảng phí hõm của một cuộc gôn, phải không?” người đàn ông hỏi. \n“Không bao giờ,” tên ăn mày nói, “tôi không chơi gôn.” \nNgười đàn ông hỏi gã ăn mày có muốn về nhà với ông ta ăn cơm nhà không. Gã ăn mày hăm hở đồng ý. Trong khi họ đang đi hướng về nhà người đàn ông, gã ăn mày không thắng được tính tò mò. “Vợ ông sẽ không nổi giận khi bà ấy thấy một gã như tôi tại bàn ăn của ông à?” \n“ Chắc là có,” người đàn ông nói, “nhưng sẽ đáng như thế. Tôi muốn cô ấy thấy điều gì xảy ra cho một gã không nhậu nhẹt, cờ bạc hoặc chơi gôn.”",
                "photo": "https://tonytran99.github.io/truyen-song-ngu-data/files/photo/stories/1614081484301.jpg",
                "audio": null,
                "createdAt": "2021-02-23T11:58:06.428Z",
                "updatedAt": "2021-02-23T11:58:06.428Z"
            }
        },
        "totalStories": 7,
        "uid": "1614081297865"
    },
    "1614075442460": {
        "name": "100 Truyện Ngắn Song Ngữ Dễ Hiểu ( Audio )",
        "description": "Tất cả mẩu truyện ngắn có độ dài khoảng 50 – 80 từ có cả bản word và audio. Mỗi ngày các bạn chỉ nên dành thời gian luyện nghe một câu chuyện, vừa nâng cao vốn từ vựng, luyện listening + speaking.\nQuan trọng hơn, các câu chuyện này đều có ý nghĩa bài học sâu sắc trong cuộc sống từ đây bạn sẽ học hỏi nhiều điều hay lẽ phải để cuộc sống trở nên tốt đẹp hơn.",
        "photo": "https://tonytran99.github.io/truyen-song-ngu-data/files/photo/categories/1614075442460.jpg",
        "createdAt": "2021-02-23T10:17:23.401Z",
        "updatedAt": "2021-02-23T10:17:23.401Z",
        "stories": {
            "1614079275261": {
                "id": "1614079275261",
                "nameEn": "Group Project",
                "nameVi": "Dự án của nhóm",
                "descriptionEn": "",
                "descriptionVi": "",
                "contentEn": "Ms. Howard assigns a project. She wants the students to work in groups. Adam works with Joe and Bill. Adam is smart. Joe draws well. Bill is cooperative. They make a good group. They turn in their project. Ms. Howard likes it. She gives them a high grade. Adam, Joe, and Bill are joyful.",
                "contentVi": "Cô Howard đưa ra một dự án. Cô muốn học sinh làm việc theo nhóm. Adam hợp tác cùng Joe và Bill. Adam rất thông minh. Joe vẽ rất đẹp. Bill có tính hợp tác cao. Họ là một nhóm tốt. Họ nộp dự án của họ. Cô Howard rất thích nó. Cô cho họ điểm cao. Adam, Joe, và Bill rất vui.",
                "photo": "https://tonytran99.github.io/truyen-song-ngu-data/files/photo/stories/1614079275261.jpg",
                "audio": "https://tonytran99.github.io/truyen-song-ngu-data/files/audio/stories/1614079275261.mp3",
                "createdAt": "2021-02-23T11:21:19.385Z",
                "updatedAt": "2021-02-23T11:21:19.385Z"
            },
            "1614079170223": {
                "id": "1614079170223",
                "nameEn": "A New Pet",
                "nameVi": "Thú cưng mới",
                "descriptionEn": "",
                "descriptionVi": "",
                "contentEn": "Kate is walking. She sees a dog. The dog wags its tail. Kate likes the dog. It has no collar. Kate takes it home. She washes the dog. She names him \"Toby.\" She takes Toby to the vet. Toby is healthy. Kate walks Toby every day. They love each other.",
                "contentVi": "Kate đang đi dạo. Cô bé thấy 1 chú chó. Chú chó quẫy đuôi của nó. Kate thích chú chó này. Nó không có vòng cổ. Kate mang nó về nhà. Cô bé tắm cho chú chó. Cô bé đặt tên chú chó là \"Toby\". Cô bé đưa Toby đến bác sĩ thú y. Toby khỏe mạnh. Kate cùng Toby đi dạo mỗi ngày. Họ yêu quý nhau.",
                "photo": "https://tonytran99.github.io/truyen-song-ngu-data/files/photo/stories/1614079170223.jpg",
                "audio": "https://tonytran99.github.io/truyen-song-ngu-data/files/audio/stories/1614079170223.mp3",
                "createdAt": "2021-02-23T11:19:34.809Z",
                "updatedAt": "2021-02-23T11:19:34.809Z"
            },
            "1614078912960": {
                "id": "1614078912960",
                "nameEn": "Surprise Party",
                "nameVi": "Bữa tiệc bất ngờ",
                "descriptionEn": "",
                "descriptionVi": "",
                "contentEn": "It is Lily's birthday. She gets out of bed. Nobody says anything to her. Her mom takes her to school. Her friends do not say anything. The teacher does not say anything. Lily is sad. Lily walks home alone. She opens the door. Her friends and family are holding a cake. They say, \"Surprise Lily!\"",
                "contentVi": "Hôm nay là sinh nhật của LiLy. Cô bé xuống khỏi giường. Không ai nói gì với Lily. Mẹ đưa cô bé đến trường. Bạn bè không nói gì với cô bé. Giáo viên cũng không nói gì. Lily rất buồn. LiLy đi bộ về nhà một mình. Cô bé mở cửa ra. Bạn bè và gia đình đang cầm 1 chiếc bánh. Họ nói: “Ngạc nhiên chưa Lily!”.",
                "photo": "https://tonytran99.github.io/truyen-song-ngu-data/files/photo/stories/1614078912960.jpg",
                "audio": "https://tonytran99.github.io/truyen-song-ngu-data/files/audio/stories/1614078912960.mp3",
                "createdAt": "2021-02-23T11:15:23.077Z",
                "updatedAt": "2021-02-23T11:15:23.077Z"
            },
            "1614078653433": {
                "id": "1614078653433",
                "nameEn": "The Corner",
                "nameVi": "Góc",
                "descriptionEn": "",
                "descriptionVi": "",
                "contentEn": "Jill does not like math. Jill starts talking about food. Her friends laugh. They stop doing their homework. The teacher is upset. She tells them to stand in the corner. Jill goes to the corner. It is hard to be quiet. She thinks about her family. She thinks about her dog. Five minutes pass. The teacher lets her go.",
                "contentVi": "ill không thích môn toán. Jill bắt đầu nói chuyện về thức ăn. Bạn bè cười. Họ ngừng làm bài tập về nhà. Cô giáo buồn bã. Cô bảo họ phải đứng ở góc. Jill đi đến một góc. Thật khó để giữ yên tĩnh. Cô ấy nghĩ về gia đình mình. Cô ấy nghĩ về con chó của mình. Năm phút trôi qua. Cô giáo cho phép Jill đi.",
                "photo": "https://tonytran99.github.io/truyen-song-ngu-data/files/photo/stories/1614078653433.jpg",
                "audio": "https://tonytran99.github.io/truyen-song-ngu-data/files/audio/stories/1614078653433.mp3",
                "createdAt": "2021-02-23T11:10:56.357Z",
                "updatedAt": "2021-02-23T11:10:56.357Z"
            },
            "1614078462773": {
                "id": "1614078462773",
                "nameEn": "Different Foods",
                "nameVi": "Thức ăn khác",
                "descriptionEn": "",
                "descriptionVi": "",
                "contentEn": "Sara is hungry. She goes to the kitchen. She opens the cabinet. There are a lot of snacks. The marshmallows are too sweet. The potato chips are too salty. The ice cream is too watery. The kiwis are too sour. The cereal is too bland. Her dad comes home. He gives her crackers. The crackers are perfect.",
                "contentVi": "Sara đói. Cô ấy đi vào bếp. Cô mở tủ. Có rất nhiều đồ ăn nhẹ. Kẹo dẻo quá ngọt. Khoai tây chiên quá mặn. Kem chảy nước nhiều quá. Kiwis quá chua. Ngũ cốc quá nhạt nhẽo. Bố Sara về nhà. Ông ấy đưa cho cô bánh quy giòn. Bánh quy giòn thật hoàn hảo.",
                "photo": "https://tonytran99.github.io/truyen-song-ngu-data/files/photo/stories/1614078462773.jpg",
                "audio": "https://tonytran99.github.io/truyen-song-ngu-data/files/audio/stories/1614078462773.mp3",
                "createdAt": "2021-02-23T11:07:46.795Z",
                "updatedAt": "2021-02-23T11:07:46.795Z"
            },
            "1614078282209": {
                "id": "1614078282209",
                "nameEn": "Visiting the Doctor",
                "nameVi": "Đến bác sỹ",
                "descriptionEn": "",
                "descriptionVi": "",
                "contentEn": "Haley feels hot. Her mom touches her forehead. Haley has a fever. The mom takes Haley to a doctor. The doctor is kind. He gives her a sticker. He tells her to take a pill. He tells her to drink a lot of water. Haley goes home. She takes the pill and drinks water. She does this for three days. She is healthy again.",
                "contentVi": "Haley cảm thấy nóng. Mẹ cô chạm vào trán cô. Haley bị sốt. Mẹ đưa Haley đến bác sĩ. Bác sĩ rất tốt. Ông ấy cho Haley  một nhãn dán. Ông ấy bảo cô bé uống thuốc. Ông ấy bảo Haley uống nhiều nước. Haley về nhà. Cô ấy uống thuốc và uống nước. Cô ấy làm việc này trong ba ngày. Cô ấy đã khỏe mạnh trở lại.",
                "photo": "https://tonytran99.github.io/truyen-song-ngu-data/files/photo/stories/1614078282209.jpg",
                "audio": "https://tonytran99.github.io/truyen-song-ngu-data/files/audio/stories/1614078282209.mp3",
                "createdAt": "2021-02-23T11:04:46.637Z",
                "updatedAt": "2021-02-23T11:04:46.637Z"
            },
            "1614077910651": {
                "id": "1614077910651",
                "nameEn": "The First Song",
                "nameVi": "Bài hát đầu tiên",
                "descriptionEn": "",
                "descriptionVi": "",
                "contentEn": "She sits in the car. Her dad turns on the radio. A song plays. She taps her feet. She sways her head. Her dad laughs at her. He likes the song too. The song is over. The radio plays a different song. She does not like the new song. She sits quietly.",
                "contentVi": "Cô ấy ngồi trong xe ô tô. Bố cô ấy bật radio. Một bài hát cất lên. Cô ấy dậm dậm chân. Cô ấy lắc lư  đầu. Bố cô ấy cười. Ông cũng thích bài hát này. Bài hát đã kết thúc. Radio phát một bài hát khác. Cô ấy không thích bài hát mới. Cô ngồi yên.",
                "photo": "https://tonytran99.github.io/truyen-song-ngu-data/files/photo/stories/1614077910651.jpg",
                "audio": "https://tonytran99.github.io/truyen-song-ngu-data/files/audio/stories/1614077910651.mp3",
                "createdAt": "2021-02-23T10:58:35.116Z",
                "updatedAt": "2021-02-23T10:58:35.116Z"
            },
            "1614077774229": {
                "id": "1614077774229",
                "nameEn": "Chores",
                "nameVi": "Việc vặt trong nhà",
                "descriptionEn": "",
                "descriptionVi": "",
                "contentEn": "He is playing video games. Mom gets mad. She thinks he is lazy. She gives him a list of chores. He frowns. He looks at the list. He has to clean the floors. Then, he has to wash the dishes. Finally, he has to feed his dog. He starts doing his chores.\n",
                "contentVi": "Cậu ấy đang chơi video game. Mẹ nổi giận. Mẹ nghĩ cậu ấy lười nhác. Mẹ đưa cho cậu ấy một danh sách việc nhà. Cậu ấy cau mày. Cậy ấy nhìn vào danh sách. Cậu ấy phải lau sàn. Sau đó cậu ấy phải rửa bát. Cuối cùng, cậu ấy phải cho chó ăn. Cậu ấy bắt đầu làm việc nhà.",
                "photo": "https://tonytran99.github.io/truyen-song-ngu-data/files/photo/stories/1614077774229.jpg",
                "audio": "https://tonytran99.github.io/truyen-song-ngu-data/files/audio/stories/1614077774229.mp3",
                "createdAt": "2021-02-23T10:56:18.507Z",
                "updatedAt": "2021-02-23T10:56:18.507Z"
            },
            "1614077392650": {
                "id": "1614077392650",
                "nameEn": "Waiting",
                "nameVi": "Chờ đợi",
                "descriptionEn": "",
                "descriptionVi": "",
                "contentEn": "The kids are in class. The teacher is teaching math. The kids are tired. They want to play. They want to see the sun. They like slides. They also like swings. They don't like math. They stare at the clock. The clock moves slowly. The kids continue to wait.",
                "contentVi": "Những đứa trẻ ngồi trong lớp. Giáo viên đang dạy toán. Những đứa trẻ thấy mệt mỏi. Chúng muốn được chơi. Chúng muốn nhìn thấy mặt trời. Chúng thích chơi cầu trượt. Chúng cũng thích chơi xích đu. Chúng lại không thích học toán. Chúng nhìn chằm chằm vào đồng hồ. Đồng hồ sao chậm thế. Những đứa trẻ tiếp tục chờ đợi.",
                "photo": "https://tonytran99.github.io/truyen-song-ngu-data/files/photo/stories/1614077392650.jpg",
                "audio": "https://tonytran99.github.io/truyen-song-ngu-data/files/audio/stories/1614077392650.mp3",
                "createdAt": "2021-02-23T10:49:56.912Z",
                "updatedAt": "2021-02-23T10:49:56.912Z"
            },
            "1614077008225": {
                "id": "1614077008225",
                "nameEn": "She Goes to the Nurse",
                "nameVi": "Đến gặp y tá",
                "descriptionEn": "The story is about a girl who falls down and goes to the nurse",
                "descriptionVi": "Câu chuyện kể về một cô gái bị ngã và đến gặp y tá",
                "contentEn": "She goes out to play. She runs around. She falls down. It hurts. She cries. She gets up. She goes to the nurse. The nurse is nice. She looks friendly. The nurse gives her a lollipop. It tastes good. The nurse gives her a bandage. She is okay now. She walks back to class.",
                "contentVi": "Cô bé ra ngoài chơi. Cô bé chạy vòng vòng. Cô bé ngã. Cô bé bị đau. Cô bé khóc. Cô bé đứng dậy. Cô bé đi gặp y tá. Cô y tá rất tốt và thân thiện. Cô y tá cho cô bé một chiếc kẹo que. Nó rất ngon. Cô y tá băng vết thương cho cô bé. Bây giờ cô bé thấy ổn rồi. Cô bé quay lại lớp học.",
                "photo": "https://tonytran99.github.io/truyen-song-ngu-data/files/photo/stories/1614077008225.jpg",
                "audio": "https://tonytran99.github.io/truyen-song-ngu-data/files/audio/stories/1614077008225.mp3",
                "createdAt": "2021-02-23T10:43:32.000Z",
                "updatedAt": "2021-02-23T10:43:32.000Z"
            },
            "1614076638303": {
                "id": "1614076638303",
                "nameEn": "Christmas Time",
                "nameVi": "Giáng Sinh",
                "descriptionEn": "A story about Tim's Christmas",
                "descriptionVi": "Truyện kể về ngày lễ giáng sinh của Tim",
                "contentEn": "It is Christmas. Dad gives Tim a toy. The toy is in the box. Tim takes off the lid. He sees the toy. It is a car. The car is red. The car makes noises. The car moves fast. Tim likes the gift. He hugs his dad. Dad smiles.",
                "contentVi": "Giáng sinh rồi. Bố tặng Tim một món đồ chơi. Đồ chơi ở trong hộp. Tim mở nắp ra. Cậu bé nhìn thấy món đồ chơi. Đó là một chiếc xe. Chiếc xe màu đỏ. Chiếc xe có thể phát ra tiếng. Chiếc xe đi rất nhanh. Tim thích món quà này. Cậu bé ôm lấy bố. Bố mỉm cười.",
                "photo": "https://tonytran99.github.io/truyen-song-ngu-data/files/photo/stories/1614076638303.jpg",
                "audio": "https://tonytran99.github.io/truyen-song-ngu-data/files/audio/stories/1614076638303.mp3",
                "createdAt": "2021-02-23T10:37:22.327Z",
                "updatedAt": "2021-02-23T10:37:22.327Z"
            },
            "1614076067040": {
                "id": "1614076067040",
                "nameEn": "Going to the Zoo",
                "nameVi": "Đi đến sở thú",
                "descriptionEn": "A story about a girl going to the zoo",
                "descriptionVi": "Câu chuyện về một cô gái đi đến sở thú",
                "contentEn": "She goes to the zoo. She sees a lion. The lion roars. She sees an elephant. The elephant has a long trunk. She sees a turtle. The turtle is slow. She sees a rabbit. The rabbit has soft fur. She sees a gorilla. The gorilla is eating a banana.",
                "contentVi": "Cô ấy đi đến sở thú. Cô ấy nhìn thấy một con sư tử. Con sư tử gầm lên. Cô ấy nhìn thấy một con voi. Con voi có cái vòi dài. Cô ấy nhìn thấy một con rùa. Con rùa thật chậm chạp. Cô ấy nhìn thấy một con thỏ. Con thỏ có bộ lông mềm. Cô ấy nhìn thấy một con khỉ đột. Con khỉ đột đang ăn chuối.",
                "photo": "https://tonytran99.github.io/truyen-song-ngu-data/files/photo/stories/1614076067040.jpg",
                "audio": "https://tonytran99.github.io/truyen-song-ngu-data/files/audio/stories/1614076067040.mp3",
                "createdAt": "2021-02-23T10:27:56.887Z",
                "updatedAt": "2021-02-23T10:27:56.887Z"
            }
        },
        "totalStories": 12,
        "uid": "1614075442460"
    }
}