{
    "word": "accumulate",
    "type": "adjective, verb",
    "spelling": "/əˈkjuːmjʊˌleɪt/",
    "meanings": [
        {
            "content": "tích lũy",
            "type": "",
            "example": {
                "en": "Why the need for accumulating money, then doing philanthropy?",
                "vi": "Tại sao lại có nhu cầu tích lũy tiền, sau đó lại đi làm từ thiện?"
            }
        },
        {
            "content": "tích",
            "type": "verb",
            "example": {
                "en": "Those side effects accumulate and eventually cause pathology.",
                "vi": "Những tác dụng phụ tích tụ và cuối cùng gây ra bệnh lý."
            }
        },
        {
            "content": "dồn",
            "type": "verb",
            "example": {}
        },
        {
            "content": "ộn",
            "type": "",
            "example": {}
        },
        {
            "content": "chất đống",
            "type": "",
            "example": {
                "en": "The same may be said of trash left to accumulate at the entrance of the house or on the sidewalks nearby.",
                "vi": "Cũng vậy, rác thải chất đống ở lối ra vào hoặc trên lề đường trông thật khó coi."
            }
        },
        {
            "content": "chồng chất",
            "type": "",
            "example": {
                "en": "Pain just kept accumulating in his life.",
                "vi": "Nỗi đau cứ chồng chất lên cuộc đời anh ấy."
            }
        },
        {
            "content": "dồn dập",
            "type": "verb",
            "example": {}
        },
        {
            "content": "gom góp lại",
            "type": "",
            "example": {}
        },
        {
            "content": "làm giàu",
            "type": "",
            "example": {}
        },
        {
            "content": "tích của",
            "type": "",
            "example": {
                "en": "‘Woe to him who accumulates what is not his",
                "vi": "‘Khốn cho kẻ tích của chẳng thuộc về mình,"
            }
        },
        {
            "content": "tích luỹ",
            "type": "",
            "example": {
                "en": "It's accumulating new ways of making living organisms",
                "vi": "Nó đang tích luỹ những cách mới trong việc tạo ra các sinh vật"
            }
        },
        {
            "content": "dành dụm",
            "type": "",
            "example": {}
        },
        {
            "content": "gom góp",
            "type": "",
            "example": {
                "en": "It took us several years to accumulate enough pieces to use them.",
                "vi": "Cũng phải mất một vài năm để chúng tôi gom góp đủ muỗng nĩa để sử dụng."
            }
        },
        {
            "content": "góp nhặt",
            "type": "",
            "example": {
                "en": "The patient accumulation of these little flecks has brought me great wealth.”",
                "vi": "Việc kiên trì góp nhặt các hạt phấn vàng li ti này đã làm cho ta giàu có.”"
            }
        },
        {
            "content": "thu gom",
            "type": "",
            "example": {
                "en": "and this allowed us to accumulate the algal biomass",
                "vi": "và điều này cho phép chúng tôi thu gom sinh khối tảo"
            }
        },
        {
            "content": "thu nhặt",
            "type": "",
            "example": {}
        },
        {
            "content": "tích trữ",
            "type": "",
            "example": {
                "en": "They've accumulated wealth in foreign accounts and would like me to invest it for them in Florida real estate.",
                "vi": "Họ đã tích trữ tài sản trong các tài khoản nước ngoài và muốn tôi đầu tư chúng vào bất động sản Florida."
            }
        },
        {
            "content": "để dành",
            "type": "",
            "example": {
                "en": "Save a little money regularly, and you will be surprised how it accumulates.",
                "vi": "Hãy để dành đều đặn một ít tiền và các anh em sẽ ngạc nhiên khi thấy nó tích lũy."
            }
        }
    ],
    "hasAudio": 0
}