{
    "word": "active",
    "type": "adjective, noun",
    "spelling": "/ˈæktɪv/",
    "meanings": [
        {
            "content": "tích cực",
            "type": "adjective",
            "example": {
                "en": "I have an active share in Christian activities",
                "vi": "Tôi tích cực tham gia các hoạt động của đạo Đấng Ki-tô"
            }
        },
        {
            "content": "hoạt tính",
            "type": "",
            "example": {
                "en": "Or use an active tension cords to make it move",
                "vi": "Hoặc dùng các dây căng hoạt tính để khiến nó di chuyển"
            }
        },
        {
            "content": "chủ động",
            "type": "adjective",
            "example": {
                "en": "But she learned how to be active in her silent , dark environment .",
                "vi": "Nhưng cô ấy cũng học cách chủ động trong môi trường tối tăm và lặng im ấy ."
            }
        },
        {
            "content": "có hiệu lực",
            "type": "",
            "example": {
                "en": "But her social went active about six months ago.",
                "vi": "Số An sinh xã hội của cô bé có hiệu lực khoảng sáu tháng trước."
            }
        },
        {
            "content": "công hiệu",
            "type": "",
            "example": {
                "en": "We have three different strains of Agarikon mushrooms highly active against flu viruses.",
                "vi": "Chúng tôi có ba chủng nấm Agaricon có công hiệu cao đối với virut cúm."
            }
        },
        {
            "content": "hiệu lực",
            "type": "",
            "example": {
                "en": "But her social went active about six months ago.",
                "vi": "Số An sinh xã hội của cô bé có hiệu lực khoảng sáu tháng trước."
            }
        },
        {
            "content": "hoạt động",
            "type": "noun",
            "example": {
                "en": "Brain wave activity is normal and wave profile is completely healthy.",
                "vi": "Sóng não hoạt động bình thường. và từ bước sónghể cho thấy cơ hoàn toàn khỏe mạnh."
            }
        },
        {
            "content": "nhanh nhẹn",
            "type": "adjective",
            "example": {
                "en": "We have active shooters.",
                "vi": "Chúng ta có những xa thủ nhanh nhẹn rồi."
            }
        },
        {
            "content": "cao",
            "type": "adjective",
            "example": {
                "en": "Its main active ingredient is nicotine, a highly addictive drug.",
                "vi": "Thành phần hoạt hóa chính trong khói thuốc là nicotin, một chất thuốc gây nghiện cao độ."
            }
        },
        {
            "content": "đang hoạt động",
            "type": "",
            "example": {
                "en": "And this is still a very active subject.",
                "vi": "Và đây là chủ thể đang hoạt động."
            }
        },
        {
            "content": "hiếu động",
            "type": "adjective",
            "example": {
                "en": "Channel his hyperactivity by assigning chores that involve being active, such as walking the dog.",
                "vi": "Với trẻ hiếu động thái quá, bạn hãy giao những công việc đòi hỏi trẻ phải hoạt động."
            }
        },
        {
            "content": "hoá hoạt động",
            "type": "",
            "example": {}
        },
        {
            "content": "linh lợi",
            "type": "",
            "example": {}
        },
        {
            "content": "mau mắn",
            "type": "adjective",
            "example": {
                "en": "▪ Why should we report our field service activity promptly each month?",
                "vi": "▪Tại sao chúng ta nên mau mắn nộp báo cáo rao giảng mỗi tháng?"
            }
        },
        {
            "content": "nhanh nhảu",
            "type": "",
            "example": {}
        },
        {
            "content": "phóng xạ",
            "type": "adjective verb noun",
            "example": {
                "en": "Cos it wouldn't be right to just send people into an active radiation area.",
                "vi": "Vì không thể đưa người tới vùng đã nhiễm phóng xạ."
            }
        },
        {
            "content": "thiết thực",
            "type": "",
            "example": {
                "en": "3 APPLY: If we see the practical value of an activity, we benefit more from it.",
                "vi": "3 ÁP DỤNG: Khi thấy rõ giá trị thiết thực của việc mình đang làm thì chúng ta sẽ nhận được nhiều lợi ích hơn."
            }
        },
        {
            "content": "thực sự",
            "type": "adverb",
            "example": {
                "en": "And I suspect, by someone who actively dislikes us.",
                "vi": "Và tôi nghi ngờ rằng, việc này do ai đó thực sự không ưa chúng ta."
            }
        },
        {
            "content": "tại ngũ",
            "type": "",
            "example": {
                "en": "Active military aren't allowed to speak to the press.",
                "vi": "Quân nhân tại ngũ không được phép nói chuyện với báo chí."
            }
        },
        {
            "content": "tỉnh táo",
            "type": "adjective",
            "example": {}
        },
        {
            "content": "đang dùng",
            "type": "",
            "example": {
                "en": "Show Image in Active Window",
                "vi": "Hiện ảnh trong cửa sổ đang dùng"
            }
        },
        {
            "content": "hiện hoạt",
            "type": "",
            "example": {
                "en": "There's a lot of activity in China.",
                "vi": "Ở Trung Quốc hiện hoạt động rất mạnh."
            }
        },
        {
            "content": "năng động",
            "type": "",
            "example": {
                "en": "The stock market is very active.",
                "vi": "Thị trường chứng khoáng rất năng động."
            }
        },
        {
            "content": "thể chủ động",
            "type": "",
            "example": {
                "en": "Or if your adolescent is lonely, you might need to take an active role in helping him or her find good associates.",
                "vi": "Hay nếu con cảm thấy lẻ loi, bạn có thể chủ động giúp con tìm những mối giao tiếp lành mạnh."
            }
        }
    ],
    "hasAudio": 1
}