{
    "word": "actually",
    "type": "adverb",
    "spelling": "/ˈæk.ʃə.li/, /ˈæk.tʃu.ə.li/",
    "meanings": [
        {
            "content": "thực sự",
            "type": "adverb",
            "example": {
                "en": "This sentence actually comes from Spanish.",
                "vi": "Câu này thực sự điến từ Tây Ban Nha"
            }
        },
        {
            "content": "quả là",
            "type": "",
            "example": {
                "en": "But, actually, the point of placebo education is interesting.",
                "vi": "Nhưng, vấn đề giáo dục an thần quả là thú vị."
            }
        },
        {
            "content": "quả thật",
            "type": "",
            "example": {
                "en": "What they came up with was actually quite interesting.",
                "vi": "Họ đã làm những việc quả thật khá thú vi."
            }
        },
        {
            "content": "thực ra",
            "type": "adverb",
            "example": {
                "en": "I'm saying \"For the sake of Earth's environment,\" but actually it's \"For the sake of the people living on Earth.\"",
                "vi": "Tôi nói là \"Vì môi trường của Trái Đất\", nhưng thực ra nó là \"Vì những người đang sống trên Trái Đất\"."
            }
        },
        {
            "content": "đúng",
            "type": "adjective",
            "example": {
                "en": "If they can do it in 10 seconds, they're going to actually earn that money.",
                "vi": "Nếu họ có thể làm trong 10 giây, họ sẽ nhận được đúng số tiền đó."
            }
        },
        {
            "content": "hoàn toàn",
            "type": "adverb",
            "example": {
                "en": "Question is, did he actually destroy the real Horcrux?",
                "vi": "Tất nhiên ông ấy đã không thể phá hủy hoàn toàn Trường sinh linh giá thật."
            }
        },
        {
            "content": "kể ra",
            "type": "adverb",
            "example": {
                "en": "That's actually sort of hard to do.",
                "vi": "Làm vậy kể ra cũng khó."
            }
        },
        {
            "content": "thật ra",
            "type": "adverb",
            "example": {
                "en": "Now this view is not particularly new, actually.",
                "vi": "Quan điểm này thật ra không có gì mới."
            }
        },
        {
            "content": "hiện nay",
            "type": "",
            "example": {
                "en": "Most of the farmers I know are actually women.",
                "vi": "Hầu hết nông dân hiện nay là phụ nữ."
            }
        },
        {
            "content": "hiện thời",
            "type": "",
            "example": {
                "en": "Actually, if current trends continue,",
                "vi": "Thật sự, nếu xu hướng hiện thời tiếp diễn,"
            }
        },
        {
            "content": "hiện tại",
            "type": "adjective noun adverb",
            "example": {
                "en": "Well, you definitely want to maintain residency in your actual home.",
                "vi": "Nhất định chị sẽ muốn níu giữ cuộc sống nơi mái ấm hiện tại."
            }
        },
        {
            "content": "quả thực",
            "type": "",
            "example": {
                "en": "There's been a ton of research on this, and the results are actually incredible.",
                "vi": "Có rất nhiều nghiên cứu về vấn đề này, và kết quả thực sự đáng kinh ngạc."
            }
        },
        {
            "content": "quả tình",
            "type": "",
            "example": {}
        },
        {
            "content": "thật sự",
            "type": "",
            "example": {
                "en": "She looks young, but she's actually older than you are.",
                "vi": "Cô ấy nhìn có vẻ trẻ thật đấy nhưng thật sự thì cô ta già hơn cậu nhiều."
            }
        },
        {
            "content": "thực tế",
            "type": "adjective noun adverb",
            "example": {
                "en": "But actually these, like I said, are still the actual prototype.",
                "vi": "Nhưng trên thực tế chúng, như tôi đã nói, vẫn còn là mẫu."
            }
        }
    ],
    "hasAudio": 0
}