{
    "word": "adverse",
    "type": "adjective",
    "spelling": "/ədˈvɜːs/, /ˈædvɜːs/",
    "meanings": [
        {
            "content": "bất lợi",
            "type": "adjective",
            "example": {
                "en": "At times, though, the short-term effect may bring adversity.",
                "vi": "Tuy nhiên, đôi khi chúng ta phải chịu điều bất lợi trong một thời gian."
            }
        },
        {
            "content": "ngược",
            "type": "adjective",
            "example": {
                "en": "However, as they were confronted with persecution and adversity, they fell away into forbidden paths and were lost.",
                "vi": "Tuy nhiên, khi họ bị ngược đãi và đương đầu với nghịch cảnh thì họ rơi vào những lối cấm rồi lạc mất."
            }
        },
        {
            "content": "tiêu cực",
            "type": "adjective",
            "example": {
                "en": "to be able to not react to these heinous crimes in an adverse manner.",
                "vi": "để không phản ứng một cách tiêu cực đối với những tội ác man rợ này."
            }
        },
        {
            "content": "xấu",
            "type": "adjective",
            "example": {
                "en": "He says that it is simply a form of relaxation and that he is not adversely affected.",
                "vi": "Anh ta nói đó chỉ là một hình thức giải trí và anh không bị ảnh hưởng xấu."
            }
        },
        {
            "content": "đối nghịch",
            "type": "adjective",
            "example": {}
        },
        {
            "content": "bên kia",
            "type": "",
            "example": {}
        },
        {
            "content": "chống đối",
            "type": "adjective",
            "example": {
                "en": "That was just a hint of the gathering storm of opposition and adversity to come.",
                "vi": "Sự kiện này mới chỉ là dấu hiệu của cơn bão chống đối và nghịch cảnh sắp đến."
            }
        },
        {
            "content": "có hại",
            "type": "",
            "example": {
                "en": "that are at risk of having an adverse drug reaction.",
                "vi": "có nhiều nguy cơ gặp phản ứng có hại của thuốc."
            }
        },
        {
            "content": "nghịch cảnh",
            "type": "noun",
            "example": {
                "en": "Each of us will face adversity no matter where we are.",
                "vi": "Dù ở bất cứ đâu, mỗi người chúng ta sẽ đương đầu với nghịch cảnh."
            }
        },
        {
            "content": "nghịch lại",
            "type": "",
            "example": {
                "en": "Judging the beasts adversely, he took rulership away from them and destroyed the fourth beast.",
                "vi": "Phán xét nghịch lại con thú, Ngài tước quyền cai trị khỏi tay chúng và hủy diệt con thú thứ tư."
            }
        },
        {
            "content": "thù địch",
            "type": "adjective",
            "example": {}
        },
        {
            "content": "đối diện",
            "type": "",
            "example": {
                "en": "\" When adversity knocks on your door , how do you respond ?",
                "vi": "\" Khi đối diện với nghịch cảnh thì con phản ứng thế nào ?"
            }
        },
        {
            "content": "đối địch",
            "type": "",
            "example": {}
        }
    ],
    "hasAudio": 1
}