{
    "word": "agency",
    "type": "noun",
    "spelling": "/ˈeː.ʤən.si/",
    "meanings": [
        {
            "content": "cơ quan",
            "type": "noun",
            "example": {
                "en": "Is there another agency following you I'm not aware of?",
                "vi": "Còn có một cơ quan khác theo đuôi cô mà tôi không được biết đến?"
            }
        },
        {
            "content": "hãng",
            "type": "noun",
            "example": {
                "en": "I went by the agency, but you weren't there.",
                "vi": "Tôi đã tới hãng, nhưng anh không có ở đó."
            }
        },
        {
            "content": "chi nhánh",
            "type": "noun",
            "example": {
                "en": "Secure lines are being set up with all field offices as well as other agencies.",
                "vi": "Các đường dây mật đang được kết nối với các chi nhánh FBI và cơ quan khác."
            }
        },
        {
            "content": "đại lý",
            "type": "noun",
            "example": {
                "en": "I called the travel agency, they said no.",
                "vi": "Tôi vừa gọi cho đại lý, họ nói không có."
            }
        },
        {
            "content": "sở",
            "type": "",
            "example": {
                "en": "It's a small, newly formed agency.",
                "vi": "Đấy là một trụ sở nhỏ mới mở"
            }
        },
        {
            "content": "lực",
            "type": "noun",
            "example": {
                "en": "Can we attribute its existence to a “supernatural agency”?",
                "vi": "Chúng ta có thể nào nói sách đó đến từ một “quyền lực siêu nhiên” không?"
            }
        },
        {
            "content": "hãng thông tấn",
            "type": "noun",
            "example": {
                "en": "One source told the Interfax news agency that bodies were strewn over the road .",
                "vi": "Một nguồn tin cho hãng thông tấn xã Interfax biết các thi thể rải khắp con đường này ."
            }
        },
        {
            "content": "môi giới",
            "type": "noun",
            "example": {
                "en": "No, we are paid to line up for the real estate agency.",
                "vi": "Không, tụi này xếp hàng được công ty môi giới chứng khoán trả tiền."
            }
        },
        {
            "content": "phân điểm",
            "type": "",
            "example": {
                "en": "The US NRC has 11 agency experts in Tokyo monitoring the situation .",
                "vi": "Uỷ ban điều chỉnh hạt nhân Hoa Kỳ có 11 chuyên gia phân điểm ở Tokyo đang giám sát tình hình ."
            }
        },
        {
            "content": "sự môi giới",
            "type": "",
            "example": {}
        },
        {
            "content": "sự trung gian",
            "type": "noun",
            "example": {}
        },
        {
            "content": "tác dụng",
            "type": "noun",
            "example": {}
        },
        {
            "content": "cục",
            "type": "noun",
            "example": {
                "en": "Well, the agency has had eyes on them in the sky, although they deny it on all levels.",
                "vi": "Cục đã cho vệ tinh theo dõi chúng, mặc dù họ luôn phủ nhận nó ở mọi cấp độ."
            }
        }
    ],
    "hasAudio": 1
}