{
    "word": "along",
    "type": "adverb, adposition",
    "spelling": "/əˈlɒŋ/, /əˈlɔŋ/",
    "meanings": [
        {
            "content": "theo",
            "type": "verb adposition",
            "example": {
                "en": "Walk along the river and you will find the school.",
                "vi": "Đi dọc theo con sông và bạn sẽ tìm được ngôi trường."
            }
        },
        {
            "content": "dọc theo",
            "type": "adposition",
            "example": {
                "en": "Walk along the street and turn left at the third intersection.",
                "vi": "Đi dọc theo con phố và rẽ trái ở nút giao thứ ba."
            }
        },
        {
            "content": "dọc",
            "type": "adjective",
            "example": {
                "en": "He stopped to make speeches in cities along the way.",
                "vi": "Anh ta dừng lại để đọc diễn văn ở các thành phố dọc đường."
            }
        },
        {
            "content": "cùng với",
            "type": "adposition",
            "example": {
                "en": "I was shackled and blindfolded and along with several others thrown onto the back of a truck.",
                "vi": "Tôi bị xiềng, bịt mắt và tống lên xe cùng với một số người khác."
            }
        },
        {
            "content": "cùng đến",
            "type": "",
            "example": {
                "en": "I'll go along with that too.",
                "vi": "Tôi cũng sẽ cùng đến cùng với điều đó."
            }
        },
        {
            "content": "theo cùng",
            "type": "adposition",
            "example": {
                "en": "Ask the class to follow along, looking for the answer to the question on the board.",
                "vi": "Yêu cầu cả lớp dò theo, cùng tìm kiếm câu trả lời cho câu hỏi ở trên bảng."
            }
        },
        {
            "content": "đi theo",
            "type": "",
            "example": {
                "en": "If you thought all that, why did you come along?",
                "vi": "Nếu em đã nghĩ tới những chuyện đó, tại sao em đi theo anh?"
            }
        },
        {
            "content": "ở dọc",
            "type": "adposition",
            "example": {
                "en": "The alkaline waters help support the few people who live along its shore.",
                "vi": "Nước hồ có chất kiềm giúp nuôi sống số ít người ở dọc theo bờ hồ."
            }
        },
        {
            "content": "cùng",
            "type": "adjective conjunction verb noun",
            "example": {
                "en": "Frankly, sir, I'd like to have you along.",
                "vi": "Thẳng thắn mà nói, tôi muốn có anh đi cùng."
            }
        },
        {
            "content": "lẽo đẽo",
            "type": "",
            "example": {}
        },
        {
            "content": "suốt theo",
            "type": "",
            "example": {}
        },
        {
            "content": "theo chiều dài",
            "type": "",
            "example": {
                "en": "Logically, the poles ran through the rings and along the length of the Ark.",
                "vi": "Điều hợp lý là các đòn khiêng được xỏ qua khoen dọc theo chiều dài của Hòm."
            }
        },
        {
            "content": "tiến lên",
            "type": "",
            "example": {
                "en": "And anyway... we're starting to move along real nice.",
                "vi": "Dù sao thì... chúng tôi đã bắt đầu tiến lên rất tốt."
            }
        },
        {
            "content": "về phía trước",
            "type": "",
            "example": {
                "en": "TIMOTHY strode steadily along the road leading away from home, his eyes eagerly focused on what lay ahead.",
                "vi": "Ti-mô-thê sải bước trên con đường rời xa ngôi nhà của mình, cặp mắt chàng háo hức chăm chú về phía trước."
            }
        }
    ],
    "hasAudio": 1
}