{
    "word": "and",
    "type": "verb, noun, conjunction",
    "spelling": "/ən(d)/, /ænd/, /n̩/, /ɛn/",
    "meanings": [
        {
            "content": "và",
            "type": "conjunction",
            "example": {
                "en": "I got off at the bus stop and went to the right.",
                "vi": "Tôi rời khỏi trạm xe buýt và đi sang phải."
            }
        },
        {
            "content": "cùng",
            "type": "conjunction",
            "example": {
                "en": "This morning, my friend and I went to buy airline tickets.",
                "vi": "Sáng nay, tôi cùng bạn tôi đi mua vé máy bay."
            }
        },
        {
            "content": "còn",
            "type": "adverb",
            "example": {
                "en": "He is already skilled in both math and literature.",
                "vi": "Nó đã giỏi toán, còn giỏi cả văn."
            }
        },
        {
            "content": "với",
            "type": "conjunction",
            "example": {
                "en": "Roger, what you say makes sense and I agree with you.",
                "vi": "Roger, những gì bạn nói đều có lý và tôi đồng ý với bạn."
            }
        },
        {
            "content": "kết quả là",
            "type": "",
            "example": {
                "en": "We laughed, and as a result, anger and resentment rarely resulted.",
                "vi": "Chúng tôi cười và kết quả là cơn nóng giận và tức tối ít khi xảy đến."
            }
        },
        {
            "content": "lại",
            "type": "adverb",
            "example": {
                "en": "Mary is prettier and makes better grades than Alice.",
                "vi": "Mary vừa xinh hơn lại đạt điểm cao hơn Alice."
            }
        },
        {
            "content": "vả lại",
            "type": "conjunction",
            "example": {
                "en": "And if we do get angry and push or shove back, what happens?— We will probably get into a fight.",
                "vi": "Sẽ xảy ra gì nếu chúng ta nổi giận và vả lại?—Chúng ta sẽ đánh nhau chắc chắn."
            }
        },
        {
            "content": "nếu dường như",
            "type": "",
            "example": {
                "en": "And what if you seemed to receive no benefit in return?",
                "vi": "Và nếu dường như bạn không nhận được lợi ích nào khi phụng sự Ngài thì sao?"
            }
        },
        {
            "content": "tuồng như là",
            "type": "",
            "example": {}
        },
        {
            "content": "kiêm",
            "type": "",
            "example": {
                "en": "and we met with all of the pooh-bahs of little Greenville —",
                "vi": "Chúng tôi gặp tất cả những người kiêm nhiệm tại Greenville"
            }
        },
        {
            "content": "cộng với",
            "type": "",
            "example": {
                "en": "It's automatically mailed to you, plus shipping and handling.",
                "vi": "Nó được tự động gửi cho ông, cộng với vận chuyển và bốc dỡ."
            }
        }
    ],
    "hasAudio": 1
}