{
    "word": "appear",
    "type": [
        "verb"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/əˈpir/",
            "/əˈpɪr/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/əˈpɪə/"
        ]
    },
    "meanings": [
        {
            "content": "hiện",
            "type": "verb",
            "example": {
                "en": "She appears in many photos of the scene .",
                "vi": "Bà ta xuất hiện trong nhiều tấm hình ở hiện trường ."
            }
        },
        {
            "content": "xuất hiện",
            "type": "verb",
            "example": {
                "en": "When they first appeared, everyone thought we were gonna get superheroes.",
                "vi": "Khi nó mới xuất hiện, ai cũng tưởng lại sắp có các siêu nhân xuất hiện."
            }
        },
        {
            "content": "hình như",
            "type": "verb",
            "example": {
                "en": "He appears to be doing some form of the Macarena.",
                "vi": "Cậu ta hình như đang nhảy điệu Macarena."
            }
        },
        {
            "content": "ra mắt",
            "type": "verb",
            "example": {
                "en": "No small stir was created by its appearance.",
                "vi": "Sự ra mắt của sách đó gây ra môt canh náo đông."
            }
        },
        {
            "content": "ló",
            "type": "verb",
            "example": {
                "en": "A beautiful rainbow follows as the sun appears through the clouds.",
                "vi": "Rồi một chiếc cầu vồng tuyệt đẹp xuất hiện khi mặt trời ló dạng sau những đám mây."
            }
        },
        {
            "content": "chường",
            "type": "verb",
            "example": {}
        },
        {
            "content": "xuất hiện trước công chúng",
            "type": "",
            "example": {
                "en": "And he had never appeared in public since that point.",
                "vi": "Và ông không xuất hiện trước công chúng từ khi đó."
            }
        },
        {
            "content": "biểu lộ",
            "type": "",
            "example": {
                "en": "The Amlicites’ change in appearance was a manifestation of their rebellion.",
                "vi": "Việc dân Am Li Si thay đổi diện mạo là cách biểu lộ sự phản nghịch của họ."
            }
        },
        {
            "content": "có vẻ",
            "type": "",
            "example": {
                "en": "Well, it appears that today is my lucky day.",
                "vi": "Hôm nay có vẻ là ngày hên của ta đó."
            }
        },
        {
            "content": "hiện hình",
            "type": "verb",
            "example": {}
        },
        {
            "content": "hiện ra",
            "type": "",
            "example": {
                "en": "I have to admit that I love the fact that the phrase appears so often.",
                "vi": "Tôi phải thú nhận rằng tôi thích cụm từ đó hiện ra thường xuyên."
            }
        },
        {
            "content": "ló ra",
            "type": "",
            "example": {
                "en": "Pressure him until he appears, Mr. President.",
                "vi": "Gây áp lực cho đến khi hắn phải ló ra, thưa tổng thống."
            }
        },
        {
            "content": "lộ ra",
            "type": "",
            "example": {
                "en": "When the stalk sprouted and produced fruit, then the weeds also appeared.”",
                "vi": "Khi lúa mọc lên và kết hạt thì cỏ dại cũng lộ ra”."
            }
        },
        {
            "content": "nảy sinh",
            "type": "",
            "example": {}
        },
        {
            "content": "phát tiết",
            "type": "",
            "example": {}
        },
        {
            "content": "trình diện",
            "type": "",
            "example": {
                "en": "You've been subpoenaed to appear before a federal grand jury, as well.",
                "vi": "Cô cũng được triệu tập trình diện trước ban hội thẩm liên bang."
            }
        },
        {
            "content": "tỏ vẻ",
            "type": "verb",
            "example": {}
        },
        {
            "content": "được xuất bản",
            "type": "",
            "example": {
                "en": "This magazine, an early form of The Watchtower, appeared as a quarterly edition in 1903.",
                "vi": "Tạp chí này là tiền thân của Tháp Canh, và được xuất bản một số mỗi quý trong năm 1903."
            }
        },
        {
            "content": "đến",
            "type": "verb adposition",
            "example": {
                "en": "Would you be concerned only about the outer appearance?",
                "vi": "Lẽ nào bạn chỉ quan tâm đến hình thức bên ngoài?"
            }
        },
        {
            "content": "dường như",
            "type": "",
            "example": {
                "en": "At present, eradicating dengue completely does not appear to be possible.",
                "vi": "Hiện nay dường như không thể nào diệt trừ tận gốc bệnh đanga."
            }
        },
        {
            "content": "trông có vẻ",
            "type": "",
            "example": {
                "en": "● To the eye, the skin of a shark appears smooth.",
                "vi": "● Da cá mập trông có vẻ trơn láng."
            }
        }
    ]
}