{
    "word": "around",
    "type": [
        "adjective",
        "adverb",
        "adposition"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/əˈround/",
            "/əˈraʊnd/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/əˈraʊnd/"
        ]
    },
    "meanings": [
        {
            "content": "khắp",
            "type": "adverb",
            "example": {
                "en": "He frequently travels for work around the country, Sometimes overseas.",
                "vi": "Hắn thường đi lại làm ăn khắp nước, đôi khi ra nước ngoài."
            }
        },
        {
            "content": "xung quanh",
            "type": "adposition",
            "example": {
                "en": "There's a white picket fence around Tom's house.",
                "vi": "Có một hàng rào cọc trắng xung quanh nhà của Tom."
            }
        },
        {
            "content": "loanh quanh",
            "type": "",
            "example": {
                "en": "It's cover so you can go around shooting at people.",
                "vi": "Là cái vỏ bọc để anh có thể đi loanh quanh bắn người."
            }
        },
        {
            "content": "vòng quanh",
            "type": "",
            "example": {
                "en": "We took a turn around the city in our car.",
                "vi": "Chúng tôi đi dạo một vòng quanh thành phố bằng xe hơi."
            }
        },
        {
            "content": "đó đây",
            "type": "",
            "example": {
                "en": "You walk around with a chip, act like it's nothing.",
                "vi": "Em vẫn đi đó đây với con chip, hành động như không có gì cả."
            }
        },
        {
            "content": "quanh",
            "type": "adposition",
            "example": {
                "en": "Stop beating around the bush and tell me directly why you're so angry.",
                "vi": "Thôi đừng quanh co nữa, hãy nói thẳng cho tôi biết tại sao anh tức giận như vậy."
            }
        },
        {
            "content": "gần",
            "type": "adjective",
            "example": {
                "en": "I ended up in the local bookstore around the corner from our offices.",
                "vi": "Và tôi đi đến cửa hàng sách gần góc đường gần văn phòng tôi."
            }
        },
        {
            "content": "chừng độ",
            "type": "adposition",
            "example": {}
        },
        {
            "content": "khắp xung quanh",
            "type": "",
            "example": {
                "en": "They hung circular shields all around your walls",
                "vi": "Chúng treo khiên tròn khắp xung quanh tường;"
            }
        },
        {
            "content": "tầm",
            "type": "adposition",
            "example": {
                "en": "And you threw a fish tank around four today.",
                "vi": "Và sau đó là hôm nay, tầm khoảng 4 giờ chiều đã tấn công bằng bình nuôi cá."
            }
        },
        {
            "content": "khoảng",
            "type": "adposition",
            "example": {
                "en": "It's been raining for around a week.",
                "vi": "Trời mưa khoảng 1 tuần nay rồi."
            }
        },
        {
            "content": "trạc",
            "type": "adverb",
            "example": {}
        },
        {
            "content": "chung quanh",
            "type": "adposition",
            "example": {
                "en": "We see around us something green and wet.",
                "vi": "Chúng ta thấy màu lá xanh ẩm ướt chung quanh."
            }
        },
        {
            "content": "chỗ này",
            "type": "",
            "example": {
                "en": "Isn't there some Cuban place around here where we used to go when this place was closed?",
                "vi": "Không có quán Cuba nào quanh đây mà ta từng ngồi khi chỗ này đóng cửa sao?"
            }
        },
        {
            "content": "chỗ nọ",
            "type": "",
            "example": {}
        },
        {
            "content": "khoảng chừng",
            "type": "adposition",
            "example": {
                "en": "Added to that , the dietary fiber contained in white rice is around a quarter of brown rice .",
                "vi": "Hơn nữa , lượng chất xơ trong gạo trắng khoảng chừng 1⁄4 lượng chất xơ trong gạo lức ."
            }
        },
        {
            "content": "khắp nơi",
            "type": "adverb",
            "example": {
                "en": "Well, the idea that we'd go around the country killing people who go around the country killing people.",
                "vi": "Chúng tôi sẽ đi khắp đất nước này để giết những kẻ chuyên đi khắp nơi giết người."
            }
        },
        {
            "content": "quanh quẩn",
            "type": "",
            "example": {
                "en": "And we hung around with a helicopter for two whole weeks.",
                "vi": "Và chúng tôi quanh quẩn ở đấy với chiếc trực thăng suốt hai tuần."
            }
        },
        {
            "content": "ở gần",
            "type": "",
            "example": {
                "en": "I only spent so much time around your brother just to be around you.",
                "vi": "Lý do duy nhất tớ ở với em cậu nhiều đến vậy là để được ở gần cậu."
            }
        },
        {
            "content": "bao quanh",
            "type": "verb",
            "example": {
                "en": "He will weave a web around this Italy that may not exist.",
                "vi": "Hắn sẽ dệt cái lưới bao quanh nước Ý mà điều đó không nên xảy ra."
            }
        },
        {
            "content": "gần đây",
            "type": "adverb",
            "example": {
                "en": "I know, it's kind of weird around here lately, especially with Carl being gone.",
                "vi": "Tôi biết, gần đây không khí trong nhà khá lạ lẫm, đặc biệt là lúc Carl đi."
            }
        },
        {
            "content": "vào khoảng",
            "type": "",
            "example": {
                "en": "They attacked both places at once, sometime around 2 am.",
                "vi": "Chuyện này sẽ diễn ra vào khoảng 2 giờ."
            }
        }
    ]
}