{
    "word": "as",
    "type": "noun, adverb, conjunction, abbreviation, adposition",
    "spelling": "/əz/, /æz/",
    "meanings": [
        {
            "content": "như",
            "type": "adverb",
            "example": {
                "en": "Could Tom really be as busy as he says he is?",
                "vi": "Liệu Tom có thật sự bận rộn như cậu ấy nói?"
            }
        },
        {
            "content": "cũng",
            "type": "adverb",
            "example": {
                "en": "He is very bright, and his brother is as bright.",
                "vi": "Cậu ấy rất thông minh, cả em cậu ấy cũng vậy."
            }
        },
        {
            "content": "bằng",
            "type": "adjective noun adposition",
            "example": {
                "en": "There are as many museums as there are churches.",
                "vi": "Số lượng bảo tàng và nhà thờ bằng nhau."
            }
        },
        {
            "content": "là",
            "type": "verb noun",
            "example": {
                "en": "As long as it doesn't get cold, it's okay.",
                "vi": "Miễn sao nó không bị cảm lạnh là được."
            }
        },
        {
            "content": "với tư cách là",
            "type": "",
            "example": {
                "en": "I'm not gonna say this as your friend... but as Monica's older brother.",
                "vi": "Tớ nói với cậu chuyện này không phải với tư cách là 1 người bạn mà với tư cách là anh trai Monica."
            }
        },
        {
            "content": "đã",
            "type": "adverb",
            "example": {
                "en": "He is, so far as I know, a good guy.",
                "vi": "Như tôi đã biết thì anh ta thật sự là một chàng trai tốt bụng."
            }
        },
        {
            "content": "cũng như vậy",
            "type": "",
            "example": {
                "en": "Talking to their families is his priority as it would be mine.",
                "vi": "Nói chuyện với gia đình họ là ưu tiên hàng đầu, tôi cũng như vậy thôi."
            }
        },
        {
            "content": "do",
            "type": "conjunction",
            "example": {
                "en": "And so, as the surrounding water gets warmer, it speeds up the melting of the ice.",
                "vi": "Và do đó, vùng nước xung quanh trở nên nóng hơn, đẩy nhanh tốc độ tan băng."
            }
        },
        {
            "content": "vì",
            "type": "conjunction",
            "example": {
                "en": "India was Hindu, then it became Buddhist, then it became Hindu again, as Hinduism reabsorbed Buddhism.",
                "vi": "Ấn Độ theo đạo Hindu, sau đó là Phật Giáo, tiếp theo lại là đạo Hindu vì đạo Hindu đã tái hấp thụ Phật Giáo"
            }
        },
        {
            "content": "khi",
            "type": "verb",
            "example": {
                "en": "He was so kind as to show me the way to the station.",
                "vi": "Anh ấy thật tốt bụng khi chỉ đường đến ga."
            }
        },
        {
            "content": "nhân vì",
            "type": "adverb",
            "example": {
                "en": "Incarceration in jails and prisons as a result of alcohol- and drug-related crime is also very high.24",
                "vi": "Số tù nhân vì tội ác liên quan đến rượu chè và ma túy cũng rất đông.24"
            }
        },
        {
            "content": "như là",
            "type": "",
            "example": {
                "en": "It looks as if it's going to rain.",
                "vi": "Trông như là sắp có mưa."
            }
        },
        {
            "content": "phàm",
            "type": "conjunction",
            "example": {
                "en": "In order to defeat Drex, you will have to work together, utilizing all of your superpowers as one force.",
                "vi": "Để đánh bại Drex, các cháu phải đoàn kết, vận dụng các kỹ năng siêu phàm, kết hợp thành một."
            }
        },
        {
            "content": "theo như",
            "type": "",
            "example": {
                "en": "As far as I know, she hasn't departed yet.",
                "vi": "Theo như tôi biết, cô ta chưa đi đâu."
            }
        },
        {
            "content": "tại vì",
            "type": "conjunction",
            "example": {
                "en": "Because the peak of the mountain has a natural arch that seems as if it were gouged out of the mountain.",
                "vi": "Tại vì đỉnh núi có cái hình cung thiên nhiên trông giống như nó được đục ra khỏi ngọn núi."
            }
        },
        {
            "content": "đã là",
            "type": "",
            "example": {
                "en": "That this is as good as we're going to get.",
                "vi": "Rằng thế này đã là tốt nhất chúng ta có thể đạt được rồi."
            }
        },
        {
            "content": "đồng át",
            "type": "",
            "example": {}
        },
        {
            "content": "biết bao",
            "type": "",
            "example": {
                "en": "How surprised he was to find as many blueberries as ever.",
                "vi": "Nó ngạc nhiên biết bao khi thấy có rất nhiều quả dâu xanh hơn bao giờ hết."
            }
        },
        {
            "content": "biết bao nhiêu",
            "type": "",
            "example": {}
        },
        {
            "content": "biết chừng nào",
            "type": "",
            "example": {
                "en": "Tell the Karstarks that as long as they remain loyal, he will not be harmed.",
                "vi": "Báo cho nhà Karstark biết chừng nào họ còn trung thành, thì ông ta sẽ vô sự."
            }
        },
        {
            "content": "bởi vì",
            "type": "conjunction",
            "example": {
                "en": "because he wants to get out of town as soon as possible.",
                "vi": "bởi vì ông ấy muốn rời khỏi đây càng sớm càng tốt."
            }
        },
        {
            "content": "giống",
            "type": "verb noun",
            "example": {
                "en": "To me, it's as rare as a girl who's never late.",
                "vi": "Với tôi, thứ hiếm hoi giống như là gặp một người phụ nữ hẹn hò đúng giờ."
            }
        },
        {
            "content": "giống như",
            "type": "",
            "example": {
                "en": "You don't do it as a human being. You do it as a machine.",
                "vi": "Bạn không làm điều đó giống như con người. Bạn làm giống như một cái máy."
            }
        },
        {
            "content": "mặc dù",
            "type": "",
            "example": {
                "en": "Because as much as I would love to, that ship has sailed.",
                "vi": "Chứ mặc dù tôi cũng rất muốn, thì gạo đã nấu thành cơm rồi."
            }
        },
        {
            "content": "xiết bao",
            "type": "",
            "example": {
                "en": "8 What great happiness will come in the new world as all our ills are eliminated!",
                "vi": "8 Thật sẽ là hạnh phúc xiết bao trong thế giới mới khi tất cả mọi bệnh tật được dẹp bỏ!"
            }
        }
    ],
    "hasAudio": 1
}