{
    "word": "association",
    "type": [
        "noun"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/əˌsōsēˈāSH(ə)n/",
            "/əˌsoʊsiˈeɪʃ(ə)n/",
            "/əˌsōSHēˈāSH(ə)n/",
            "/əˌsoʊʃiˈeɪʃ(ə)n/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/əsəʊʃɪˈeɪʃ(ə)n/",
            "/əsəʊsɪˈeɪʃ(ə)n/"
        ]
    },
    "meanings": [
        {
            "content": "hội",
            "type": "noun",
            "example": {
                "en": "Dad and Mother took full advantage of all opportunities to fellowship and associate.",
                "vi": "Cha và mẹ tận dụng mọi cơ hội để kết hợp và hội họp cùng anh em."
            }
        },
        {
            "content": "quần hợp",
            "type": "",
            "example": {
                "en": "All they do is follow simple association rules,",
                "vi": "Tất cả những gì chúng làm là tuân theo một quy luật quần hợp đơn giản"
            }
        },
        {
            "content": "hiệp hội",
            "type": "noun",
            "example": {
                "en": "How can we benefit from “the whole association of brothers”?",
                "vi": "Làm sao chúng ta được lợi ích qua “toàn thể hiệp hội anh em”?"
            }
        },
        {
            "content": "sự kết hợp",
            "type": "noun",
            "example": {
                "en": "Nevertheless, I was absolutely convinced of the value of spiritual association.",
                "vi": "Tuy nhiên, tôi hoàn toàn tin tưởng nơi giá trị của sự kết hợp thiêng liêng."
            }
        },
        {
            "content": "sự liên kết",
            "type": "noun",
            "example": {
                "en": "By symbiosis, I mean a bidirectional and mutually beneficial association",
                "vi": "Nhờ cộng sinh, ý tôi là sự liên kết theo hai hướng và cùng chung lợi ích"
            }
        },
        {
            "content": "sự liên tưởng",
            "type": "",
            "example": {
                "en": "And so I'm going to use, as the metaphor, this association:",
                "vi": "Và tôi sẽ dùng sự liên tưởng này, như là một ẩn dụ"
            }
        },
        {
            "content": "công ty",
            "type": "noun",
            "example": {
                "en": "I'm a second year associate at the firm.",
                "vi": "Tôi là thực tập viên năm thứ hai ở công ty."
            }
        },
        {
            "content": "hội liên hiệp",
            "type": "",
            "example": {}
        },
        {
            "content": "môn bóng đá",
            "type": "",
            "example": {}
        },
        {
            "content": "sự giao thiệp",
            "type": "",
            "example": {
                "en": "But why narrow your association down to one person?",
                "vi": "Nhưng tại sao lại giới hạn sự giao thiệp của bạn với chỉ một người?"
            }
        },
        {
            "content": "sự kết giao",
            "type": "",
            "example": {
                "en": "And what a boost to their spirituality such association with Paul afforded them!",
                "vi": "Và sự kết giao như thế với Phao-lô bổ ích biết bao cho tính thiêng liêng của họ!"
            }
        },
        {
            "content": "sự liên hợp",
            "type": "",
            "example": {}
        },
        {
            "content": "sự liên đới",
            "type": "",
            "example": {}
        },
        {
            "content": "đoàn thể",
            "type": "",
            "example": {
                "en": "What a blessing it is to be loved by ‘the entire association of our brothers in the world’!",
                "vi": "Thật là một ân phước khi được “cả đoàn thể anh em trên thế giới” yêu thương!"
            }
        },
        {
            "content": "sự hợp tác",
            "type": "",
            "example": {
                "en": "And naturally, because of my long association with the family...",
                "vi": "Và tất nhiên, vì sự hợp tác lâu dài của tôi với gia đình..."
            }
        }
    ]
}