{
    "word": "assured",
    "type": [
        "adjective",
        "verb"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/əˈSHo͝ord/",
            "/əˈʃʊrd/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/əˈʃʊəd/"
        ]
    },
    "meanings": [
        {
            "content": "tự tin",
            "type": "adjective",
            "example": {
                "en": "Late in his life, he spoke with assurance that he had personally fought a good fight.",
                "vi": "Gần cuối đời, ông nói một cách tự tin rằng ông đã đánh trận tốt lành."
            }
        },
        {
            "content": "được bảo hiểm",
            "type": "",
            "example": {}
        },
        {
            "content": "chắc chắn",
            "type": "adjective adverb",
            "example": {
                "en": "In this way the lead is assured protection while ascending.",
                "vi": "Theo cách này người dẫn đầu được bảo vệ chắc chắn trong khi leo lên."
            }
        },
        {
            "content": "cầm chắc",
            "type": "",
            "example": {
                "en": "In time one who makes decisions based upon circumstance is virtually assured to commit serious transgressions.",
                "vi": "Cuối cùng, một người có những quyết định dựa trên hoàn cảnh thì hầu như chắc chắn sẽ cầm chắc sự phạm giới nghiêm trọng."
            }
        },
        {
            "content": "quả quyết",
            "type": "",
            "example": {
                "en": "But I'm assured it had absolutely nothing to do with me.",
                "vi": "Nhưng tôi quả quyết là chuyện đó ko liên quan gì đến tôi."
            }
        },
        {
            "content": "tin chắc",
            "type": "",
            "example": {
                "en": "What assurance do we have regarding the difficulties we face?",
                "vi": "Chúng ta có thể tin chắc điều gì ngay cả khi đối mặt với thử thách?"
            }
        },
        {
            "content": "trơ tráo",
            "type": "",
            "example": {}
        },
        {
            "content": "vô liêm sỉ",
            "type": "",
            "example": {}
        },
        {
            "content": "yên trí",
            "type": "",
            "example": {
                "en": "Be assured that these blessings are poured out equally upon rich and poor alike.",
                "vi": "Hãy yên trí rằng các phước lành này được trút xuống một cách đồng đều trên những người giàu cũng như người nghèo."
            }
        },
        {
            "content": "đảm bảo",
            "type": "",
            "example": {
                "en": "The housekeeper assured us you would not be here until tomorrow.",
                "vi": "Bà quản gia đảm bảo với chúng tôi anh sẽ trở về vào ngày mai."
            }
        }
    ]
}