{
    "word": "attend",
    "type": [
        "verb"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/əˈtend/",
            "/əˈtɛnd/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/əˈtɛnd/"
        ]
    },
    "meanings": [
        {
            "content": "dự",
            "type": "verb",
            "example": {
                "en": "Besides that, my wife, whom I love very much, expects me to attend.",
                "vi": "Ngoài ra, vợ tôi là người tôi yêu thương rất nhiều, muốn tôi đến tham dự."
            }
        },
        {
            "content": "chăm sóc",
            "type": "verb noun",
            "example": {
                "en": "I'm just attending to this most significant gentleman.",
                "vi": "Anh chỉ đang chăm sóc quý ông quan trọng này."
            }
        },
        {
            "content": "có mặt",
            "type": "",
            "example": {
                "en": "Probably because I didn't attend last night's board meeting.",
                "vi": "Có lẽ là bởi vì tôi đã không có mặt trong buổi họp ngày hôm qua."
            }
        },
        {
            "content": "tham dự",
            "type": "",
            "example": {
                "en": "She had 7 students attending when she was called, but she now has 20 who attend regularly.",
                "vi": "Khi chị được kêu gọi, lớp học của chị có 7 học viên nhưng bây giờ đã có 20 học viên tham dự thường xuyên."
            }
        },
        {
            "content": "tham gia",
            "type": "verb",
            "example": {
                "en": "Do you plan on attending this afternoon's meeting?",
                "vi": "Cậu có định tham gia cuộc họp chiều nay không?"
            }
        },
        {
            "content": "chú trọng",
            "type": "",
            "example": {}
        },
        {
            "content": "chăm lo",
            "type": "",
            "example": {
                "en": "There is much I need attended to tonight.",
                "vi": "Có rất nhiều thứ ta cần chăm lo tối nay."
            }
        },
        {
            "content": "dự thính",
            "type": "",
            "example": {}
        },
        {
            "content": "góp mặt",
            "type": "verb",
            "example": {
                "en": "Also at this year 's ceremony was Ban moon , the first U.N Secretary-General to attend .",
                "vi": "Cũng tại buổi lễ năm nay có góp mặt lần đầu tiên của tổng thư ký LHQ Ban Ki Moon ."
            }
        },
        {
            "content": "hầu hạ",
            "type": "verb",
            "example": {}
        },
        {
            "content": "hộ tống",
            "type": "",
            "example": {
                "en": "He is attended to as promised.",
                "vi": "Ông ta đã được hộ tống như đã hứa."
            }
        },
        {
            "content": "phục dịch",
            "type": "",
            "example": {
                "en": "I asked an attendant concerning her whereabouts and was directed to a lounge area.",
                "vi": "Tôi hỏi nhân viên phục dịch nơi nào thì tôi có thể tìm thấy bà và được dẫn đến một phòng ngồi chơi."
            }
        },
        {
            "content": "phục vụ",
            "type": "noun",
            "example": {
                "en": "Now, if you need anything, my servants will attend you.",
                "vi": "Nếu cô cần bất cứ gì, phục vụ của tôi sẽ chăm sóc cho cô."
            }
        },
        {
            "content": "theo hầu",
            "type": "",
            "example": {}
        },
        {
            "content": "đi kèm",
            "type": "",
            "example": {
                "en": "They had learned that hope, with its attendant blessings of peace and joy, does not depend upon circumstance.",
                "vi": "Họ đã học được rằng niềm hy vọng đi kèm với phước lành bình an và niềm vui thì không tùy thuộc vào hoàn cảnh."
            }
        },
        {
            "content": "đi theo",
            "type": "",
            "example": {
                "en": "They also had John as an attendant.",
                "vi": "Cũng có Giăng đi theo phụ giúp."
            }
        },
        {
            "content": "chú ý",
            "type": "verb",
            "example": {
                "en": "Therefore, interested ones who speak another language should be invited to attend your meetings.",
                "vi": "Trong trường hợp này, anh chị nên mời người chú ý đến hội thánh của mình."
            }
        },
        {
            "content": "giải quyết",
            "type": "noun verb",
            "example": {
                "en": "I have a few personal matters to attend to.",
                "vi": "Tôi có vài chuyện cá nhân cần giải quyết."
            }
        }
    ]
}