{
    "word": "attendant",
    "type": [
        "adjective",
        "noun"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/əˈtendənt/",
            "/əˈtɛndənt/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/əˈtɛnd(ə)nt/"
        ]
    },
    "meanings": [
        {
            "content": "người phục vụ",
            "type": "noun",
            "example": {
                "en": "He had the attendants fill up six large stone jars with water.",
                "vi": "Ngài bảo những người phục vụ đổ đầy nước vào sáu cái vại."
            }
        },
        {
            "content": "chăm sóc",
            "type": "verb noun",
            "example": {
                "en": "I'm just attending to this most significant gentleman.",
                "vi": "Anh chỉ đang chăm sóc quý ông quan trọng này."
            }
        },
        {
            "content": "có mặt",
            "type": "adjective",
            "example": {
                "en": "Probably because I didn't attend last night's board meeting.",
                "vi": "Có lẽ là bởi vì tôi đã không có mặt trong buổi họp ngày hôm qua."
            }
        },
        {
            "content": "cần vụ",
            "type": "noun",
            "example": {}
        },
        {
            "content": "kèm theo",
            "type": "adjective",
            "example": {
                "en": "The revocation of the Edict of Nantes and attendant persecution provoked negative international reaction.",
                "vi": "Lệnh bãi bỏ Chiếu Chỉ Nantes và sự bắt bớ kèm theo gây ra phản ứng bất lợi trên quốc tế."
            }
        },
        {
            "content": "người theo hầu",
            "type": "",
            "example": {}
        },
        {
            "content": "phục dịch",
            "type": "",
            "example": {
                "en": "I asked an attendant concerning her whereabouts and was directed to a lounge area.",
                "vi": "Tôi hỏi nhân viên phục dịch nơi nào thì tôi có thể tìm thấy bà và được dẫn đến một phòng ngồi chơi."
            }
        },
        {
            "content": "phục vụ",
            "type": "noun",
            "example": {
                "en": "Now, if you need anything, my servants will attend you.",
                "vi": "Nếu cô cần bất cứ gì, phục vụ của tôi sẽ chăm sóc cho cô."
            }
        },
        {
            "content": "tham dự",
            "type": "",
            "example": {
                "en": "Do other activities interfere with your meeting attendance?",
                "vi": "Các hoạt động khác có cản trở bạn tham dự nhóm họp không?"
            }
        },
        {
            "content": "theo hầu",
            "type": "",
            "example": {}
        },
        {
            "content": "đi theo",
            "type": "adjective",
            "example": {
                "en": "Mother wanted to attend, so Fern and I and two of my brothers accompanied her.",
                "vi": "Vì mẹ muốn đi dự, cho nên tôi và Fern cùng hai người anh đi theo mẹ."
            }
        }
    ]
}