{
    "word": "attraction",
    "type": "noun",
    "spelling": "/əˈtɹæk.ʃən/, əˈtrækʃən",
    "meanings": [
        {
            "content": "sự hấp dẫn",
            "type": "",
            "example": {
                "en": "The depth of understanding of the attractiveness of what we can do is not there yet.",
                "vi": "Hiểu biết sâu về sự hấp dẫn của việc chúng ta có thể làm vẫn chưa hiện hữu."
            }
        },
        {
            "content": "cái thu hút",
            "type": "",
            "example": {
                "en": "But what attracted me the most was her smile.",
                "vi": "Nhưng cái thu hút tôi nhiều nhất... đó là nụ cười."
            }
        },
        {
            "content": "hấp lực",
            "type": "noun",
            "example": {
                "en": "Electromagnetism—the key attracting force between protons and electrons, allowing molecules to form.",
                "vi": "Điện từ trường—hấp lực chủ chốt giữa proton và điện tử, nhờ đó mà những phân tử hình thành."
            }
        },
        {
            "content": "[sự",
            "type": "",
            "example": {
                "en": "Waving your big fluorescent oar around, attracting a bunch of attention.",
                "vi": "Vung vẩy cái mái chèo phát quang của em, thu hút cả đống sự chú ý."
            }
        },
        {
            "content": "cái hấp dẫn",
            "type": "",
            "example": {}
        },
        {
            "content": "cái lôi cuốn",
            "type": "",
            "example": {}
        },
        {
            "content": "lực] hấp dẫn",
            "type": "",
            "example": {
                "en": "And the attraction, the forces, between the molecule and the protein",
                "vi": "Và lực hấp dẫn giữa phân tử và protein"
            }
        },
        {
            "content": "sức hút",
            "type": "",
            "example": {
                "en": "Me, I Iike to have to work to find someone attractive.",
                "vi": "Tớ á. Tớ thích 1 cái gì đó để tạo ra sức hút."
            }
        },
        {
            "content": "sức hấp dẫn",
            "type": "",
            "example": {
                "en": "She was blessed with intelligence, attractiveness, and a bright personality.",
                "vi": "Chị ấy được phước với trí thông minh, sức hấp dẫn và tính tình hoạt bát."
            }
        },
        {
            "content": "sức lôi cuốn",
            "type": "",
            "example": {
                "en": "Some are challenged by same-gender attraction.",
                "vi": "Một số người đang bị thử thách bởi sức lôi cuốn của tình trạng đồng tính luyến ái."
            }
        },
        {
            "content": "sự hú",
            "type": "",
            "example": {}
        },
        {
            "content": "sự lôi cuốn",
            "type": "",
            "example": {
                "en": "( Woman ) physical attraction is an essential part of desire.",
                "vi": "Sự lôi cuốn về thể xác là một phần thiết yếu của dục vọng."
            }
        },
        {
            "content": "sự thu hút",
            "type": "noun",
            "example": {
                "en": "But you cannot deny that there is an attraction.",
                "vi": "Nhưng em cũng không thể phủ nhận sự thu hút giữa hai ta."
            }
        }
    ],
    "hasAudio": 1
}