{
    "word": "authority",
    "type": "noun",
    "spelling": "əˈθɒrətiː, /ɔːˈθɒɹəti/, /əˈθɑɹəti/",
    "meanings": [
        {
            "content": "chuyên gia",
            "type": "noun",
            "example": {
                "en": "Even modern-day authorities often get things drastically wrong.",
                "vi": "Ngay cả những chuyên gia thời nay cũng thường phạm sai lầm nghiêm trọng."
            }
        },
        {
            "content": "uy quyền",
            "type": "noun",
            "example": {
                "en": "This is the kind of magic that undermines our authority, challenges all we've done.",
                "vi": "Loại pháp thuật phá hoại ngầm uy quyền của ta, những thử thách ta đã vượt qua."
            }
        },
        {
            "content": "người có thẩm quyền",
            "type": "",
            "example": {
                "en": "We were ordained by one with authority and authorization to do so.",
                "vi": "Chúng ta được sắc phong bởi một người có thẩm quyền và được phép để làm như vậy."
            }
        },
        {
            "content": "quyền lực",
            "type": "noun",
            "example": {
                "en": "I have the authority to have you reinstated.",
                "vi": "Tôi có đủ quyền lực để cậu có thể quay lại trường."
            }
        },
        {
            "content": "có uy tín",
            "type": "",
            "example": {
                "en": "Further, Perowne asserted that there were very good authorities who favored the restoration of the divine name.",
                "vi": "Hơn nữa, Perowne quả quyết rằng có những chuyên gia rất có uy tín ủng hộ việc phục hồi danh của Đức Chúa Trời."
            }
        },
        {
            "content": "quyền",
            "type": "noun",
            "example": {
                "en": "The men under your authority have been most successful.",
                "vi": "Những người dưới quyền của ông đã rất thành công trong chuyện này."
            }
        },
        {
            "content": "căn cứ",
            "type": "",
            "example": {
                "en": "I've got to turn Kelli over to base authorities.",
                "vi": "Cháu phải đưa Kelli về căn cứ."
            }
        },
        {
            "content": "người có uy tín",
            "type": "",
            "example": {}
        },
        {
            "content": "người lão luyện",
            "type": "",
            "example": {}
        },
        {
            "content": "nhà chức trách",
            "type": "",
            "example": {
                "en": "But, in Brazil, it's really hard to arrest an authority.",
                "vi": "Nhưng ở Brazil, thật khó để đối đầu với nhà chức trách."
            }
        },
        {
            "content": "nhà cầm quyền",
            "type": "",
            "example": {
                "en": "And you start to learn to respect authority.",
                "vi": "Và chúng ta bắt đầu học cách tuân phục nhà cầm quyền."
            }
        },
        {
            "content": "nhà đương cục",
            "type": "",
            "example": {}
        },
        {
            "content": "quyền hành",
            "type": "noun",
            "example": {
                "en": "I don't have the authority to give them to you.",
                "vi": "Tôi không có quyền hành gì để trao trả hai người đó."
            }
        },
        {
            "content": "quyền hạn",
            "type": "noun",
            "example": {
                "en": "The Magisterium has no authority within these walls.",
                "vi": "Bộ không có quyền hạn gì bên trong những bức tường này hết."
            }
        },
        {
            "content": "quyền thế",
            "type": "noun",
            "example": {
                "en": "Does he seek political authority or influence in the world?",
                "vi": "Người đó có mưu cầu quyền thế hay thế lực chính trị trong thế gian hay không?"
            }
        },
        {
            "content": "quyền uy",
            "type": "noun",
            "example": {
                "en": "Who would have the nerve to question my authority?",
                "vi": "Ai đủ táo tợn để chống lại quyền uy của ta?"
            }
        },
        {
            "content": "thẩm quyền",
            "type": "",
            "example": {
                "en": "The authority and the majesty of it are beyond our comprehension.",
                "vi": "Thẩm quyền và vẻ uy nghi của thẩm quyền thì vượt quá sự hiểu biết của chúng ta."
            }
        },
        {
            "content": "uy danh",
            "type": "noun",
            "example": {}
        },
        {
            "content": "uỷ quyền",
            "type": "",
            "example": {
                "en": "Someone who has full access and authorization.",
                "vi": "Ai đó có đầy đủ các quyền truy cập và được uỷ quyền."
            }
        },
        {
            "content": "uy tín",
            "type": "",
            "example": {
                "en": "Madame Mayor, I have it on good authority that he's been set up.",
                "vi": "Bà Thị trưởng, tôi có nguồn uy tín nói rằng anh ta bị đặt bẫy."
            }
        }
    ],
    "hasAudio": 0
}