{
    "word": "band",
    "type": "verb, noun",
    "spelling": "bænd",
    "meanings": [
        {
            "content": "ban nhạc",
            "type": "noun",
            "example": {
                "en": "Listen, I just wanted to see if you guys were going to stay for the band.",
                "vi": "Nghe này, tôi chỉ muốn biết liệu các cô sẽ ở lại xem ban nhạc chứ."
            }
        },
        {
            "content": "băng",
            "type": "noun",
            "example": {
                "en": "The guards wear security bands to control their ins and outs.",
                "vi": "Lính canh đeo băng an ninh để kiểm soát ra vào."
            }
        },
        {
            "content": "dải",
            "type": "noun",
            "example": {
                "en": "So if I squeeze the base, the bands go from base to tip.",
                "vi": "Vì vậy nếu tôi ép chặt gốc, dải ánh sáng phát ra từ gốc đến đỉnh."
            }
        },
        {
            "content": "đai",
            "type": "noun",
            "example": {
                "en": "His position as world ruler would be like the banded tree stump.",
                "vi": "Địa vị của ông là nhà cai trị thế giới giống như gốc cây bị đai lại."
            }
        },
        {
            "content": "bọn",
            "type": "noun",
            "example": {
                "en": "You and your band of rogues have run rampant throughout history.",
                "vi": "Ngươi và đồng bọn đã đi phá phách xuyên suốt lịch sử."
            }
        },
        {
            "content": "lũ",
            "type": "noun",
            "example": {
                "en": "And you let a band of fanatics imprison your brother by law.",
                "vi": "Và chàng để một lũ cuồng tín bắt giam anh vợ của chàng à."
            }
        },
        {
            "content": "bầy",
            "type": "noun",
            "example": {
                "en": "While dwelling in the wilderness of Paran, he and his men protected the flocks of Nabal from marauding bands.",
                "vi": "Khi sống ở đồng vắng Pha-ran, ông và các thuộc hạ đã che chở bầy súc vật của Na-banh khỏi tay bọn cướp bóc."
            }
        },
        {
            "content": "dải băng",
            "type": "",
            "example": {
                "en": "I went to one where I wore a band uniform that was specially made.",
                "vi": "Tớ học ở nơi tớ mang dải băng đồng phục được làm 1 cách đặc biệt."
            }
        },
        {
            "content": "toán",
            "type": "",
            "example": {
                "en": "The group separated into several bands, each taking a different route.",
                "vi": "Nhóm người này chia làm nhiều toán nhỏ, mỗi toán đi một đường."
            }
        },
        {
            "content": "nẹp",
            "type": "",
            "example": {
                "en": "I think you're going to break one of those bands.",
                "vi": "Ta nghĩ cháu sẽ làm gãy một trong những chiếc nẹp đó mất"
            }
        },
        {
            "content": "dàn nhạc",
            "type": "noun",
            "example": {
                "en": "I read \"Peter and the Wolf\" with this beautiful band from Juilliard.",
                "vi": "Tôi đã đọc \"Peter and the Wolf\" với dàn nhạc tuyệt vời từ Julliard"
            }
        },
        {
            "content": "đảng",
            "type": "noun",
            "example": {
                "en": "Contention and wars increased; the secret band of robbers carried on the work of destruction.",
                "vi": "Sự tranh chấp và chiến tranh gia tăng; đảng cướp bí mật thực hiện công việc hủy diệt."
            }
        },
        {
            "content": "ban",
            "type": "noun",
            "example": {
                "en": "Listen, I just wanted to see if you guys were going to stay for the band.",
                "vi": "Nghe này, tôi chỉ muốn biết liệu các cô sẽ ở lại xem ban nhạc chứ."
            }
        },
        {
            "content": "bè",
            "type": "noun",
            "example": {
                "en": "You did things and had friends and sang in rock bands and made life happen.",
                "vi": "Em làm mọi thứ và có bạn bè và hát trong một ban nhạc rock và làm cho cuộc sống hay hơn."
            }
        },
        {
            "content": "bè lũ",
            "type": "noun",
            "example": {}
        },
        {
            "content": "băng nhóm",
            "type": "noun",
            "example": {
                "en": "Notorious Communist guerrilla leader Sam Boga and his band have crashed through into Botswana.",
                "vi": "Rõ ràng là thủ lĩnh đội du kích Sam Boga và băng nhóm của hắn đã bị tan rã ở Botswana."
            }
        },
        {
            "content": "nhóm",
            "type": "noun",
            "example": {
                "en": "In about a year, I could play most of the band’s instruments.",
                "vi": "Trong vòng một năm, tôi có thể chơi được hầu hết các loại nhạc cụ của nhóm."
            }
        },
        {
            "content": "đoàn",
            "type": "noun",
            "example": {
                "en": "Dude, what is up with the marching band?",
                "vi": "này, đoàn diễu hành đó bị sao vậy?"
            }
        },
        {
            "content": "vạch",
            "type": "verb noun",
            "example": {}
        },
        {
            "content": "sắp",
            "type": "noun",
            "example": {}
        },
        {
            "content": "dãy",
            "type": "",
            "example": {
                "en": "I traveled east until I came to that band of water that divides the world of men from Jotunheim.",
                "vi": "Tôi đi về phía đông cho tới khi tôi đến được dãy nước đó nó chia cắt thế giới con người và Jotunheim"
            }
        },
        {
            "content": "môn",
            "type": "noun",
            "example": {
                "en": "Like how Eddie doesn't want to learn piccolo but I'm making him because 2,000 marching-band scholarships go unclaimed every year at colleges!",
                "vi": "Như khi Eddie không thích học thổi sáo nhưng tớ bắt nó học vì học môn đó dễ xin học bổng để vào cao đẳng!"
            }
        },
        {
            "content": "cúi",
            "type": "verb",
            "example": {}
        },
        {
            "content": "kẻ",
            "type": "noun",
            "example": {
                "en": "Pretentious name for a band of outlaws.",
                "vi": "Một cái tên khoe mẽ cho những kẻ ngoài vòng pháp luật."
            }
        },
        {
            "content": "nậu",
            "type": "",
            "example": {}
        },
        {
            "content": "gạch",
            "type": "noun verb",
            "example": {}
        },
        {
            "content": "buộc băng",
            "type": "",
            "example": {}
        },
        {
            "content": "buộc dải",
            "type": "",
            "example": {}
        },
        {
            "content": "bộ sậu",
            "type": "noun",
            "example": {}
        },
        {
            "content": "dây curoa",
            "type": "",
            "example": {}
        },
        {
            "content": "dải băng bó",
            "type": "",
            "example": {}
        },
        {
            "content": "dải đóng gáy sách",
            "type": "",
            "example": {}
        },
        {
            "content": "làm nẹp",
            "type": "",
            "example": {}
        },
        {
            "content": "tụ họp thành bầy",
            "type": "",
            "example": {}
        },
        {
            "content": "tụ họp thành toán",
            "type": "",
            "example": {}
        },
        {
            "content": "tụ họp thành đoàn",
            "type": "",
            "example": {}
        },
        {
            "content": "đóng đai",
            "type": "",
            "example": {}
        },
        {
            "content": "tốp",
            "type": "noun",
            "example": {
                "en": "Bands of wild horses, mustang, are converging on one of the last remaining water holes for miles.",
                "vi": "Một tốp ngựa hoang, ngựa thảo nguyên ( mustang ), hội tụ về những hố nước cuối cùng cách xa nhiều dặm."
            }
        }
    ],
    "hasAudio": 1
}