{
    "word": "basis",
    "type": "noun",
    "spelling": "/ˈbeɪsɪs/, ˈbɛɪsɪs",
    "meanings": [
        {
            "content": "nền tảng",
            "type": "noun",
            "example": {
                "en": "Luther also laid the basis for a standardized written German language.",
                "vi": "Luther cũng đặt nền tảng chuẩn hóa chữ viết của tiếng Đức."
            }
        },
        {
            "content": "cơ sở",
            "type": "noun",
            "example": {
                "en": "Synesthesia runs in families, so Galton said this is a hereditary basis, a genetic basis.",
                "vi": "Giác quan trộn lẫn di truyền gia đình, nên Galton gọi đó là cơ sở di truyền."
            }
        },
        {
            "content": "căn cứ",
            "type": "noun",
            "example": {
                "en": "Everything in me rebelled against this separation on the basis of race.",
                "vi": "Con người tôi hoàn toàn chống lại sự phân rẽ này căn cứ trên chủng tộc."
            }
        },
        {
            "content": "cơ bản",
            "type": "noun",
            "example": {
                "en": "The basis of human trust is established through play signals.",
                "vi": "Sự thật cơ bản của con người được hình thành qua các dấu hiệu trò chơi."
            }
        },
        {
            "content": "nền móng",
            "type": "noun",
            "example": {
                "en": "It forms the basis for a balanced, productive life, with all aspects of conduct being affected for good.",
                "vi": "Luật pháp Ngài tạo nền móng cho một đời sống thăng bằng và hữu dụng, ảnh hưởng tốt đến mọi khía cạnh của hạnh kiểm."
            }
        },
        {
            "content": "căn bản",
            "type": "noun",
            "example": {
                "en": "Right away, he would use these words as a basis for preaching to us.",
                "vi": "Ngay tức thì, anh dùng những lời này làm căn bản để giảng cho chúng tôi."
            }
        },
        {
            "content": "luận cứ",
            "type": "noun",
            "example": {}
        },
        {
            "content": "Cơ sở",
            "type": "",
            "example": {
                "en": "Because there was no basis in fact for any of it.",
                "vi": "Vì thực tế không có cơ sở nào chứng minh."
            }
        }
    ],
    "hasAudio": 1
}