{
    "word": "become",
    "type": "verb",
    "spelling": "biˈkʌm, /bəˈkʌm/, /bɪˈkʌm/",
    "meanings": [
        {
            "content": "trở nên",
            "type": "verb",
            "example": {
                "en": "We become united with Him, and we can become like Him.",
                "vi": "Chúng ta trở nên hiệp nhất với Ngài, và chúng ta có thể trở nên giống như Ngài."
            }
        },
        {
            "content": "trở thành",
            "type": "verb",
            "example": {
                "en": "He practices the piano every day, so he can become a pianist.",
                "vi": "Cậu ta tập chơi đàn hàng ngày để trở thành một nghệ sỹ dương cầm."
            }
        },
        {
            "content": "thích hợp",
            "type": "",
            "example": {
                "en": "At what point does a relationship with a workmate become inappropriate?",
                "vi": "Vậy thì, vào lúc nào mối quan hệ với người đồng nghiệp trở nên không thích hợp?"
            }
        },
        {
            "content": "đâm",
            "type": "verb",
            "example": {
                "en": "One bite and your heart will become impenetrable.",
                "vi": "Một miếng thôi thì không gì có thể đâm xuyên qua tim em được."
            }
        },
        {
            "content": "hợp",
            "type": "adjective verb",
            "example": {
                "en": "Then, under these circumstances, they become easy prey to sin.",
                "vi": "Sau đó, trong những trường hợp này, họ dễ dàng trở thành con mồi cho tội lỗi."
            }
        },
        {
            "content": "hóa",
            "type": "verb",
            "example": {
                "en": "With age, digestion becomes more of a problem.",
                "vi": "Theo tuổi tác, sự tiêu hóa ngày càng phiền phức."
            }
        },
        {
            "content": "xứng",
            "type": "",
            "example": {
                "en": "God’s Word clearly counsels: “Do not become unevenly yoked with unbelievers.",
                "vi": "Lời Đức Chúa Trời khuyên rõ ràng: “Chớ mang ách chung với người không tin đạo, vì không cân xứng."
            }
        },
        {
            "content": "vừa",
            "type": "adjective conjunction verb adverb",
            "example": {
                "en": "Let your word, please, become like theirs,+ and speak favorably.”",
                "vi": "Xin ông cũng nói những lời như họ,+ hãy nói sao cho vừa ý vua”."
            }
        },
        {
            "content": "làm nên",
            "type": "",
            "example": {
                "en": "Spent my whole life working to be something greater by becoming something smaller.",
                "vi": "Dành cả đời mình để làm nên một thứ gì đó to lớn hơn bằng việc trở thành một thứ nhỏ bé hơn."
            }
        },
        {
            "content": "sinh ra",
            "type": "verb",
            "example": {
                "en": "Woe to the one saying to a father: ‘What do you become father to?’",
                "vi": "Khốn thay cho kẻ nói cùng cha mình rằng: Cha sinh ra gì?"
            }
        },
        {
            "content": "xảy đến",
            "type": "",
            "example": {
                "en": "But you will bring about the day that you proclaimed,+ when they will become like me.",
                "vi": "Nhưng ngài sẽ khiến ngày ngài công bố xảy đến,+ lúc ấy họ cũng như con."
            }
        }
    ],
    "hasAudio": 1
}