{
    "word": "been",
    "type": "verb, noun",
    "spelling": "/bin/, /bɪn/, /ˈbɪn/, /ˈbiːn/",
    "meanings": [
        {
            "content": "be to phải",
            "type": "",
            "example": {}
        },
        {
            "content": "bị",
            "type": "verb",
            "example": {
                "en": "I've been tormented by regret.",
                "vi": "Tôi đã bị dằn vặt bởi sự hối hận."
            }
        },
        {
            "content": "có",
            "type": "verb",
            "example": {
                "en": "I've been seeing someone.",
                "vi": "Tôi có người yêu rồi."
            }
        },
        {
            "content": "diễn ra",
            "type": "",
            "example": {
                "en": "This movement from rural to urban areas has been going on for over two hundred years.",
                "vi": "Sự dịch chuyện từ nông thôn lên thành thị đã diễn ra suốt hơn hai trăm năm."
            }
        },
        {
            "content": "giá",
            "type": "noun",
            "example": {
                "en": "Not for 34 years has there been a child born out of wedlock here.",
                "vi": "Vì 34 năm qua, thị trấn này chưa đẻ đứa trẻ nào ngoài giá thú cả."
            }
        },
        {
            "content": "là",
            "type": "verb noun",
            "example": {
                "en": "The last few days have been very busy for both of us.",
                "vi": "Mấy ngày vừa qua là những ngày rất bận rộn cho cả hai chúng tôi."
            }
        },
        {
            "content": "sẽ",
            "type": "",
            "example": {
                "en": "It all would've been for nothing if not for you.",
                "vi": "Nhưng nó sẽ chẳng ý nghĩa gì nếu ông ko biết chế thuốc giải."
            }
        },
        {
            "content": "sống",
            "type": "verb noun",
            "example": {
                "en": "We've been together longer than we've been apart.",
                "vi": "Bố mẹ đã sống chung còn lâu hơn thời độc thân rồi đấy."
            }
        },
        {
            "content": "thì",
            "type": "conjunction noun adverb",
            "example": {
                "en": "It's been my experience that the bees don't land on them either.",
                "vi": "Theo kinh nghiệm của tôi thì ong không đậu lên bông hoa đó đâu."
            }
        },
        {
            "content": "trở nên",
            "type": "verb",
            "example": {
                "en": "He's been really sweet since his mother died.",
                "vi": "Anh ấy trở nên ngọt ngào hơn từ khi mẹ anh ấy qua đời."
            }
        },
        {
            "content": "trở thành",
            "type": "verb",
            "example": {
                "en": "Maybe I should've been a clown instead of a comedian.",
                "vi": "Có lẽ tôi nên trở thành một anh hề thay vì một hài kịch gia."
            }
        },
        {
            "content": "tồn tại",
            "type": "",
            "example": {
                "en": "Democracy is the worst form of government, except all the others that have been tried.",
                "vi": "Trong tất cả các loại hình chính phủ, dân chủ là tệ nhất, trừ mọi chính phủ mà đã tồn tại từ xưa đến giờ."
            }
        },
        {
            "content": "xảy ra",
            "type": "verb",
            "example": {
                "en": "They'd been as faithful to me, none of this would have happened.",
                "vi": "Họ chung thành với tôi, những điều này có thể đã không xảy ra."
            }
        },
        {
            "content": "đang",
            "type": "",
            "example": {
                "en": "What do you think I've been doing?",
                "vi": "Bạn nghĩ tôi đang làm gì?"
            }
        },
        {
            "content": "được",
            "type": "verb",
            "example": {
                "en": "With this system a protection circuit has been built in.",
                "vi": "Với hệ thống này, mạch bảo vệ đã được thiết kế tích hợp bên trong."
            }
        },
        {
            "content": "định",
            "type": "verb",
            "example": {
                "en": "You understand the decree that's been handed down to you?",
                "vi": "Anh hiểu rõ những gì nghị định đó muốn nói với anh chứ?"
            }
        },
        {
            "content": "ở",
            "type": "verb adposition",
            "example": {
                "en": "He's been abroad for six years now.",
                "vi": "Anh ấy ở nước ngoài đã sáu năm nay."
            }
        }
    ],
    "hasAudio": 1
}