{
    "word": "behavior",
    "type": "noun",
    "spelling": "",
    "meanings": [
        {
            "content": "hành vi",
            "type": "noun",
            "example": {
                "en": "Preoccupation with unworthy behavior can lead to unworthy behavior.",
                "vi": "Sự bận tâm với hành vi không xứng đáng có thể dẫn đến hành vi không xứng đáng."
            }
        },
        {
            "content": "chế độ",
            "type": "noun",
            "example": {
                "en": "I think she just said yes'cause she wants to reinforce that behavior.",
                "vi": "Ta nghĩ cô ta chỉ nói có vì muốn củng cố thêm cái chế độ này."
            }
        },
        {
            "content": "cách cư xử",
            "type": "noun",
            "example": {
                "en": "And then, a little behavior problem comes up.",
                "vi": "Sau đó, vài vấn đề về cách cư xử xuất hiện."
            }
        },
        {
            "content": "cách sử xự",
            "type": "noun",
            "example": {
                "en": "But it said he had some behavioral problems.",
                "vi": "Nhưng hắn có vấn đề về cách sử xự."
            }
        },
        {
            "content": "cách xử lý",
            "type": "",
            "example": {
                "en": "to get actually binary behavior out of these radio vacuum tubes.",
                "vi": "để lấy cách xử lý nhị phân ra khỏi các ống chân không radio đó."
            }
        },
        {
            "content": "cách ăn ở",
            "type": "noun",
            "example": {
                "en": "ALTHOUGH we may be born with certain wrong inclinations, violent behavior is usually learned.",
                "vi": "Dù chúng ta được sinh ra với một số khuynh hướng sai trái, nhưng cách ăn ở hung bạo không phải tự nhiên mà có."
            }
        },
        {
            "content": "lối",
            "type": "noun",
            "example": {
                "en": "What are some warning signs of immodest thinking or behavior?",
                "vi": "Có một số dấu hiệu cảnh báo nào về lối suy nghĩ hoặc hành động thiếu khiêm tốn?"
            }
        },
        {
            "content": "trạng thái",
            "type": "",
            "example": {
                "en": "The wolves changed the behavior of the rivers.",
                "vi": "Những con sói đã thay đổi trạng thái của những con sông."
            }
        },
        {
            "content": "tập tính",
            "type": "",
            "example": {
                "en": "all of their collective social behaviors are mindblowing.",
                "vi": "tất cả những tập tính xã hội này thật đáng kinh ngạc."
            }
        }
    ],
    "hasAudio": 0
}