{
    "word": "below",
    "type": [
        "adverb",
        "adposition"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/bəˈlō/",
            "/bəˈloʊ/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/bɪˈləʊ/"
        ]
    },
    "meanings": [
        {
            "content": "dưới",
            "type": "adposition",
            "example": {
                "en": "I'm standing directly below one of Sydney's busiest train stations.",
                "vi": "Tôi đang đứng trực tiếp ngay dưới một trong những trạm xe lửa đông nhất Sydney."
            }
        },
        {
            "content": "ở dưới",
            "type": "adposition",
            "example": {
                "en": "The airport runway is below, waiting to receive him.",
                "vi": "Phi đạo của sân bay ở dưới đang chờ đợi để đón nhận ông."
            }
        },
        {
            "content": "sau",
            "type": "conjunction",
            "example": {
                "en": "Roman amphoras have a much shorter neck, and the body widens out at once below the handles.",
                "vi": "Bình La Mã có cổ ngắn hơn nhiều và thân bình phình ra ngay phía sau tay cầm."
            }
        },
        {
            "content": "par",
            "type": "",
            "example": {}
        },
        {
            "content": "phía dưới",
            "type": "adposition",
            "example": {
                "en": "Right below us is the old Vandeveer reservoir.",
                "vi": "Ngay phía dưới chúng ta là hồ chứa nước Vandeveer."
            }
        },
        {
            "content": "bên dưới",
            "type": "adposition",
            "example": {
                "en": "You can see the solar canopy overhead, the light streaming in, and this entirely live green space below.",
                "vi": "Bạn sẽ thấy phần tán ở trên, ánh sáng đi xiên qua, và cảnh quan xanh bên dưới."
            }
        },
        {
            "content": "dưới đây",
            "type": "",
            "example": {
                "en": "Draw a picture of your family in the box below.",
                "vi": "Vẽ hình gia đình mình trong ô dưới đây."
            }
        },
        {
            "content": "không xứng đáng",
            "type": "",
            "example": {}
        },
        {
            "content": "sau đây",
            "type": "",
            "example": {
                "en": "Next to each of the statements below, rate your desires in the following areas.",
                "vi": "Bên cạnh mỗi lời phát biểu dưới đây, hãy đánh giá những ước muốn của các em trong các lĩnh vực sau đây."
            }
        },
        {
            "content": "thấp hơn",
            "type": "",
            "example": {
                "en": "Half the city is already below sea level.",
                "vi": "Một nửa thành phố đã thấp hơn mặt nước biển rồi."
            }
        },
        {
            "content": "ở bên dưới",
            "type": "",
            "example": {
                "en": "But from down below, they are the embodiment",
                "vi": "Nhưng ở bên dưới, nó là hiện thân"
            }
        },
        {
            "content": "ở dưới thấp",
            "type": "",
            "example": {}
        },
        {
            "content": "ở phía dưới",
            "type": "",
            "example": {
                "en": "Rocks and boulders were strewn along the riverbed far below the road.",
                "vi": "Đá tảng và đá cuội nằm rải rác dọc theo lòng sông nằm ở phía dưới con đường."
            }
        },
        {
            "content": "hạ",
            "type": "verb noun",
            "example": {
                "en": "He explains: “You are from the realms below; I am from the realms above.",
                "vi": "Ngài giải thích: “Các ông từ hạ giới, tôi từ thượng giới."
            }
        }
    ]
}