{
    "word": "beloved",
    "type": [
        "adjective",
        "noun",
        "verb"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/bəˈləv(ə)d/",
            "/biˈləvd/",
            "/bɪˈləvd/",
            "/bəˈləvəd/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/bɪˈlʌvɪd/",
            "/bɪˈlʌvd/"
        ]
    },
    "meanings": [
        {
            "content": "yêu dấu",
            "type": "adjective",
            "example": {
                "en": "I add my testimony to that of our beloved prophet.",
                "vi": "Tôi thêm chứng ngôn của mình vào chứng ngôn của vị tiên tri yêu dấu của chúng ta."
            }
        },
        {
            "content": "yêu quý",
            "type": "adjective",
            "example": {
                "en": "My beloved wife, Jeanene, loved doing family history research.",
                "vi": "Người vợ yêu quý của tôi là Jeanene thích làm công việc sưu tầm lịch sử gia đình."
            }
        },
        {
            "content": "được yêu mến",
            "type": "adjective",
            "example": {
                "en": "And I'd like to keep building monuments that are beloved by people.",
                "vi": "Và tôi muốn giữ lại những hình tượng của toà nhà được yêu mến bởi mọi người."
            }
        },
        {
            "content": "kính yêu",
            "type": "adjective",
            "example": {
                "en": "Surely, having so recently lost your own beloved father, you can sympathize.",
                "vi": "Chắc chắn ràng việc ngươi vừa mất đi người phụ hoàng kính yêu ngươi có thể đồng cảm với cô ấy."
            }
        },
        {
            "content": "người yêu dấu",
            "type": "",
            "example": {
                "en": "Much the most gentle appellation you could give me, beloved.",
                "vi": "Đó là tên gọi nhẹ nhàng nhất... mà cô có thể trao cho ta, người yêu dấu à."
            }
        },
        {
            "content": "người yêu quý",
            "type": "",
            "example": {}
        },
        {
            "content": "thương yêu",
            "type": "",
            "example": {
                "en": "And this is for the pee of my darling, beloved fifth husband.",
                "vi": "Và cái này để cho người chồng thân thương, yêu quý thứ năm của em đi tiểu."
            }
        },
        {
            "content": "được yêu quý",
            "type": "adjective",
            "example": {
                "en": "These are among the world's most admired, most beloved, most innovative companies.",
                "vi": "Đây là những công ty được ngưỡng mộ nhất thế giới được yêu quý nhất, sáng tạo nhất."
            }
        }
    ]
}