{
    "word": "benefit",
    "type": "verb, noun",
    "spelling": "/ˈbɛn.ə.fɪt/",
    "meanings": [
        {
            "content": "lợi dụng",
            "type": "verb",
            "example": {
                "en": "So, for the time being, I'm gonna make this slavery malarkey work to my benefit.",
                "vi": "Thế nên hiện tại, tôi sẽ lợi dụng cái vụ nô lệ bịp bợp này vậy."
            }
        },
        {
            "content": "lợi ích",
            "type": "noun",
            "example": {
                "en": "Just like there's benefits for humans and animals, there's benefits for play at work.",
                "vi": "Giống như lợi ích cho người và động vật, thì vui đùa cũng có lợi cho công việc"
            }
        },
        {
            "content": "lợi",
            "type": "noun",
            "example": {
                "en": "Who in my class would benefit from an opportunity to teach?",
                "vi": "Người nào trong lớp học của tôi sẽ được hưởng lợi từ một cơ hội giảng dạy?"
            }
        },
        {
            "content": "làm lợi cho",
            "type": "",
            "example": {
                "en": "It could benefit refugees, but it could also contribute",
                "vi": "Nó làm lợi cho người tị nạn, nhưng nó cũng có thể đóng góp"
            }
        },
        {
            "content": "được lợi",
            "type": "",
            "example": {
                "en": "If the government grinds to a halt, that benefits no one.",
                "vi": "Chính phủ mà bị đóng cửa thì chả ai được lợi lộc gì cả."
            }
        },
        {
            "content": "biểu diễn thiện nguyện",
            "type": "",
            "example": {
                "en": "Rosie O'Donnell hosted a Broadway-themed benefit for the Actors Fund from her basement.",
                "vi": "Rosie O'Donnell đã tổ chức một buổi biểu diễn thiện nguyện theo phong cách Broadway gây quỹ cho Actors Fund từ tầng hầm nhà mình."
            }
        },
        {
            "content": "buổi biểu diễn",
            "type": "",
            "example": {}
        },
        {
            "content": "có lợi",
            "type": "",
            "example": {
                "en": "I'm working on something that will be generous, efficient and benefit both sides.",
                "vi": "Anh đang triển khai một việc vừa hào phóng, hiệu quả và có lợi cho đôi bên."
            }
        },
        {
            "content": "giá trị",
            "type": "noun",
            "example": {
                "en": "Since the benefits of wisdom are many, we should prize it highly.",
                "vi": "Chúng ta quý chuộng sự khôn ngoan vì có nhiều giá trị lợi ích."
            }
        },
        {
            "content": "giúp ích cho",
            "type": "",
            "example": {
                "en": "It can be of benefit both to individuals and to the community.",
                "vi": "Uy quyền có thể giúp ích cho cá nhân lẫn cộng đồng."
            }
        },
        {
            "content": "phúc lợi",
            "type": "noun",
            "example": {
                "en": "When you left, your benefits were not calculated correctly.",
                "vi": "Khi ông nghỉ, những phúc lợi của ông đã không được tính đúng."
            }
        },
        {
            "content": "tiền trợ cấp",
            "type": "noun",
            "example": {
                "en": "Six years after a Marine came to the door and said they were going to start paying death benefits.",
                "vi": "6 năm sau khi đại diện quân nhân đến gõ cửa và nói, họ sẽ bắt đầu trả tiền trợ cấp ma chay."
            }
        },
        {
            "content": "tiền tuất",
            "type": "",
            "example": {}
        },
        {
            "content": "trận đấu",
            "type": "noun",
            "example": {}
        },
        {
            "content": "ích",
            "type": "noun",
            "example": {
                "en": "This process has a lot of fringe benefits for the economy as a whole .",
                "vi": "Quá trình này đem lại nhiều lợi ích phụ trội cho nền kinh tế nói chung ."
            }
        },
        {
            "content": "Lợi ích",
            "type": "",
            "example": {}
        },
        {
            "content": "quyeàn lôïi, trôï caáp",
            "type": "",
            "example": {}
        }
    ],
    "hasAudio": 1
}