{
    "word": "birth",
    "type": "adjective, verb, noun",
    "spelling": "ˈbɜː(ɹ)θ, /bɜː(ɹ)θ/",
    "meanings": [
        {
            "content": "dòng dõi",
            "type": "noun",
            "example": {
                "en": "Why are you so sure I'm of noble birth?",
                "vi": "Sao ngài chắc chắn rằng tôi thuộc dòng dõi cao quý?"
            }
        },
        {
            "content": "sự ra đời",
            "type": "noun",
            "example": {
                "en": "It is my intention to document the birth of the child.",
                "vi": "Tài liệu này của tôi nói về sự ra đời của một đứa bé."
            }
        },
        {
            "content": "gốc",
            "type": "noun",
            "example": {
                "en": "So, receiving God’s favor and blessing does not depend on our place of birth or ethnic background.",
                "vi": "Thế nên, việc nhận ân huệ và ân phước của Đức Chúa Trời không tùy thuộc vào quốc gia hoặc gốc dân của chúng ta."
            }
        },
        {
            "content": "đầu",
            "type": "noun",
            "example": {
                "en": "I would say the birth of our son Daniel.",
                "vi": "Có thể nói là đứa con đầu lòng của chúng tôi Daniel."
            }
        },
        {
            "content": "sinh đẻ",
            "type": "noun",
            "example": {
                "en": "To beget is to give birth, to procreate, or to call into being.",
                "vi": "Sinh là sinh đẻ, hình thành, hay ra đời."
            }
        },
        {
            "content": "sự sinh đẻ",
            "type": "noun",
            "example": {
                "en": "Mothers know that the challenges of labor precede the miracle of birth.",
                "vi": "Những người mẹ biết rằng thử thách của việc sinh đẻ đều diễn ra trước phép lạ của sự sinh đẻ."
            }
        },
        {
            "content": "sinh",
            "type": "verb",
            "example": {
                "en": "She gave birth to a daughter yesterday.",
                "vi": "Cô ấy sinh bé gái hồi hôm qua."
            }
        },
        {
            "content": "sự sinh nở",
            "type": "noun",
            "example": {
                "en": "It is so swift, so sudden, that it happens before birth pangs can begin!",
                "vi": "Sự sinh nở này đã diễn ra mau chóng và bất ngờ đến độ những cơn đau chuyển dạ chưa kịp bắt đầu!"
            }
        },
        {
            "content": "ngày thành lập",
            "type": "noun",
            "example": {}
        },
        {
            "content": "birth",
            "type": "",
            "example": {}
        },
        {
            "content": "生",
            "type": "verb",
            "example": {}
        },
        {
            "content": "sinh ra",
            "type": "",
            "example": {
                "en": "So he got the right weight at birth.",
                "vi": "Nên bé sinh ra được đủ cân nặng."
            }
        },
        {
            "content": "sinh sản",
            "type": "verb",
            "example": {
                "en": "There is no giving birth, no pregnancy, and no conception.",
                "vi": "Chẳng có sự sinh sản, mang thai hay thụ thai."
            }
        },
        {
            "content": "sự xuất hiện",
            "type": "",
            "example": {
                "en": "May well have been the death of Goki... or the birth of something legendary.",
                "vi": "Có thể Goki cũng như vậy... hoặc là sẽ có sự xuất hiện của một huyền thoại."
            }
        }
    ],
    "hasAudio": 1
}