{
    "word": "body",
    "type": "verb, noun",
    "spelling": "/ˈbɑdi/, /ˈbɒdi/, ˈbɒdɪ",
    "meanings": [
        {
            "content": "thân thể",
            "type": "noun",
            "example": {
                "en": "My memories of her are in my body, but when my body's no longer here, where will Trudi be then?",
                "vi": "Ký ức của Cha về bả ở trong thân thể Cha, nhưng khi thân thể Cha không còn nữa, thì Mẹ sẽ ở đâu?"
            }
        },
        {
            "content": "thân",
            "type": "noun",
            "example": {
                "en": "Just fix my body and leave my soul to me.",
                "vi": "Hãy chữa thân thể của tôi rồi để linh hồn mình cho tôi tự xử lý."
            }
        },
        {
            "content": "thể",
            "type": "verb noun",
            "example": {
                "en": "They found the body of a newborn baby in a freezer.",
                "vi": "Họ tìm thấy thi thể một đứa trẻ mới sinh trong tủ đông."
            }
        },
        {
            "content": "cơ thể",
            "type": "noun",
            "example": {
                "en": "Reading is to the mind what food is to the body.",
                "vi": "Đọc đối vời tinh thần cũng như thức ăn đối với cơ thể."
            }
        },
        {
            "content": "vật thể",
            "type": "noun",
            "example": {
                "en": "Simulation of a force free rotating asymmetric body",
                "vi": "Mô phỏng vật thể không đối xứng quay tự do"
            }
        },
        {
            "content": "người",
            "type": "noun",
            "example": {
                "en": "Tom has red spots all over his body.",
                "vi": "Tom nổi những đốm đỏ khắp người."
            }
        },
        {
            "content": "mình",
            "type": "noun",
            "example": {
                "en": "So, we are really not alone in our body.",
                "vi": "Vậy nên, ta không đơn độc trên chính cơ thể mình."
            }
        },
        {
            "content": "thây",
            "type": "noun",
            "example": {
                "en": "I was conscious while they dismembered my body, and discarded me like garbage.",
                "vi": "Tôi vẫn còn tỉnh táo khi chúng phanh thây và vứt bỏ tôi như rác rưởi."
            }
        },
        {
            "content": "身體",
            "type": "noun",
            "example": {}
        },
        {
            "content": "thi thể",
            "type": "noun",
            "example": {
                "en": "They found the body of a newborn baby in a freezer.",
                "vi": "Họ tìm thấy thi thể một đứa trẻ mới sinh trong tủ đông."
            }
        },
        {
            "content": "xác",
            "type": "noun",
            "example": {
                "en": "I'll do the body in the acid, okay?",
                "vi": "Tôi sẽ xử lý cái xác bằng axit nhé?"
            }
        },
        {
            "content": "xác chết",
            "type": "",
            "example": {
                "en": "I create the bodies, I don't erase the bodies.",
                "vi": "Tao tạo ra xác chết, Tao không xóa xác chết."
            }
        },
        {
            "content": "hội",
            "type": "verb",
            "example": {
                "en": "Next, the branch office would notify the body of elders.",
                "vi": "Sau đó, văn phòng chi nhánh sẽ báo cho hội đồng trưởng lão."
            }
        },
        {
            "content": "cơ quan",
            "type": "noun",
            "example": {
                "en": "Can you build this as an organ outside the body?",
                "vi": "Liệu có thể tạo ra 1 cơ quan bên ngoài cơ thể?"
            }
        },
        {
            "content": "hòm xe",
            "type": "noun",
            "example": {}
        },
        {
            "content": "mình mẩy",
            "type": "noun",
            "example": {
                "en": "I had ulcers all over my body.",
                "vi": "Ung nhọt nổi lên khắp mình mẩy tôi."
            }
        },
        {
            "content": "phần chính yếu",
            "type": "",
            "example": {
                "en": "26 Clearly, the belief that life continues after the body dies is an integral part of most Eastern religions.",
                "vi": "26 Rõ ràng tin tưởng đời sống tiếp tục sau khi chết là một phần chính yếu trong hầu hết các tôn giáo Đông Phương."
            }
        },
        {
            "content": "chất",
            "type": "noun",
            "example": {
                "en": "When your body is deprived of sufficient rest and nutrition, you’re less capable of dealing with your feelings.",
                "vi": "Bạn sẽ khó kiểm soát cảm xúc nếu thiếu ngủ và không đủ chất dinh dưỡng."
            }
        },
        {
            "content": "nhóm",
            "type": "noun",
            "example": {
                "en": "But they no longer made up a clearly identifiable, visible body, or organization.",
                "vi": "Tuy nhiên, họ không còn là một nhóm, hay tổ chức, hữu hình dễ nhận diện."
            }
        },
        {
            "content": "khối",
            "type": "",
            "example": {
                "en": "We further placed water bodies along the prevailing wind corridors,",
                "vi": "Chúng tôi còn đặt các khối nước dọc hành lang gió,"
            }
        },
        {
            "content": "đoàn",
            "type": "noun",
            "example": {
                "en": "After resurrection we will be immortal—our spirit and body will never again be separated.",
                "vi": "Tôi biết rằng chúng ta sẽ được đoàn tụ vào một ngày nào đó và sẽ không bao giờ bị chia cách nữa."
            }
        },
        {
            "content": "phường hội",
            "type": "",
            "example": {}
        },
        {
            "content": "số lượng lớn",
            "type": "",
            "example": {
                "en": "We grow the cells outside the body in large quantities.",
                "vi": "chúng tôi nuôi trồng các tế bào này với 1 số lượng lớn bên ngoài cơ thể"
            }
        },
        {
            "content": "xô viết",
            "type": "",
            "example": {}
        },
        {
            "content": "vật",
            "type": "noun",
            "example": {
                "en": "When the host dies the body cools and the fleas leave to find a new victim.",
                "vi": "Khi vật chủ thể chết, cơ thể lạnh đi thì bọ sẽ tìm nạn nhân mới."
            }
        },
        {
            "content": "ban",
            "type": "noun",
            "example": {
                "en": "When you came to the earth, you were given the precious gift of a body.",
                "vi": "Khi đến thế gian, các em đã được ban cho ân tứ quý giá của một thể xác."
            }
        },
        {
            "content": "nhiều",
            "type": "",
            "example": {
                "en": "They have good vision, so they use body postures to communicate.",
                "vi": "Chúng có tầm nhìn xa, do đó chúng dùng nhiều tư thế để giao tiếp."
            }
        },
        {
            "content": "đội",
            "type": "verb noun",
            "example": {
                "en": "16 The soldiers now led him off into the courtyard, that is, into the governor’s residence, and they called the whole body of troops together.",
                "vi": "16 Quân lính dẫn ngài vào sân, tức là trong dinh tổng đốc, rồi họ triệu tập cả đội quân lại."
            }
        },
        {
            "content": "con người",
            "type": "noun",
            "example": {
                "en": "You don't have a mean bone in your body.",
                "vi": "Cậu không có sự xấu xa bên trong con người cậu."
            }
        },
        {
            "content": "hình hài",
            "type": "",
            "example": {
                "en": "She vowed to bring the demon into our world in the body of a mortal man.",
                "vi": "Nàng thề sẽ đem con quỷ đến với trần thế trong hình hài một con người."
            }
        },
        {
            "content": "hội đồng",
            "type": "noun",
            "example": {
                "en": "Do you appreciate that the body of elders work together in unity?",
                "vi": "Bạn có cảm kích khi hội đồng trưởng lão làm việc hợp nhất không?"
            }
        },
        {
            "content": "nhục thể",
            "type": "noun",
            "example": {}
        },
        {
            "content": "rigid b",
            "type": "",
            "example": {}
        },
        {
            "content": "thể hiện",
            "type": "",
            "example": {
                "en": "Artistry can also be seen in the repair and recovery of the human body.",
                "vi": "Tính mỹ thuật cũng được thể hiện trong việc chỉnh sửa và phục hồi cơ thể người."
            }
        },
        {
            "content": "thể xác",
            "type": "",
            "example": {
                "en": "What is the difference between our mortal bodies and our resurrected bodies?",
                "vi": "Sự khác biệt giữa thể xác hữu diệt và thể xác phục sinh của chúng ta là gì?"
            }
        },
        {
            "content": "tượng trưng",
            "type": "",
            "example": {
                "en": "Bread without leaven was a fitting symbol of that body.",
                "vi": "Bánh không men tượng trưng thích hợp cho thân thể đó."
            }
        },
        {
            "content": "phần soạn thảo",
            "type": "",
            "example": {}
        }
    ],
    "hasAudio": 1
}