{
    "word": "bury",
    "type": [
        "verb",
        "noun"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ˈberē/",
            "/ˈbɛri/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ˈbɛri/"
        ]
    },
    "meanings": [
        {
            "content": "chôn",
            "type": "verb",
            "example": {
                "en": "Our dog buries bones in the yard.",
                "vi": "Con chó nhà tôi chôn xương ở trong vườn."
            }
        },
        {
            "content": "mai táng",
            "type": "verb",
            "example": {
                "en": "Don't you think it's time you buried your father for good?",
                "vi": "Cô không thấy đây là lúc mai táng cho cha cô tử tế sao?"
            }
        },
        {
            "content": "vùi",
            "type": "verb",
            "example": {
                "en": "Did they have to bury their dreams of even bigger instruments?",
                "vi": "Phải chăng họ phải chôn vùi giấc mơ chế tạo các kính thiên văn lớn hơn?"
            }
        },
        {
            "content": "chôn cất",
            "type": "",
            "example": {
                "en": "From the time we get here we're patting his hand, burying him.",
                "vi": "Kể từ khi tới đây chúng ta đã bắt đầu chôn cất ổng."
            }
        },
        {
            "content": "giấu đi",
            "type": "",
            "example": {
                "en": "At the time —and for years after that— I thought I had to be strong for my little sister, so I buried my emotions.",
                "vi": "Lúc ấy, thậm chí nhiều năm sau, mình nghĩ mình phải mạnh mẽ vì em gái nên đã giấu đi cảm xúc."
            }
        },
        {
            "content": "dập",
            "type": "verb",
            "example": {
                "en": "My fed contact says Donnelly's been crowing about burying HR.",
                "vi": "Người của tôi cho biết Donnelly đang khẩn trương dập tắt Đám quan cao cấp."
            }
        },
        {
            "content": "an táng",
            "type": "verb",
            "example": {
                "en": "The corpse bearers have taken the bodies to be buried.",
                "vi": "Những người an táng đã mang xác họ đi chôn rồi."
            }
        },
        {
            "content": "che đi",
            "type": "",
            "example": {}
        },
        {
            "content": "chôn vùi",
            "type": "",
            "example": {
                "en": "You have buried this knife But could not bury your past.",
                "vi": "Anh có thể chôn vùi thanh đao nhưng không thể chôn vùi quá khứ."
            }
        },
        {
            "content": "phủ đi",
            "type": "",
            "example": {}
        },
        {
            "content": "quên đi",
            "type": "",
            "example": {
                "en": "So tell me something, because I buried her.",
                "vi": "Nói tao chuyện đó, vì tao đã quên đi cô ta."
            }
        },
        {
            "content": "choân caát",
            "type": "",
            "example": {}
        }
    ]
}