{
    "word": "business",
    "type": [
        "noun",
        "adjective"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ˈbiznəs/",
            "/ˈbɪznəs/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ˈbɪznəs/"
        ]
    },
    "meanings": [
        {
            "content": "doanh nghiệp",
            "type": "noun",
            "example": {
                "en": "A corporation is the most complex kind of business organization .",
                "vi": "Một doanh nghiệp cổ phần là một dạng tổ chức doanh nghiệp phức tạp nhất ."
            }
        },
        {
            "content": "công tác",
            "type": "noun",
            "example": {
                "en": "But he told me that he was going on a business trip to Chicago.",
                "vi": "Nhưng anh ấy bảo mình là đi công tác ở Chicago."
            }
        },
        {
            "content": "công việc",
            "type": "noun",
            "example": {
                "en": "He is busy with his work.",
                "vi": "Anh ta bận rộn với công việc của anh ấy."
            }
        },
        {
            "content": "kinh doanh",
            "type": "",
            "example": {
                "en": "The ultimate question for me is whether I like business.",
                "vi": "Câu hỏi cuối dành cho tôi là tôi có thích kinh doanh không."
            }
        },
        {
            "content": "việc",
            "type": "noun",
            "example": {
                "en": "He never takes into account the fact that I am very busy.",
                "vi": "Anh ta không bao giờ để tâm việc tôi bận ra sao."
            }
        },
        {
            "content": "việc kinh doanh",
            "type": "noun",
            "example": {
                "en": "You've always complained that we don't take enough interest in your business.",
                "vi": "Bạn luôn than phiền về việc chúng tôi không dành một sự quan tâm đúng mức tới việc kinh doanh của bạn."
            }
        },
        {
            "content": "nghề",
            "type": "noun",
            "example": {
                "en": "Knowing who to trust is everything in this business.",
                "vi": "Biết phải tin ai chính là mấu chốt của nghề này."
            }
        },
        {
            "content": "quyền",
            "type": "noun",
            "example": {
                "en": "You have no business here, centaur.",
                "vi": "Các người không có quyền hành gì ở đây, lũ nhân mã."
            }
        },
        {
            "content": "chỗ làm ăn",
            "type": "noun",
            "example": {
                "en": "Down to you Nobody kills anybody in my place of business except me or Zed.",
                "vi": "Không ai giết ai ở chỗ làm ăn của tao ngoài trừ tao hoặc Zed."
            }
        },
        {
            "content": "công chuyện",
            "type": "noun",
            "example": {
                "en": "Discuss what's going on in this business our business, like men.",
                "vi": "Thảo luận tình hình làm ăn công chuyện, công chuyện của chúng ta, như hai người đàn ông."
            }
        },
        {
            "content": "thương mại",
            "type": "noun",
            "example": {
                "en": "He received one of the highest grades in that course on business law.",
                "vi": "Anh ấy nhận được một trong những số điểm cao nhất của khóa học luật thương mại đó."
            }
        },
        {
            "content": "cách diễn xuất",
            "type": "",
            "example": {}
        },
        {
            "content": "kinh doanh thương mại",
            "type": "",
            "example": {}
        },
        {
            "content": "làm ăn",
            "type": "",
            "example": {
                "en": "And I learned that you have to have a business plan before starting a business.",
                "vi": "Và tôi học được rằng bạn cần một kế hoạch làm ăn trước khi khởi nghiệp."
            }
        },
        {
            "content": "nghiệp vụ",
            "type": "",
            "example": {
                "en": "I don't know anything that's not police business.",
                "vi": "Tôi không biết gì về những vấn đề liên quan đến nghiệp vụ."
            }
        },
        {
            "content": "nghề nghiệp",
            "type": "noun",
            "example": {
                "en": "It was a tradition that you didn't chat about your business in public.",
                "vi": "Giống truyền thống không tán gẫu về nghề nghiệp của mình chỗ đông người."
            }
        },
        {
            "content": "nghị sự",
            "type": "",
            "example": {
                "en": "The first order of business was to discuss and analyze the engineering design specifications of the project.",
                "vi": "Vấn đề đầu tiên trên chương trình nghị sự là thảo luận và phân tích các chi tiết thiết kế kỹ thuật của dự án."
            }
        },
        {
            "content": "nhuồm khoé",
            "type": "",
            "example": {}
        },
        {
            "content": "quá trình diễn biến",
            "type": "",
            "example": {}
        },
        {
            "content": "sự giao dịch",
            "type": "",
            "example": {}
        },
        {
            "content": "tuồm vấn đề",
            "type": "",
            "example": {}
        },
        {
            "content": "tình trạng bận rộn",
            "type": "",
            "example": {}
        },
        {
            "content": "việc buôn bán",
            "type": "noun",
            "example": {
                "en": "The price of doing business in a treacherous world.",
                "vi": "Cái giá của việc buôn bán ở thế giới giàu có."
            }
        },
        {
            "content": "việc khó khăn",
            "type": "",
            "example": {
                "en": "That's a rough business to be in right now.",
                "vi": "Quả là công việc khó khăn vào thời buổi này."
            }
        },
        {
            "content": "việc thương mại",
            "type": "noun",
            "example": {
                "en": "Why is it good to count the cost before entering a business relationship?",
                "vi": "Tại sao tính toán phí tổn trước khi tham gia công việc thương mại là tốt?"
            }
        },
        {
            "content": "xí nghiệp",
            "type": "noun",
            "example": {
                "en": "The factory manager turned corrupt, forcing the business into bankruptcy.",
                "vi": "Giám đốc công ty trở nên thối nát, khiến xí nghiệp bị phá sản."
            }
        },
        {
            "content": "nghiệp",
            "type": "noun",
            "example": {
                "en": "It does this by supporting small businesses .",
                "vi": "Họ thực hiện việc này bằng cách hỗ trợ các doanh nghiệp nhỏ ."
            }
        },
        {
            "content": "vụ",
            "type": "noun",
            "example": {
                "en": "But I recommend you finish your business with the man quickly.",
                "vi": "Song tôi khuyên ông nên chóng kết thúc vụ làm ăn với người đó."
            }
        },
        {
            "content": "sự",
            "type": "noun",
            "example": {
                "en": "Could Tom really be as busy as he says he is?",
                "vi": "Liệu Tom có thật sự bận rộn như cậu ấy nói?"
            }
        },
        {
            "content": "công ty",
            "type": "noun",
            "example": {
                "en": "It is easy to see why big business views the mobile phone as a friend.",
                "vi": "Thật dễ hiểu tại sao các đại công ty coi điện thoại di động là bạn."
            }
        },
        {
            "content": "cửa hàng",
            "type": "noun",
            "example": {
                "en": "She was busy looking everywhere in the stores for Jim 's present .",
                "vi": "Nàng mải miết tìm đâu đó trong các cửa hàng để mua món quà cho Jim ."
            }
        },
        {
            "content": "nghiệp vụ, kinh doanh, công việc",
            "type": "",
            "example": {}
        }
    ]
}