{
    "word": "character",
    "type": [
        "verb",
        "noun"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ˈkerəktər/",
            "/ˈkɛrəktər/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ˈkarəktə/"
        ]
    },
    "meanings": [
        {
            "content": "nhân vật",
            "type": "noun",
            "example": {
                "en": "They are a graphical visualization of a character.",
                "vi": "Chúng là hình ảnh hóa được đồ họa của một nhân vật."
            }
        },
        {
            "content": "tính cách",
            "type": "noun",
            "example": {
                "en": "They wanted to develop the city but keep its character, its history.",
                "vi": "Họ muốn phát triển thành phố nhưng vẫn giữ tính cách cũ, lịch sử cũ."
            }
        },
        {
            "content": "đặc điểm",
            "type": "noun",
            "example": {
                "en": "We gave a name to every sheep, according to differences in their appearance or character traits.",
                "vi": "Chúng tôi đặt tên cho từng con chiên theo đặc điểm và tính của mỗi con."
            }
        },
        {
            "content": "nghị lực",
            "type": "",
            "example": {
                "en": "Sticking faithfully to a marriage mate demands strength of character and love of principle.",
                "vi": "Chung thủy gắn bó với người hôn phối đòi hỏi nghị lực và yêu chuộng nguyên tắc."
            }
        },
        {
            "content": "người lập dị",
            "type": "",
            "example": {}
        },
        {
            "content": "tự",
            "type": "pronoun noun adposition",
            "example": {
                "en": "However, I pride myself on being a good judge of character.",
                "vi": "Mặc dù, tôi tự hào là mình giỏi nhìn người."
            }
        },
        {
            "content": "chữ",
            "type": "noun",
            "example": {
                "en": "The characters on the unsealed part were small, and beautifully engraved.",
                "vi": "Những chữ trên phần không bị niêm phong thì nhỏ, và được khắc rất đẹp."
            }
        },
        {
            "content": "tính chất",
            "type": "noun",
            "example": {
                "en": "Each has its own character and its own peculiar history.",
                "vi": "Mỗi bản có tính chất riêng và lịch sử đặc biệt của nó."
            }
        },
        {
            "content": "tiếng",
            "type": "noun",
            "example": {
                "en": "Then I drifted into playing a rather popular character on a television series.",
                "vi": "Rồi tôi chuyển qua đóng... một vai khá nổi tiếng trong một phim bộ truyền hình."
            }
        },
        {
            "content": "bản sắc",
            "type": "noun",
            "example": {}
        },
        {
            "content": "chí khí",
            "type": "",
            "example": {
                "en": "Humility is the precious fertile soil of righteous character.",
                "vi": "Lòng khiêm nhường thật là quý báu và cần có để phát triển chí khí ngay chính."
            }
        },
        {
            "content": "cá tính",
            "type": "",
            "example": {
                "en": "It's quite suitable to your high moral character.",
                "vi": "Nó rất thích hợp với cá tính nghiêm trang của anh."
            }
        },
        {
            "content": "danh tiếng",
            "type": "",
            "example": {
                "en": "Instead of winning to honor me with your high reputation act against your character and do badly.",
                "vi": "với danh tiếng của ngài... hãy làm điều ngược lại và làm thật tệ."
            }
        },
        {
            "content": "dấu chữ",
            "type": "",
            "example": {}
        },
        {
            "content": "giấy chứng nhận",
            "type": "",
            "example": {}
        },
        {
            "content": "mẫu tự",
            "type": "",
            "example": {}
        },
        {
            "content": "nét chữ",
            "type": "",
            "example": {}
        },
        {
            "content": "nét đặc sắc",
            "type": "",
            "example": {}
        },
        {
            "content": "tên tuổi",
            "type": "",
            "example": {
                "en": "Ben-Gay made the fatal mistake of attaching a recognizable brand name to something totally out of character .",
                "vi": "Ben-Gay mắc sai lầm chết người là gắn tên tuổi thương hiệu đã được thừa nhận vào thứ hoàn toàn không có danh tiếng ."
            }
        },
        {
            "content": "tính nết",
            "type": "",
            "example": {
                "en": "His supervisors, appreciating his industriousness and fine character, rewarded him with various privileges.",
                "vi": "Vì cấp trên quý trọng tính siêng năng và tính nết tốt của anh nên thưởng anh nhiều đặc lợi."
            }
        },
        {
            "content": "tổ hợp điện mã",
            "type": "",
            "example": {}
        },
        {
            "content": "đặc tính",
            "type": "",
            "example": {
                "en": "and the bread goes through some stages, and characters develop.",
                "vi": "và chiếc bánh trải qua 1 vài công đoạn sẽ phát triển các đặc tính."
            }
        },
        {
            "content": "tính",
            "type": "noun",
            "example": {
                "en": "They wanted to develop the city but keep its character, its history.",
                "vi": "Họ muốn phát triển thành phố nhưng vẫn giữ tính cách cũ, lịch sử cũ."
            }
        },
        {
            "content": "kí tự",
            "type": "",
            "example": {
                "en": "Insert the selected character in the text",
                "vi": "Chèn kí tự được chọn vào văn bản"
            }
        },
        {
            "content": "ký tự",
            "type": "noun",
            "example": {
                "en": "The taller letters have been named gallows characters.",
                "vi": "Những chữ cái cao hơn được gọi là các ký tự giá treo."
            }
        },
        {
            "content": "thanh danh",
            "type": "",
            "example": {}
        }
    ]
}