{
    "word": "child",
    "type": [
        "noun"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/CHīld/",
            "/tʃaɪld/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/tʃʌɪld/"
        ]
    },
    "meanings": [
        {
            "content": "con",
            "type": "noun",
            "example": {
                "en": "Soon enough that child will spread her legs and start breeding.",
                "vi": "Sớm muộn gì đứa con gái đó cũng sẽ trường thành."
            }
        },
        {
            "content": "đứa bé",
            "type": "noun",
            "example": {
                "en": "The mother of that child is an announcer.",
                "vi": "Mẹ của đứa bé kia là một phát thanh viên."
            }
        },
        {
            "content": "đứa trẻ",
            "type": "noun",
            "example": {
                "en": "Each child has an individual way of thinking.",
                "vi": "Mỗi đứa trẻ có một cách suy nghĩ khác nhau."
            }
        },
        {
            "content": "tử",
            "type": "verb noun",
            "example": {
                "en": "I had no choice but to take my soldiers and the child become a fugitive",
                "vi": "Tôi không còn cách nào ngoài đưa hoàng tử và lính của tôi bỏ trốn."
            }
        },
        {
            "content": "đứa con",
            "type": "",
            "example": {
                "en": "Finally, after eight years, their seventh child was born—a little boy.",
                "vi": "Cuối cùng, tám năm sau, đứa con thứ bảy được sinh ra—một đứa con trai."
            }
        },
        {
            "content": "anh nhi",
            "type": "noun",
            "example": {}
        },
        {
            "content": "cháu",
            "type": "noun",
            "example": {
                "en": "My dear child, I am so sorry that the burden falls on your shoulders.",
                "vi": "Cháu yêu, ta rất tiếc khi gánh nặng này lại đặt lên vai cháu."
            }
        },
        {
            "content": "em bé",
            "type": "noun",
            "example": {
                "en": "Ask others to help you with child care, household chores, and errands.",
                "vi": "Nhờ người khác phụ chăm sóc em bé, làm việc nhà và những việc vặt."
            }
        },
        {
            "content": "đứa nhỏ",
            "type": "noun",
            "example": {
                "en": "A clumsier child you'll never see than Horace.",
                "vi": "Một đứa nhỏ hậu đậu nhất trên đời."
            }
        },
        {
            "content": "mụn",
            "type": "",
            "example": {}
        },
        {
            "content": "con nít",
            "type": "noun",
            "example": {
                "en": "Your child may argue a point just to prove that he is growing up.",
                "vi": "Có lẽ con cãi lại chỉ để chứng tỏ mình không còn là con nít."
            }
        },
        {
            "content": "hậu quả",
            "type": "",
            "example": {
                "en": "Do you realize the consequences of boredom for a gifted child, Mr. Adler?",
                "vi": "Anh biết hậu quả của sự nhàm chán với một đứa trẻ thần đồng không, anh Adler?"
            }
        },
        {
            "content": "kết quả",
            "type": "verb noun",
            "example": {
                "en": "Eventually, the child will realize that the tantrum has got him nowhere.",
                "vi": "Cuối cùng, bé sẽ nhận ra việc cáu giận không mang lại kết quả nào."
            }
        },
        {
            "content": "sản phẩm",
            "type": "noun",
            "example": {
                "en": "Aristotle’s great scheme was a child of philosophy, not science.",
                "vi": "Khái niệm phức tạp của Aristotle là một sản phẩm triết học, chứ không phải khoa học."
            }
        },
        {
            "content": "trẻ con",
            "type": "noun",
            "example": {
                "en": "This book is so easy that a child can read it.",
                "vi": "Bởi vì cuốn sách này rất dễ cho nên ngay cả trẻ con cũng có thể đọc được."
            }
        },
        {
            "content": "trẻ em",
            "type": "noun",
            "example": {
                "en": "As citizens, I'm asking you not to leave any child behind.",
                "vi": "Đừng bỏ lại bất kì trẻ em nào."
            }
        },
        {
            "content": "trẻ",
            "type": "adjective",
            "example": {
                "en": "She found it necessary to accustom her child to getting up early.",
                "vi": "Cô ấy nhận ra điều cần thiết là tập cho bọn trẻ của cô ấy thức dậy sớm."
            }
        },
        {
            "content": "Trẻ em",
            "type": "",
            "example": {
                "en": "You're not a child.",
                "vi": "Em không phải là trẻ em."
            }
        }
    ]
}