{
    "word": "children",
    "type": [
        "noun"
    ],
    "meanings": [
        {
            "content": "cháu",
            "type": "noun",
            "example": {
                "en": "Today they have five children and eight grandchildren.",
                "vi": "Ngày nay, họ có năm người con và tám đứa cháu."
            }
        },
        {
            "content": "con cháu",
            "type": "",
            "example": {
                "en": "Let's keep our children's blood pure and their heads empty.",
                "vi": "Hãy giữ cho máu của con cháu ta trong sạch và đầu óc chúng ngây thơ."
            }
        },
        {
            "content": "con cái",
            "type": "noun",
            "example": {
                "en": "Parents who beat their children really make my blood boil.",
                "vi": "Cha mẹ mà đánh con cái làm tôi giận sôi máu."
            }
        },
        {
            "content": "hậu quả",
            "type": "",
            "example": {
                "en": "Have the children form two lines, a “choice” line and a “consequences” line.",
                "vi": "Bảo các em sắp thành hai hàng, một hàng “lựa chọn” và một hàng “hậu quả”."
            }
        },
        {
            "content": "kết quả",
            "type": "verb noun",
            "example": {
                "en": "As your children grow, it is essential for them to learn that actions have consequences.",
                "vi": "Cha mẹ cần dạy con biết rằng việc làm đi liền với kết quả."
            }
        },
        {
            "content": "nhi đồng",
            "type": "",
            "example": {
                "en": "The staff at the children’s medical center told us to feed her more often.",
                "vi": "Nhân viên bệnh viện nhi đồng nói với chúng tôi phải cho nó bú thường xuyên hơn."
            }
        },
        {
            "content": "sản phẩm",
            "type": "noun",
            "example": {
                "en": "and the children inherit the traits of the subroutines of the two programs.",
                "vi": "và sản phẩm được thừa hưởng tính chất của các quy tắc của hai chương trình."
            }
        },
        {
            "content": "thiếu nhi",
            "type": "",
            "example": {
                "en": "Are celebrity children 's books any good ?",
                "vi": "Người nổi tiếng viết sách thiếu nhi có hay không ?"
            }
        },
        {
            "content": "trẻ",
            "type": "noun",
            "example": {
                "en": "Our children's education set us back quite a lot.",
                "vi": "Tôi đã khá tốn tiền học cho bọn trẻ."
            }
        },
        {
            "content": "trẻ con",
            "type": "plural",
            "example": {
                "en": "Do Japanese children really paint the sun red?",
                "vi": "Có phải trẻ con người Nhật thật sự thích tô mặt trời màu đỏ?"
            }
        },
        {
            "content": "trẻ em",
            "type": "",
            "example": {
                "en": "The children were rushing about.",
                "vi": "Các trẻ em xông xáo chỗ này chỗ kia."
            }
        },
        {
            "content": "đứa bé",
            "type": "noun",
            "example": {
                "en": "Any children we might have will be well provided for.",
                "vi": "Và nếu chúng ta có con thì những đứa bé sẽ được chu cấp đầy đủ."
            }
        },
        {
            "content": "đứa con",
            "type": "",
            "example": {
                "en": "He has no less than twelve children.",
                "vi": "Ông ấy có không dưới 12 đứa con."
            }
        },
        {
            "content": "đứa trẻ",
            "type": "noun",
            "example": {
                "en": "Unknowingly, we may look beyond the children in our own midst.",
                "vi": "Vô tình, chúng ta không để ý đến những đứa trẻ sống gần chúng ta."
            }
        }
    ]
}