{
    "word": "closely",
    "type": [
        "adverb"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ˈklōslē/",
            "/ˈkloʊsli/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ˈkləʊsli/"
        ]
    },
    "meanings": [
        {
            "content": "sát",
            "type": "verb",
            "example": {
                "en": "Sheriff Wade he could close you down anytime.",
                "vi": "Cảnh sát trưởng Wade ổng có thể đóng cửa anh bất cứ lúc nào."
            }
        },
        {
            "content": "gần",
            "type": "adposition",
            "example": {
                "en": "My house is close to the school.",
                "vi": "Nhà tôi ở gần trường."
            }
        },
        {
            "content": "khít",
            "type": "",
            "example": {
                "en": "A close, warm friendship cannot be cultivated overnight.",
                "vi": "Tình bằng hữu khắng khít không thể hình thành trong một sớm một chiều."
            }
        },
        {
            "content": "chặt chẽ",
            "type": "",
            "example": {
                "en": "Watch your competition as closely as you do your own employees .",
                "vi": "Hãy giám sát chặt chẽ đối thủ như với chính những nhân viên của mình vậy ."
            }
        },
        {
            "content": "cẩn thận",
            "type": "",
            "example": {
                "en": "I will take very close care of your interests.",
                "vi": "Tôi sẽ trông chừng cẩn thận những quyền lợi của ngài."
            }
        },
        {
            "content": "gần gũi",
            "type": "adverb",
            "example": {
                "en": "Few people want to be close companions with those who display a negative and complaining spirit.",
                "vi": "Không mấy ai muốn gần gũi những người tỏ thái độ phàn nàn và tiêu cực."
            }
        },
        {
            "content": "kỹ lưỡng",
            "type": "",
            "example": {
                "en": "The other shook his head and examined his new possession closely .",
                "vi": "Người kia lắc đầu và xem xét kỹ lưỡng món đồ mới của mình ."
            }
        },
        {
            "content": "sít vào nhau",
            "type": "",
            "example": {}
        },
        {
            "content": "thân mật",
            "type": "adverb",
            "example": {
                "en": "Likes to keep you close while he keeps himself remote.",
                "vi": "Kiểu như hắn có thể giữ anh bên cạnh trong khi hắn chẳng thân mật gì."
            }
        },
        {
            "content": "tỉ mỉ",
            "type": "",
            "example": {
                "en": "I've been closely watching the earth and its dwellers",
                "vi": "Tôi đã quan sát trái đất và con người một cách tỉ mỉ"
            }
        }
    ]
}