{
    "word": "come",
    "type": [
        "verb",
        "noun",
        "interjection",
        "adposition"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/kəm/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/kʌm/"
        ]
    },
    "meanings": [
        {
            "content": "đến",
            "type": "verb",
            "example": {
                "en": "Susan found out where the puppy had come from.",
                "vi": "Susan đã biết được mấy con chó con đến từ chỗ nào."
            }
        },
        {
            "content": "lại",
            "type": "verb",
            "example": {
                "en": "Please come back to Boston and visit us whenever you have a chance.",
                "vi": "Hãy trở lại Boston thăm bọn tôi khi nào có dịp nhé."
            }
        },
        {
            "content": "trở nên",
            "type": "verb",
            "example": {
                "en": "But something happened on the plane and everything's coming up roses.",
                "vi": "Nhưng có chuyện xảy ra trên máy bay và mọi chuyện trở nên tiền hung hậu cát."
            }
        },
        {
            "content": "trở thành",
            "type": "verb",
            "example": {
                "en": "Everyone would like to believe that dreams can come true.",
                "vi": "Ai cũng muốn tin rằng mọi giấc mơ đều có thể trở thành hiện thực."
            }
        },
        {
            "content": "thành",
            "type": "verb",
            "example": {
                "en": "Right, this coming from the guy who said Google was a bubble.",
                "vi": "Phải, những người nói Google thành bóng bay thì cho là thế."
            }
        },
        {
            "content": "tới",
            "type": "verb",
            "example": {
                "en": "I invited twelve people to my party, but one person could not come.",
                "vi": "Tôi mời mười hai người tới bữa tiệc của tôi, nhưng một người không đến."
            }
        },
        {
            "content": "nào",
            "type": "",
            "example": {
                "en": "Help her till the cows come home: some day, you will be disappointed in her.",
                "vi": "Cứ mãi giúp cô ta, rồi một ngày nào đó, anh sẽ thất vọng về cô ta."
            }
        },
        {
            "content": "nên",
            "type": "verb noun",
            "example": {
                "en": "If you think your team can win against our team, you've got another thing coming!",
                "vi": "Nếu anh nghĩ rằng đội của anh có thể thắng đội của chúng tôi thì anh nên nghĩ lại!"
            }
        },
        {
            "content": "làm thế nào",
            "type": "",
            "example": {
                "en": "But who was Rashi, and how did he come to have so much influence?",
                "vi": "Nhưng Rashi là ai, và làm thế nào ông đã có nhiều ảnh hưởng đến thế?"
            }
        },
        {
            "content": "sắp tới",
            "type": "",
            "example": {
                "en": "Will anybody else come?",
                "vi": "Còn ai khác sắp tới không?"
            }
        },
        {
            "content": "đi đến",
            "type": "",
            "example": {
                "en": "I need something from you and I've come too far for a no answer.",
                "vi": "Tôi cần anh giúp và tôi đã đi đến nước này để bị từ chối."
            }
        },
        {
            "content": "đứng giữa",
            "type": "",
            "example": {
                "en": "Look how she comes between cyrus and her daughter.",
                "vi": "Hãy nhìn cách cô ấy đứng giữa Cyrus và con gái."
            }
        },
        {
            "content": "thế",
            "type": "conjunction verb noun",
            "example": {
                "en": "The hammer comes down, it's gonna be custer's last stand.",
                "vi": "Khi búa bổ xuống, nó sẽ giống như tình thế cuối cùng của custer."
            }
        },
        {
            "content": "làm",
            "type": "verb",
            "example": {
                "en": "You know we've got a filing coming up.",
                "vi": "Bọn tôi đang có sổ sách phải làm."
            }
        },
        {
            "content": "ở",
            "type": "verb adposition",
            "example": {
                "en": "I'll wait here until she comes.",
                "vi": "Tôi sẽ đợi ở đây đến khi nào cô ấy tới."
            }
        },
        {
            "content": "thấy",
            "type": "verb",
            "example": {
                "en": "How come those heels are missing when everything else is there?",
                "vi": "Những thứ khác đều còn, tại sao chỉ có đôi giày đó là không thấy đâu?"
            }
        },
        {
            "content": "hoá ra",
            "type": "",
            "example": {}
        },
        {
            "content": "hành động",
            "type": "verb noun",
            "example": {
                "en": "Can a good thing come from a bad act?",
                "vi": "Có thể nào có được tốt lành từ một hành động xấu xa?"
            }
        },
        {
            "content": "hình thành",
            "type": "",
            "example": {
                "en": "You really watched the world come into being?",
                "vi": "Ngài thật sự thấy thế giới hình thành sao?"
            }
        },
        {
            "content": "sắp đến",
            "type": "",
            "example": {
                "en": "The winter chaos is driving me crazy, but soon the holidays will come.",
                "vi": "Sự hỗn luạn của mùa đông làm tôi muốn phát điên, cũng may mà kì nghí đông sắp đến rồi."
            }
        },
        {
            "content": "thành ra",
            "type": "",
            "example": {
                "en": "But when it comes down to you and me versus him, I'm sorry.",
                "vi": "Nhưng khi sự thể thành ra mày và thầy đối đầu hắn, thầy rất tiếc."
            }
        },
        {
            "content": "thấy ở",
            "type": "",
            "example": {
                "en": "How come I feel... it's getting less crowded now?",
                "vi": "Sao tôi thấy... ở đây không có ai vậy?"
            }
        },
        {
            "content": "xảy ra",
            "type": "verb",
            "example": {
                "en": "But something happened on the plane and everything's coming up roses.",
                "vi": "Nhưng có chuyện xảy ra trên máy bay và mọi chuyện trở nên tiền hung hậu cát."
            }
        },
        {
            "content": "xảy đến",
            "type": "",
            "example": {
                "en": "You need to be prepared for what's to come.",
                "vi": "Cậu cần chuẩn bị những chuyện sắp xảy đến"
            }
        },
        {
            "content": "xử sự",
            "type": "",
            "example": {}
        },
        {
            "content": "đi lại",
            "type": "",
            "example": {
                "en": "Because I got to knock off work to come here and the commute is killin'me.",
                "vi": "Bởi tôi phải bỏ việc để đến đây và cái việc đi lại đang giết tôi."
            }
        },
        {
            "content": "đi tới",
            "type": "",
            "example": {
                "en": "He's coming up to the grandstand, fellow Federationists.",
                "vi": "Anh ấy đang đi tới khán đài, anh Federistas."
            }
        },
        {
            "content": "đông lại",
            "type": "",
            "example": {
                "en": "Again crowds come to him, and he begins teaching them.",
                "vi": "Đám đông lại đến tìm ngài và ngài bắt đầu dạy họ."
            }
        },
        {
            "content": "đặc lại",
            "type": "",
            "example": {}
        },
        {
            "content": "lên tới",
            "type": "",
            "example": {
                "en": "As the girder comes up, you jump out on it and grab the baby.",
                "vi": "Khi chiếc rầm lên tới, mày nhảy ra và tóm lấy đứa bé."
            }
        }
    ]
}