{
    "word": "comfort",
    "type": [
        "verb",
        "noun"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ˈkəmfərt/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ˈkʌmfət/"
        ]
    },
    "meanings": [
        {
            "content": "an ủi",
            "type": "verb, noun",
            "example": {
                "en": "I found that my greatest comfort came from comforting others who had lost loved ones in death.",
                "vi": "Niềm an ủi lớn nhất của tôi là an ủi những người nào mất đi người thân yêu."
            }
        },
        {
            "content": "sự an ủi",
            "type": "noun",
            "example": {
                "en": "They can be a comfort to all of us.",
                "vi": "Những lời này có thể là một sự an ủi đối với tất cả chúng ta."
            }
        },
        {
            "content": "tiện nghi",
            "type": "",
            "example": {
                "en": "And our lives today are safer and more comfortable than they have ever been.",
                "vi": "Và cuộc sống của chúng ta ngày nay an toàn và tiện nghi hơn bao giờ hết."
            }
        },
        {
            "content": "an lạc",
            "type": "noun",
            "example": {
                "en": "How anxious I am to see that she is comfortable.",
                "vi": "Tôi lo lắng biết bao cho sự an lạc của chị."
            }
        },
        {
            "content": "làm dịu",
            "type": "noun",
            "example": {
                "en": "Queen Aslaug cannot comfort her son Ivar when he is suffering.",
                "vi": "Nữ hoàng Aslaug không thể làm dịu Ivar khi nó quấy khóc"
            }
        },
        {
            "content": "sự dễ chịu",
            "type": "noun",
            "example": {
                "en": "So the stadium has a few elements which create that outdoor comfort.",
                "vi": "Sân vận động có vài yếu tố tạo ra sự dễ chịu ngoài trời."
            }
        },
        {
            "content": "trấn an",
            "type": "noun",
            "example": {
                "en": "What encouragement and comfort does he give them?",
                "vi": "Ngài khích lệ và trấn an họ ra sao?"
            }
        },
        {
            "content": "dỗ",
            "type": "verb",
            "example": {
                "en": "Whenever we speak of you, he weeps and won't be comforted.",
                "vi": "Mỗi khi nhắc tới anh nó khóc và không thể dỗ được."
            }
        },
        {
            "content": "chăn lông vịt",
            "type": "",
            "example": {}
        },
        {
            "content": "dỗ dành",
            "type": "",
            "example": {
                "en": "You always say you wanna comfort me.",
                "vi": "Anh luôn nói rằng anh muốn dỗ dành em."
            }
        },
        {
            "content": "giải khuây",
            "type": "",
            "example": {}
        },
        {
            "content": "khuyên giải",
            "type": "",
            "example": {
                "en": "Freya will comfort you as she comforts me.",
                "vi": "Thần Freya sẽ khuyên giải con như Bà ấy đã khuyên giải mẹ"
            }
        },
        {
            "content": "làm khuây khoả",
            "type": "",
            "example": {}
        },
        {
            "content": "lời an ủi",
            "type": "",
            "example": {
                "en": "Words of comfort were spoken which fit perfectly together.",
                "vi": "Những lời an ủi thích hợp hoàn toàn đã được thốt ra."
            }
        },
        {
            "content": "nguồn an ủi",
            "type": "",
            "example": {
                "en": "Some of your letters were a great comfort.",
                "vi": "Những lá thư của anh là một nguồn an ủi lớn."
            }
        },
        {
            "content": "người an ủi",
            "type": "",
            "example": {
                "en": "These too would likely welcome a comforter, someone to ease the burden just a little.",
                "vi": "Những người này chắc hẳn cũng cần có người an ủi họ, giúp họ nhẹ gánh phần nào."
            }
        },
        {
            "content": "người khuyên giải",
            "type": "",
            "example": {}
        },
        {
            "content": "sự an nhàn",
            "type": "",
            "example": {
                "en": "His plans revolved purely around his own desires and comforts.",
                "vi": "Những dự tính của ông chỉ xoay quanh ước muốn và sự an nhàn của bản thân."
            }
        },
        {
            "content": "sự khuyên giải",
            "type": "noun",
            "example": {}
        },
        {
            "content": "sự nhàn hạ",
            "type": "",
            "example": {}
        },
        {
            "content": "sự sung túc",
            "type": "",
            "example": {}
        },
        {
            "content": "sự thoải mái",
            "type": "noun",
            "example": {
                "en": "We try to do whatever we can to provide some assistance, some protection, some comfort.",
                "vi": "Chúng tôi làm mọi thứ có thể để hỗ trợ, bảo vệ, tạo sự thoải mái."
            }
        },
        {
            "content": "vỗ về",
            "type": "verb, noun",
            "example": {
                "en": "Express words of consolation and comfort to people who are suffering or experiencing afflictions.",
                "vi": "Bày tỏ những lời an ủi và vỗ về với những người đang đau khổ hoặc hay gặp điều phiền não."
            }
        }
    ]
}