{
    "word": "communicate",
    "type": [
        "verb"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/kəˈmyo͞onəˌkāt/",
            "/kəˈmjunəˌkeɪt/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/kəˈmjuːnɪkeɪt/"
        ]
    },
    "meanings": [
        {
            "content": "liên lạc",
            "type": "verb",
            "example": {
                "en": "But it won't do us much good if we can't get world communications back up.",
                "vi": "Nhưng sẽ không có hiệu quả nhiều nếu không khôi phục liên lạc toàn cầu."
            }
        },
        {
            "content": "truyền đạt",
            "type": "",
            "example": {
                "en": "Ted was finally able to communicate his thoughts in Japanese.",
                "vi": "Cuối cùng thì Ted đã có thể truyền đạt suy nghĩ của mình bằng tiếng Nhật."
            }
        },
        {
            "content": "truyền",
            "type": "verb",
            "example": {
                "en": "Ted was finally able to communicate his thoughts in Japanese.",
                "vi": "Cuối cùng thì Ted đã có thể truyền đạt suy nghĩ của mình bằng tiếng Nhật."
            }
        },
        {
            "content": "lây",
            "type": "verb",
            "example": {}
        },
        {
            "content": "liên lạc với",
            "type": "",
            "example": {
                "en": "Those who communicate with the dead are actually communicating with the demons.",
                "vi": "Những ai liên lạc với người chết thật ra là đang liên lạc với các quỷ."
            }
        },
        {
            "content": "báo tin truyền tin",
            "type": "",
            "example": {}
        },
        {
            "content": "chia sẻ",
            "type": "verb",
            "example": {
                "en": "Using it for communication or sharing is the big key towards getting your needs met.",
                "vi": "Giao tiếp, chia sẻ là mấu chốt để đáp ứng nhu cầu của bạn."
            }
        },
        {
            "content": "chuyển đạt",
            "type": "",
            "example": {
                "en": "There have been various suggestions as to how the serpent might have communicated with Eve.",
                "vi": "Có nhiều sự gợi ý khác nhau về cách con rắn đã chuyển đạt cho Ê-va."
            }
        },
        {
            "content": "giao thiệp",
            "type": "",
            "example": {
                "en": "Since then, the Internet has transformed the way we communicate,",
                "vi": "Đến nay, internet thay đổi cách chúng ta giao thiệp,"
            }
        },
        {
            "content": "giao thông",
            "type": "verb",
            "example": {
                "en": "Traffic lights can communicate to the car and so on.",
                "vi": "Đèn giao thông có thể liên lạc với xe và nhiều nữa."
            }
        },
        {
            "content": "giao tiếp",
            "type": "",
            "example": {
                "en": "Brother Schmidt had communicated with heaven, and heaven had communicated with him.",
                "vi": "Anh Schmidt đã giao tiếp với thiên thượng, và thiên thượng đã giao tiếp với anh."
            }
        },
        {
            "content": "thông báo",
            "type": "verb",
            "example": {
                "en": "In a meeting at the community hall, he announced his resignation as a Catholic missionary.",
                "vi": "Trong một cuộc họp ở phòng cộng đồng, Miguel thông báo từ chức giáo sĩ."
            }
        },
        {
            "content": "thông nhau",
            "type": "",
            "example": {}
        },
        {
            "content": "thông tri",
            "type": "",
            "example": {
                "en": "But why do we shed tears as we grow older, when we can communicate in other ways?",
                "vi": "Nhưng tại sao khi lớn lên chúng ta vẫn rơi lệ, trong khi chúng ta có thể thông tri qua nhiều cách khác?"
            }
        },
        {
            "content": "giao",
            "type": "verb",
            "example": {
                "en": "You know, traditionally, women are much more communal than men.",
                "vi": "Cô biết không, phụ nữ giao tiếp với nhau dễ hơn là đàn ông."
            }
        },
        {
            "content": "thông",
            "type": "noun",
            "example": {
                "en": "The rocket put a communications satellite into orbit.",
                "vi": "Tên lửa đã đưa vệ tinh viễn thông vào quỹ đạo."
            }
        }
    ]
}