{
    "word": "common",
    "type": [
        "adjective",
        "verb",
        "noun"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ˈkämən/",
            "/ˈkɑmən/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ˈkɒmən/"
        ]
    },
    "meanings": [
        {
            "content": "thường",
            "type": "adjective",
            "example": {
                "en": "Don't treat me as common people.",
                "vi": "Đừng coi tôi như người \"bình thường\"!"
            }
        },
        {
            "content": "chung",
            "type": "adjective, noun",
            "example": {
                "en": "We have a lot more in common than you probably think we do.",
                "vi": "Chúng ta có những điểm chung nhiều hơn nhiều những gì bạn có thể nghĩ."
            }
        },
        {
            "content": "thông thường",
            "type": "adjective, noun",
            "example": {
                "en": "Even some of today’s most common medicines are derived from plants.",
                "vi": "Ngay cả vài thứ thuốc thông thường nhất ngày nay vẫn được chế từ thảo mộc."
            }
        },
        {
            "content": "bình thường",
            "type": "adjective",
            "example": {
                "en": "Don't treat me as common people.",
                "vi": "Đừng coi tôi như người \"bình thường\"!"
            }
        },
        {
            "content": "phổ biến",
            "type": "adjective, noun",
            "example": {
                "en": "Bechstein's bats are a common species of European bats.",
                "vi": "Bechstein là một loài dơi phổ biến thuộc họ dơi châu Âu."
            }
        },
        {
            "content": "công",
            "type": "adjective, noun",
            "example": {
                "en": "These successful couples have several things in common.",
                "vi": "Các cặp vợ chồng thành công này đều có chung vài điều."
            }
        },
        {
            "content": "cộng đồng",
            "type": "adjective",
            "example": {
                "en": "They gave us a stronger sense of community, of common cause.",
                "vi": "Chúng mang đến ý thức mạnh mẽ hơn về cộng đồng, về sự đoàn kết."
            }
        },
        {
            "content": "loàng xoàng",
            "type": "adjective",
            "example": {}
        },
        {
            "content": "thường thấy",
            "type": "adjective",
            "example": {
                "en": "This common practice will cause blood to run into your throat .",
                "vi": "Việc làm thường thấy này sẽ làm cho máu chảy vào cuống họng của bạn ."
            }
        },
        {
            "content": "phổ thông",
            "type": "adjective",
            "example": {
                "en": "Another common practice is to offer food and drink to the dead.",
                "vi": "Một phong tục phổ thông khác là dâng đồ ăn và thức uống cho người chết."
            }
        },
        {
            "content": "tập thể",
            "type": "adjective",
            "example": {
                "en": "Uh, we have a common room, we have dorm rooms.",
                "vi": "chúng tôi có phòng thường và phòng tập thể."
            }
        },
        {
            "content": "thông dụng",
            "type": "noun",
            "example": {
                "en": "In most places today, of course, salt is rather common and inexpensive.",
                "vi": "Dĩ nhiên, ngày nay tại nhiều nơi muối rất thông dụng và rẻ tiền."
            }
        },
        {
            "content": "tầm thường",
            "type": "",
            "example": {
                "en": "And after that elaborate plan, you were no more than a common thief.",
                "vi": "Sau vụ này, cuối cùng ông chỉ là tên trộm tầm thường."
            }
        },
        {
            "content": "thuờng",
            "type": "",
            "example": {}
        },
        {
            "content": "bình dân",
            "type": "noun",
            "example": {
                "en": "“But I never took something from the common man.",
                "vi": "Nhưng tôi không bao giờ ăn cắp cái gì của người bình dân."
            }
        },
        {
            "content": "công cộng",
            "type": "noun",
            "example": {
                "en": "The rule that the computer should be placed in a common area of the house still has merit.",
                "vi": "Lời khuyên nên đặt máy tính ở những khu vực công cộng trong nhà vẫn có hiệu quả."
            }
        },
        {
            "content": "của chung",
            "type": "",
            "example": {
                "en": "in a commons. They need to start sharing precompetitive research.",
                "vi": "thành của chung. Họ cần phải bắt đầu chia sẻ các nghiên cứu tiền cạnh tranh."
            }
        },
        {
            "content": "dân chúng",
            "type": "",
            "example": {
                "en": "The problem with us common types... is that we're light-fingered.",
                "vi": "Vấn đề với bọn bình dân chúng tôi là chúng tôi biết ăn cắp vặt."
            }
        },
        {
            "content": "những người bình dân",
            "type": "",
            "example": {}
        },
        {
            "content": "sự chung",
            "type": "",
            "example": {}
        },
        {
            "content": "thô tục",
            "type": "",
            "example": {
                "en": "Today, hurtful, vulgar speech has become very common, even in the home.",
                "vi": "Ngày nay, người ta rất thường nghe những lời nói thô tục và gây tổn thương, thậm chí trong gia đình."
            }
        },
        {
            "content": "thường gặp",
            "type": "adjective",
            "example": {
                "en": "Sensory issues are common among children with autism .",
                "vi": "Vấn đề giác quan là vấn đề thường gặp của trẻ bị tự kỷ ."
            }
        },
        {
            "content": "đất công",
            "type": "",
            "example": {
                "en": "The other major narrative of social dilemmas is the tragedy of the commons.",
                "vi": "Chuyện về tình thế khó xử trong xã hội là bi kịch của mảnh đất công."
            }
        }
    ]
}