{
    "word": "consider",
    "type": [
        "verb"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/kənˈsidər/",
            "/kənˈsɪdər/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/kənˈsɪdə/"
        ]
    },
    "meanings": [
        {
            "content": "suy xét",
            "type": "verb",
            "example": {
                "en": "Tonight I would like us to consider just some of those very characteristics.",
                "vi": "Buổi tối hôm nay tôi muốn chúng ta suy xét về một số đặc tính đó."
            }
        },
        {
            "content": "xem xét",
            "type": "",
            "example": {
                "en": "Paragraphs are short so that they can be considered right on the doorstep.",
                "vi": "Vì những đoạn của bài tương đối ngắn, nên có thể xem xét ngay trước cửa nhà."
            }
        },
        {
            "content": "xét",
            "type": "",
            "example": {
                "en": "Let us consider each segment of the map.",
                "vi": "Chúng ta hãy xem xét mỗi phần của tấm bản đồ."
            }
        },
        {
            "content": "nghĩ",
            "type": "verb",
            "example": {
                "en": "So you don't consider yourself a good person?",
                "vi": "Vậy cô không tự nghĩ mình là người tốt?"
            }
        },
        {
            "content": "coi như",
            "type": "",
            "example": {
                "en": "Art, music are considered therapy and mediums of expression.",
                "vi": "Nghệ thuật, âm nhạc được coi như liệu pháp và phương tiện bày tỏ tình cảm."
            }
        },
        {
            "content": "cân nhắc",
            "type": "",
            "example": {
                "en": "I'd like some time to consider before I make a decision.",
                "vi": "Tôi cần một ít thời gian cân nhắc trước khi tôi quyết định."
            }
        },
        {
            "content": "nghiệm",
            "type": "verb",
            "example": {
                "en": "One is that countless experiences I have had were not necessarily those one would consider extraordinary.",
                "vi": "Một là tôi đã có vô số các kinh nghiệm nhưng không nhất thiết phải là những kinh nghiệm được cho là phi thường."
            }
        },
        {
            "content": "chiểu",
            "type": "verb",
            "example": {}
        },
        {
            "content": "chiếu cố",
            "type": "verb",
            "example": {
                "en": "If you'd consider it, Kick-Ass, we'd be honored to have you join us.",
                "vi": "Nếu cậu chiếu cố, Kick-Ass, chúng tôi rất vinh dự kết nạp cậu."
            }
        },
        {
            "content": "chú ý đến cho rằng",
            "type": "",
            "example": {}
        },
        {
            "content": "có ý kiến là",
            "type": "",
            "example": {}
        },
        {
            "content": "cứu xét",
            "type": "verb",
            "example": {
                "en": "Nearly all legislation pertaining to abortion considers the duration of gestation.",
                "vi": "Hầu như mọi luật pháp về sự phá thai đều cứu xét thời kỳ mang thai."
            }
        },
        {
            "content": "lưu ý đến",
            "type": "",
            "example": {
                "en": "Ignoring such courtesies is considered rude.",
                "vi": "Không lưu ý đến những phép lịch sự như thế bị xem là vô lễ."
            }
        },
        {
            "content": "quan tâm đến",
            "type": "",
            "example": {
                "en": "Pop would have me committed for even considering this nonsense.",
                "vi": "Cha tôi không quan tâm đến những thứ vô nghĩa này."
            }
        },
        {
            "content": "soi xét",
            "type": "verb",
            "example": {}
        },
        {
            "content": "suy nghĩ",
            "type": "",
            "example": {
                "en": "I can't believe you'd even consider doing something like this.",
                "vi": "Anh còn không thể tin em lại suy nghĩ về làm một việc thế này nữa cơ."
            }
        },
        {
            "content": "trân trọng",
            "type": "verb",
            "example": {}
        },
        {
            "content": "xem như",
            "type": "",
            "example": {
                "en": "because my pregnancy was considered a preexisting condition.",
                "vi": "Bởi vì việc mang thai của tôi được xem như một điều kiện tồn tại trước."
            }
        },
        {
            "content": "để ý đến",
            "type": "",
            "example": {
                "en": "Do you consider the background and the daily activity of your listeners?",
                "vi": "Bạn có để ý đến gốc gác và sinh hoạt thường ngày của người nghe không?"
            }
        },
        {
            "content": "tưởng",
            "type": "verb",
            "example": {
                "en": "I consider myself a good judge of the men I trust, sir.",
                "vi": "Tôi tự cho là mình am hiểu những người tôi tin tưởng, sếp."
            }
        },
        {
            "content": "liệu",
            "type": "verb",
            "example": {
                "en": "Brothers are assigned to read material being considered at the Watchtower Study and at the Congregation Book Study.",
                "vi": "Các anh thì được giao nhiệm vụ đọc tài liệu học tại Buổi Học Tháp Canh và Buổi Học Cuốn Sách."
            }
        },
        {
            "content": "tính đến",
            "type": "",
            "example": {
                "en": "In your new life, would you consider seeking out your son?",
                "vi": "Trong cuộc đời mới, cô có tính đến tìm một đứa con trai không?"
            }
        }
    ]
}