{
    "word": "consistent",
    "type": [
        "adjective",
        "noun"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/kənˈsistənt/",
            "/kənˈsɪstənt/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/kənˈsɪst(ə)nt/"
        ]
    },
    "meanings": [
        {
            "content": "kiên định",
            "type": "adjective",
            "example": {
                "en": "It is the consistent parent who gains the trust of his child.",
                "vi": "Chính là người cha hay mẹ kiên định mới đạt được sự tin cậy của đứa con mình."
            }
        },
        {
            "content": "nhất quán",
            "type": "adjective",
            "example": {
                "en": "The pattern has been clear and consistent throughout the ages.",
                "vi": "Mẫu mực đều giản dị và nhất quán trong suốt các thời đại."
            }
        },
        {
            "content": "phù hợp",
            "type": "verb",
            "example": {
                "en": "You can't do science without making it logically consistent.",
                "vi": "Bạn không thể làm khoa học mà không làm cho mọi thứ phù hợp về mặt logic."
            }
        },
        {
            "content": "chắc",
            "type": "adjective",
            "example": {
                "en": "Has a little bit of consistency to it.",
                "vi": "Quả thận này có vẻ không được chắc lắm."
            }
        },
        {
            "content": "vững",
            "type": "",
            "example": {
                "en": "Children need definite boundaries, and consistency is essential.",
                "vi": "Cha mẹ cần đặt ra các giới hạn rõ ràng cho con và giữ vững các giới hạn đó."
            }
        },
        {
            "content": "đặc",
            "type": "adjective",
            "example": {
                "en": "The crema-rich espresso now oozes from the filter spout with the consistency of warm honey.",
                "vi": "Cà phê bắt đầu chảy ra, có nhiều bọt, đặc như dòng chảy của mật ong nóng."
            }
        },
        {
            "content": "phi mâu thuẫn",
            "type": "",
            "example": {}
        },
        {
            "content": "thích hợp",
            "type": "",
            "example": {
                "en": "Let's create a water system that's consistent with out environmental values.",
                "vi": "Hãy tạo hệ thống nước thích hợp với giá trị môi sinh."
            }
        },
        {
            "content": "trước sau như một",
            "type": "adjective",
            "example": {
                "en": "Instead of being critical, be empathetic and discerning in a loving, consistent way.",
                "vi": "Thay vì ưa chỉ trích, hãy tỏ ra thông cảm và suy xét trong tinh thần yêu thương và trước sau như một."
            }
        },
        {
            "content": "tính nhất quán",
            "type": "",
            "example": {
                "en": "He's starting to show consistency.",
                "vi": "Hắn bắt đầu thể hiện tính nhất quán."
            }
        }
    ]
}