{
    "word": "continuous",
    "type": [
        "adjective"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/kənˈtinyo͞oəs/",
            "/kənˈtɪnjuəs/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/kənˈtɪnjʊəs/"
        ]
    },
    "meanings": [
        {
            "content": "liên tục",
            "type": "adjective",
            "example": {
                "en": "And this is continuing and continuing and continuing.",
                "vi": "Và biến đổi cứ liên tục xảy ra."
            }
        },
        {
            "content": "liên tiếp",
            "type": "adjective",
            "example": {
                "en": "So the boy was not continuously harassed by the demon, only occasionally.",
                "vi": "Như vậy, đứa trẻ không liên tiếp bị quỉ ám, chỉ có lúc mà thôi."
            }
        },
        {
            "content": "liền",
            "type": "adjective",
            "example": {
                "en": "Past policy has made a forceful case for Thorn's continued adherence to electronics, to energy.",
                "vi": "Chính sách cũ đã buộc khiến cho Thorn bị buộc phải gắn liền với điện tử, với năng lượng."
            }
        },
        {
            "content": "duy trì",
            "type": "noun",
            "example": {
                "en": "I live to safeguard the continuity of this great society.",
                "vi": "Tôi sống để bảo vệ sự duy trì của xã hội vĩ đại này."
            }
        },
        {
            "content": "không dứt",
            "type": "",
            "example": {}
        },
        {
            "content": "không ngừng",
            "type": "",
            "example": {
                "en": "And even today, new volcanoes continue to sculpt our landscapes.",
                "vi": "Ngay cả lúc này, những ngọn núi lửa trẻ trung vẫn không ngừng trạm trổ trên bề mặt."
            }
        },
        {
            "content": "liên miên",
            "type": "adjective",
            "example": {
                "en": "They may seem to be stubborn or slow to learn and may continually try their parents.",
                "vi": "Chúng có thể ra vẻ ngoan cố hoặc chậm hiểu và có thể làm cha mẹ bực dọc liên miên."
            }
        },
        {
            "content": "tiến hành",
            "type": "",
            "example": {
                "en": "What basis are you continuing this operation on?",
                "vi": "Ông tiến hành chiến dịch này trên cơ sở nào?"
            }
        },
        {
            "content": "tiếp tục",
            "type": "adjective",
            "example": {
                "en": "I wonder when this program will continue till.",
                "vi": "Tôi tự hỏi khi nào chương trình này tiếp tục."
            }
        },
        {
            "content": "liên",
            "type": "verb noun",
            "example": {
                "en": "You continue to be paranoid and make us all paranoid.",
                "vi": "Cậu liên tục hoang tưởng khiến bọn này cũng phải hoang tưởng theo cậu."
            }
        },
        {
            "content": "không dừng",
            "type": "",
            "example": {
                "en": "you know they will continue to do to all like us.",
                "vi": "Chúng sẽ không dừng lại."
            }
        },
        {
            "content": "tiếp diễn",
            "type": "",
            "example": {
                "en": "If this continue any longer, the Minions would perish.",
                "vi": "Nếu chuyện này còn tiếp diễn thêm nữa, các Minion sẽ diệt vong."
            }
        }
    ]
}