{
    "word": "contemplate",
    "type": [
        "verb"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ˈkän(t)əmˌplāt/",
            "/ˈkɑn(t)əmˌpleɪt/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ˈkɒntɛmpleɪt/",
            "/ˈkɒntəmpleɪt/"
        ]
    },
    "meanings": [
        {
            "content": "ngắm",
            "type": "verb",
            "example": {
                "en": "There is no way anchoring south of here could even be contemplated, and Dr. Scott knows it.",
                "vi": "Không cách nào neo ở phía Nam dù ngắm cảnh, và Tiến sĩ Scott biết điều đó."
            }
        },
        {
            "content": "nghĩ",
            "type": "verb",
            "example": {
                "en": "So if we don't have children we should contemplate the idea of suicide?",
                "vi": "Vậy nếu ta không có con ta phải nghĩ đến việc tự sát sao?"
            }
        },
        {
            "content": "chiêm ngưỡng",
            "type": "",
            "example": {
                "en": "The time has come for all of us to contemplate our history.",
                "vi": "Đã tới lúc tất cả chúng ta chiêm ngưỡng lịch sử của chúng ta."
            }
        },
        {
            "content": "chờ đợi",
            "type": "",
            "example": {
                "en": "As we contemplate how well things worked out for them, we too will be encouraged to show a waiting attitude.",
                "vi": "Khi suy ngẫm về kết quả tốt đẹp họ nhận được, chúng ta cũng được khích lệ để kiên nhẫn chờ đợi."
            }
        },
        {
            "content": "dự tính",
            "type": "",
            "example": {
                "en": "Coincidentally, we were just contemplating a consolidation of our criminal enterprises.",
                "vi": "Thật trùng hợp, chúng tôi đang dự tính hợp nhất hai tập đoàn tội phạm của ta."
            }
        },
        {
            "content": "dự định",
            "type": "",
            "example": {
                "en": "“I became so overwhelmed with depression,” he recalls, “that I even contemplated suicide.”",
                "vi": "Anh nhớ lại: “Tôi trầm cảm đến nỗi dự định tự tử”."
            }
        },
        {
            "content": "liệu trước",
            "type": "",
            "example": {
                "en": "It is no easy thing for a great mind to contemplate a still greater one.",
                "vi": "Thật không dể dàng gì cho một bộ óc vĩ đại tiên liệu trước những việc thậm chí còn vĩ đại hơn."
            }
        },
        {
            "content": "lặng ngắm",
            "type": "",
            "example": {}
        },
        {
            "content": "thưởng ngoạn",
            "type": "",
            "example": {
                "en": "She is contemplating a trip.",
                "vi": "Cô ấy đang thưởng ngoạn chuyến đi chơi."
            }
        },
        {
            "content": "trầm ngâm",
            "type": "",
            "example": {
                "en": "He subsequently went inside a makeshift bunker, where he contemplated, pondered, and prayed.",
                "vi": "Rồi sau đó, ông đi vào bên trong một cái hầm tạm, nơi đó ông đã trầm ngâm, suy ngẫm và cầu nguyện."
            }
        },
        {
            "content": "suy ngẫm",
            "type": "",
            "example": {
                "en": "I have contemplated this account all my adult life.",
                "vi": "Tôi suy ngẫm câu chuyện này suốt cả quãng đời trưởng thành của mình."
            }
        }
    ]
}