{
    "word": "convenient",
    "type": [
        "adjective"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/kənˈvēnyənt/",
            "/kənˈvinjənt/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/kənˈviːnɪənt/"
        ]
    },
    "meanings": [
        {
            "content": "tiện lợi",
            "type": "adjective",
            "example": {
                "en": "While the Internet is a convenient venue for shopping , it may be a little too convenient .",
                "vi": "Internet là một địa điểm tiện lợi để mua sắm , có thể hơi quá tiện lợi ."
            }
        },
        {
            "content": "thuận tiện",
            "type": "adjective",
            "example": {
                "en": "These meetings are usually held in private homes or at other convenient places.",
                "vi": "Những buổi nhóm này thường được tổ chức tại nhà riêng hoặc những nơi thuận tiện khác."
            }
        },
        {
            "content": "tiện",
            "type": "adjective",
            "example": {
                "en": "Unfortunately, it isn't a convenient time for us. Do we really need to come right now?",
                "vi": "Giờ này thật sự là không tiện chút nào, chúng tôi có cần phải tới ngay không?"
            }
        },
        {
            "content": "thuận lợi",
            "type": "",
            "example": {
                "en": "There are many rest stops along the freeway for the convenience of travelers.",
                "vi": "Có nhiều điểm dừng dọc đường tạo sự thuận lợi cho khách du lịch."
            }
        },
        {
            "content": "dễ chịu",
            "type": "adjective",
            "example": {
                "en": "All right. Let's just all sell our souls and work for Satan'cause it's more convenient that way.",
                "vi": "Hãy bán linh hồn và làm việc cho Satan bởi vì như vậy còn dễ chịu hơn"
            }
        },
        {
            "content": "thích hợp",
            "type": "",
            "example": {
                "en": "Listen, I know I told you to call at your earliest convenience, but scratch that.",
                "vi": "anh biết anh đã bảo em gọi lại lúc thích hợp sớm nhất của em nhưng bỏ đi."
            }
        },
        {
            "content": "dễ",
            "type": "",
            "example": {
                "en": "Well, that's a very convenient philosophy for someone like yourself.",
                "vi": "Well, đó là triết lý dễ hiểu nhất cho những ai như anh."
            }
        },
        {
            "content": "dễ dàng",
            "type": "adjective",
            "example": {
                "en": "No, I think it's convenient that it's complicated.",
                "vi": "anh nghĩ những thứ dễ dàng thì mới phức tạp."
            }
        }
    ]
}