{
    "word": "crew",
    "type": [
        "verb",
        "noun"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/kro͞o/",
            "/kru/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/kruː/"
        ]
    },
    "meanings": [
        {
            "content": "bọn",
            "type": "noun",
            "example": {
                "en": "I don't think I can face those camera crews anymore.",
                "vi": "Chắc tớ không dám dòm bọn quay phim nữa đâu."
            }
        },
        {
            "content": "đám",
            "type": "noun",
            "example": {
                "en": "I'm gonna kill you and the rest of your crew.",
                "vi": "Tao sẽ giết mày và luôn cái đám kia luôn."
            }
        },
        {
            "content": "đội",
            "type": "noun",
            "example": {
                "en": "Tom and three other crew members were injured in the accident.",
                "vi": "Tom và ba thành viên khác của đội đã bị thương trong tai nạn."
            }
        },
        {
            "content": "ban",
            "type": "noun",
            "example": {}
        },
        {
            "content": "lũ",
            "type": "noun",
            "example": {
                "en": "And if memory serves, that cell belongs to members of your crew, no?",
                "vi": "Và tôi nhớ phòng đó là của lũ đệ tử của anh."
            }
        },
        {
            "content": "phi đội",
            "type": "",
            "example": {
                "en": "I lived in this dome for four months with a crew of six,",
                "vi": "Tôi sống trong nhà vòm này bốn tháng với phi đội sáu người,"
            }
        },
        {
            "content": "tụi",
            "type": "",
            "example": {
                "en": "We do, like, a rotating brunch thing every Sunday with, like, the whole crew.",
                "vi": "Chú nên gọi tụi này một tiếng, chúng ta... chúng ta sẽ quậy vào mỗi ngày chủ nhật nguyên một hội của chúng ta:"
            }
        },
        {
            "content": "ê kíp",
            "type": "noun",
            "example": {
                "en": "Albert goes in, I follow Albert, the crew is around.",
                "vi": "Albert bước vào, tôi theo sau, xung quanh là ê kíp."
            }
        },
        {
            "content": "ban nhóm",
            "type": "noun",
            "example": {}
        },
        {
            "content": "bè lũ",
            "type": "",
            "example": {
                "en": "You know that all of D.L.'s crew wore these.",
                "vi": "Mẹ biết rằng bè lũ của D.L. đều mang cái này."
            }
        },
        {
            "content": "phi hành đoàn",
            "type": "noun",
            "example": {
                "en": "Mr. Sulu, what is the crew complement of a bird of prey?",
                "vi": "Sulu, phi hành đoàn của một tầu chim mồi có bao nhiêu người?"
            }
        },
        {
            "content": "thủy thủ đoàn",
            "type": "noun",
            "example": {
                "en": "And that crew is trained to do it, with or without me.",
                "vi": "Và thủy thủ đoàn đó đã được huấn luyện để thực hiện chúng, dù có con hay không."
            }
        },
        {
            "content": "đoàn",
            "type": "noun",
            "example": {
                "en": "And mention was failed to be made of this uncanny crew.",
                "vi": "Nói đến bị thất bại khiến cho đoàn thủy thủ dại dột này."
            }
        },
        {
            "content": "nhóm",
            "type": "noun",
            "example": {
                "en": "If you're on this crew, you do exactly as I say.",
                "vi": "Nếu tham gia nhóm này thì mọi người làm đúng theo lời tôi."
            }
        }
    ]
}