{
    "word": "dedication",
    "type": [
        "noun"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ˌdedəˈkāSH(ə)n/",
            "/ˌdɛdəˈkeɪʃ(ə)n/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/dɛdɪˈkeɪʃ(ə)n/"
        ]
    },
    "meanings": [
        {
            "content": "hiến dâng",
            "type": "",
            "example": {
                "en": "The prayer that Solomon offered at the temple dedication emphasizes this truth.",
                "vi": "Lời cầu nguyện của Sa-lô-môn tại lễ hiến dâng đền thờ nhấn mạnh sự thật này."
            }
        },
        {
            "content": "lời đề tặng",
            "type": "",
            "example": {
                "en": "But there's a really nice dedication inside, with a quote from the book.",
                "vi": "và bên trong có lời đề tặng cùng với một đoạn của cuốn sách."
            }
        },
        {
            "content": "sự cống hiến",
            "type": "noun",
            "example": {
                "en": "All team members show a huge dedication towards reaching their goal.",
                "vi": "Tất cả thành viên có sự cống hiến rất lớn với việc tiến đến mục tiêu."
            }
        },
        {
            "content": "sự hiến dâng",
            "type": "",
            "example": {
                "en": "They used this reputation to hide the dedication to principles beyond those of even their strongest enemies.",
                "vi": "Họ đã sử dụng danh tiếng này để che dấu sự hiến dâng khỏi kẻ thù mạnh nhất của mình."
            }
        },
        {
            "content": "sự hy sinh",
            "type": "noun",
            "example": {
                "en": "We talked with the boys about sacrifice, about dedication to truth.",
                "vi": "Chúng tôi nói với các thiếu niên về sự hy sinh, về sự dâng hiến cho lẽ thật."
            }
        },
        {
            "content": "sự tận tâm",
            "type": "",
            "example": {
                "en": "These sisters gave me strength, love, and dedication.",
                "vi": "Các chị em phụ nữ này đã mang đến sức mạnh, tình yêu thương và sự tận tâm."
            }
        },
        {
            "content": "sự tận tụy",
            "type": "",
            "example": {
                "en": "The crew has responded with the dedication I've come to expect.",
                "vi": "Phi hành đoàn đã đáp ứng nhiệm vụ với sự tận tụy mà tôi mong chờ ở họ."
            }
        }
    ]
}