{
    "word": "delight",
    "type": [
        "verb",
        "noun"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/dəˈlīt/",
            "/dəˈlaɪt/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/dɪˈlʌɪt/"
        ]
    },
    "meanings": [
        {
            "content": "làm vui thích",
            "type": "",
            "example": {
                "en": "Truly happy are those who take delight in manifesting brotherly affection!",
                "vi": "Thật hạnh phúc thay cho những ai lấy làm vui thích trong việc biểu lộ tình yêu mến anh em!"
            }
        },
        {
            "content": "sự vui sướng",
            "type": "noun",
            "example": {
                "en": "the cute doggie popped out, and she squealed with delight.",
                "vi": "chú chó dễ thương hiện ra, và cô hét lên trong sự vui sướng."
            }
        },
        {
            "content": "thích thú",
            "type": "",
            "example": {
                "en": "Yeah, you surprise and delight me sometimes, you know that?",
                "vi": "Thỉnh thoảng em cũng biết làm anh bất ngờ và thích thú đấy, biết không?"
            }
        },
        {
            "content": "gây khoái cảm",
            "type": "",
            "example": {}
        },
        {
            "content": "ham thích",
            "type": "",
            "example": {
                "en": "We take no delight in suffering and derive no pleasure from pain or humiliation.",
                "vi": "Chúng ta không ham thích sự đau khổ và không thấy có gì thú vị trong sự đau đớn hoặc bị làm nhục."
            }
        },
        {
            "content": "hân hoan",
            "type": "",
            "example": {
                "en": "Brethren, I am delighted to be with you this evening.",
                "vi": "Thưa các anh em, tôi hân hoan được hiện diện với các anh em buổi tối nay."
            }
        },
        {
            "content": "khoái lạc",
            "type": "noun",
            "example": {
                "en": "Maybe you want to bring your boy toy over for some afternoon delight?",
                "vi": "Mày dẫn ghệ đực của mày tới để làm một buổi chiều khoái lạc hả?"
            }
        },
        {
            "content": "làm say mê",
            "type": "",
            "example": {}
        },
        {
            "content": "làm vui sướng",
            "type": "",
            "example": {}
        },
        {
            "content": "lạc thú",
            "type": "noun",
            "example": {
                "en": "This is an expensive delight.",
                "vi": "Đó là một lạc thú mắc tiền."
            }
        },
        {
            "content": "niềm khoái cảm",
            "type": "",
            "example": {
                "en": "Only the most privileged tongues whisper of the delights offered within these walls.",
                "vi": "Chỉ những cái lưỡi có đặc quyền nhất thầm thì về niềm khoái cảm đem lại bên trong những bức tường này."
            }
        },
        {
            "content": "sự thích thú",
            "type": "noun",
            "example": {
                "en": "Now I can feel a sensation of delight and beauty",
                "vi": "Giờ tôi có thể cảm nhận sự thích thú và nét đẹp"
            }
        },
        {
            "content": "sự vui thích",
            "type": "noun",
            "example": {
                "en": "But the delight will go far beyond that.",
                "vi": "Nhưng sự vui thích sẽ vượt xa hơn thế."
            }
        },
        {
            "content": "điều thích thú",
            "type": "",
            "example": {
                "en": "Preaching in this territory continues to be delightful.",
                "vi": "Rao giảng ở khu vực này vẫn là điều thích thú."
            }
        }
    ]
}