{
    "word": "determine",
    "type": [
        "verb"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/dəˈtərmən/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/dɪˈtəːmɪn/"
        ]
    },
    "meanings": [
        {
            "content": "quyết định",
            "type": "verb",
            "example": {
                "en": "It determines who gets to determine the rules of the game.",
                "vi": "Nó quyết định ai là người có quyền quyết định luật của cuộc chơi."
            }
        },
        {
            "content": "xác định",
            "type": "adjective verb",
            "example": {
                "en": "Publishers should use good judgment to determine the individual’s interest.",
                "vi": "Người công bố nên suy xét để xác định một người có chú ý hay không."
            }
        },
        {
            "content": "định đoạt",
            "type": "",
            "example": {
                "en": "We made a decision that has determined our destiny,” he said.",
                "vi": "Chúng tôi chọn quyết định mà đã định đoạt số mệnh của mình,” ông nói như vậy."
            }
        },
        {
            "content": "quyết",
            "type": "verb",
            "example": {
                "en": "You seem quite determined to find the little wolf.",
                "vi": "Hình như anh rất quyết tâm tìm cho ra cô sói nhỏ thì phải."
            }
        },
        {
            "content": "định",
            "type": "verb",
            "example": {
                "en": "We can determine to forgive quickly and fully.",
                "vi": "Chúng ta có thể quyết định tha thứ một cách nhanh chóng và hoàn toàn."
            }
        },
        {
            "content": "giới hạn",
            "type": "",
            "example": {
                "en": "But how can you determine what a safe limit is for you?",
                "vi": "Nhưng làm thế nào bạn có thể xác định một giới hạn an toàn cho mình?"
            }
        },
        {
            "content": "hoạch định",
            "type": "verb",
            "example": {
                "en": "They have planned a route and determined how they will work together.",
                "vi": "Họ đã hoạch định một lộ trình và quyết định cách thức sẽ cùng nhau làm việc."
            }
        },
        {
            "content": "kiên quyết",
            "type": "",
            "example": {
                "en": "Why are you so determined to be alone?",
                "vi": "Sao anh cứ kiên quyết ở một mình thế?"
            }
        },
        {
            "content": "kết thúc",
            "type": "noun",
            "example": {
                "en": "How you answer it will determine how this night ends.",
                "vi": "Cách ông trả lời sẽ quyết định đêm nay kết thúc thế nào."
            }
        },
        {
            "content": "làm cho quyết định",
            "type": "",
            "example": {}
        },
        {
            "content": "làm mãn hạn",
            "type": "",
            "example": {}
        },
        {
            "content": "nhất định",
            "type": "verb",
            "example": {
                "en": "And I am bound and determined to conquer it.",
                "vi": "Và tôi nhất định và kiên quyết chinh phục nó"
            }
        },
        {
            "content": "quyết tâm",
            "type": "Động từ",
            "example": {
                "en": "I am determined to do something about this.",
                "vi": "Tôi quyết tâm phải làm gì đó về vấn đề này."
            }
        },
        {
            "content": "định rõ",
            "type": "",
            "example": {
                "en": "My task was to determine what was true.",
                "vi": "Nhiệm vụ của tôi là phải định rõ sự thật là gì."
            }
        }
    ]
}