{
    "word": "develop",
    "type": [
        "verb"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/dəˈveləp/",
            "/dəˈvɛləp/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/dɪˈvɛləp/"
        ]
    },
    "meanings": [
        {
            "content": "phát triển",
            "type": "verb noun",
            "example": {
                "en": "Why didn't modern technology develop in China?",
                "vi": "Tại sao công nghệ hiện đại lại không phát triển ở Trung Quốc?"
            }
        },
        {
            "content": "khai triển",
            "type": "verb",
            "example": {
                "en": "All of these themes require development along completely different lines.",
                "vi": "Tất cả những chủ đề này đòi hỏi phải khai triển hoàn toàn khác nhau."
            }
        },
        {
            "content": "mở mang",
            "type": "verb",
            "example": {
                "en": "I feel that I have received the finest possible education, one that has helped me to develop both spiritually and intellectually.",
                "vi": "Tôi thấy mình nhận được sự giáo dục tốt nhất, nhờ đó tôi vừa mạnh mẽ hơn về thiêng liêng vừa mở mang kiến thức."
            }
        },
        {
            "content": "rửa",
            "type": "verb",
            "example": {
                "en": "Get that stuff developed, will you?",
                "vi": "Dùm rửa mấy cái này."
            }
        },
        {
            "content": "mở rộng",
            "type": "",
            "example": {
                "en": "Could you benefit from developing a broader point of view?",
                "vi": "Việc mở rộng tầm nhìn có lợi cho bạn không?"
            }
        },
        {
            "content": "mở",
            "type": "verb",
            "example": {
                "en": "It would if she developed meningitis.",
                "vi": "Có nếu cô ấy bị viêm màng não mở rộng."
            }
        },
        {
            "content": "nhiễm",
            "type": "verb",
            "example": {
                "en": "He's the one you'll be suing when you develop sepsis.",
                "vi": "Anh ta là người mà cô sẽ đi kiện nếu mình bị nhiễm trùng."
            }
        },
        {
            "content": "rửa ảnh",
            "type": "",
            "example": {
                "en": "To pull black letters from a white background all you need is developing fluid.",
                "vi": "Để phần chữ đen hiện lên trên phông nền trắng của giấy ta chỉ cần dung dịch rửa ảnh thôi."
            }
        },
        {
            "content": "hiện",
            "type": "verb",
            "example": {
                "en": "Why didn't modern technology develop in China?",
                "vi": "Tại sao công nghệ hiện đại lại không phát triển ở Trung Quốc?"
            }
        },
        {
            "content": "nổi",
            "type": "verb",
            "example": {
                "en": "If we do, we too may find that we develop a reputation for excellence.",
                "vi": "Khi làm thế, có thể chúng ta cũng sẽ tạo được danh tiếng nổi trội."
            }
        },
        {
            "content": "biến diễn",
            "type": "",
            "example": {}
        },
        {
            "content": "biểu lộ ra",
            "type": "",
            "example": {}
        },
        {
            "content": "bày tỏ",
            "type": "",
            "example": {
                "en": "So we show our love for our fellow man by developing a respectful and cooperative spirit.",
                "vi": "Vì thế, chúng ta bày tỏ tình yêu thương với người đồng loại bằng cách phát huy tinh thần tôn trọng và hợp tác."
            }
        },
        {
            "content": "bộc lộ ra",
            "type": "",
            "example": {
                "en": "He may allow situations to develop that reveal our true motives and heart condition.",
                "vi": "Ngài có thể để cho những tình huống phát triển khiến động cơ và lòng của chúng ta bộc lộ ra."
            }
        },
        {
            "content": "khai sơn",
            "type": "",
            "example": {}
        },
        {
            "content": "khai thác",
            "type": "",
            "example": {
                "en": "still to be developed and produced in the world today.",
                "vi": "vẫn còn có thể được khai thác và sản xuất trên thế giới."
            }
        },
        {
            "content": "khuếch trương",
            "type": "",
            "example": {}
        },
        {
            "content": "làm cho phát đạt",
            "type": "",
            "example": {}
        },
        {
            "content": "ngày càng phát huy",
            "type": "",
            "example": {}
        },
        {
            "content": "nảy nở",
            "type": "",
            "example": {
                "en": "The person may allow a wrong desire to develop in his heart.",
                "vi": "Một người có thể để sự ham muốn sai quấy nảy nở trong lòng."
            }
        },
        {
            "content": "nảy sinh",
            "type": "",
            "example": {
                "en": "Sometimes, I've heard, even brothers and sisters develop certain affections.",
                "vi": "Tôi có nghe nói đôi lúc giữa anh chị em cũng nảy sinh những tình cảm nhất định."
            }
        },
        {
            "content": "phát dục",
            "type": "",
            "example": {}
        },
        {
            "content": "phát đạt",
            "type": "verb",
            "example": {}
        },
        {
            "content": "thuyết minh",
            "type": "",
            "example": {}
        },
        {
            "content": "tiêm nhiễm",
            "type": "",
            "example": {
                "en": "Did you know she's developed something of a substance abuse problem since you've been gone?",
                "vi": "Anh có biết cô ta bị tiêm nhiễm vài thứ liên quan đến lạm dụng thuốc kể từ khi anh đi?"
            }
        },
        {
            "content": "tiến triển",
            "type": "",
            "example": {
                "en": "You know, the patient is prime age to develop spontaneous schizophrenia.",
                "vi": "Anh biết là ở tuổi tầm bệnh nhân thì bắt đầu tiến triển bệnh tâm thần phân liệt."
            }
        },
        {
            "content": "triển khai",
            "type": "",
            "example": {
                "en": "He developed an interesting outsourcing model for sexual services,",
                "vi": "Anh ta đã triển khai một mô hình outsource thú vị cho các dịch vụ tình dục,"
            }
        },
        {
            "content": "trình bày",
            "type": "",
            "example": {
                "en": "New developments in that ongoing sanitation strike to tell you about.",
                "vi": "Chúng tôi sẽ trình bày về việc cải thiện điều kiện vệ sinh trong chương trình phát triển mới."
            }
        },
        {
            "content": "tỏ rõ ra",
            "type": "",
            "example": {}
        },
        {
            "content": "xuất hiện",
            "type": "",
            "example": {
                "en": "They live in the emerging megacities of the developing world.",
                "vi": "Họ sống trong các siêu đô thị mới xuất hiện ở các nước đang phát triển."
            }
        },
        {
            "content": "hình thành",
            "type": "",
            "example": {
                "en": "I love to see how each child’s personality is developing.",
                "vi": "Tôi rất vui được nhìn thấy sự hình thành nhân cách của mỗi đứa con."
            }
        },
        {
            "content": "trưởng thành",
            "type": "",
            "example": {
                "en": "They got older. We all develop over time.",
                "vi": "Chúng lớn hơn. Chúng ta đều trưởng thành qua thời gian."
            }
        }
    ]
}