{
    "word": "direction",
    "type": [
        "noun"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/dəˈrekSH(ə)n/",
            "/dəˈrɛkʃ(ə)n/",
            "/dīˈrekSH(ə)n/",
            "/daɪˈrɛkʃ(ə)n/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/dɪˈrɛkʃ(ə)n/",
            "/dʌɪˈrɛkʃ(ə)n/"
        ]
    },
    "meanings": [
        {
            "content": "hướng",
            "type": "noun",
            "example": {
                "en": "We began to sail in the direction of the port.",
                "vi": "Chúng tôi bắt đầu lái thuyền về hướng cảng."
            }
        },
        {
            "content": "phương hướng",
            "type": "noun",
            "example": {
                "en": "Are you happy with the general direction of the country?",
                "vi": "Anh có hài lòng với phương hướng chung của đất nước không?"
            }
        },
        {
            "content": "chiều",
            "type": "noun",
            "example": {
                "en": "Shave in the direction the hair grows , not against it .",
                "vi": "Cạo theo chiều râu mọc , đừng cạo ngược lại ."
            }
        },
        {
            "content": "phương",
            "type": "noun",
            "example": {
                "en": "And that's the direct result of eating a Western diet.",
                "vi": "Và đó chính là kết quả trực tiếp của chế độ ăn phương Tây."
            }
        },
        {
            "content": "phía",
            "type": "noun",
            "example": {
                "en": "This gives you a straight direction south on the freeway.",
                "vi": "Từ đây anh có thể chạy thẳng về phía nam hướng ra cao tốc."
            }
        },
        {
            "content": "ngả",
            "type": "noun",
            "example": {
                "en": "Then we quickly left the store and ran off in separate directions.",
                "vi": "Rồi chúng tôi nhanh chóng rời cửa tiệm và chạy mỗi đứa một ngả."
            }
        },
        {
            "content": "方向",
            "type": "",
            "example": {}
        },
        {
            "content": "lời hướng dẫn",
            "type": "",
            "example": {
                "en": "They came listening to the direction of the Lord’s chosen leaders.",
                "vi": "Họ đến để lắng nghe lời hướng dẫn của các vị lãnh đạo đã được Chúa chọn."
            }
        },
        {
            "content": "sự chỉ đạo",
            "type": "noun",
            "example": {
                "en": "because they were all elaborately art-directed,",
                "vi": "vì chúng có sự chỉ đạo nghệ thuật rất tỉ mỉ,"
            }
        },
        {
            "content": "sự hướng dẫn",
            "type": "noun",
            "example": {
                "en": "What direction is there in God’s Word concerning the education of children?",
                "vi": "Lời Đức Chúa Trời cung cấp sự hướng dẫn nào về việc dạy dỗ con cái?"
            }
        },
        {
            "content": "sự lãnh đạo",
            "type": "noun",
            "example": {
                "en": "McMullin—for their excellent leadership in directing the work of updating and restoring the Salt Lake Tabernacle.",
                "vi": "McMullin—về sự lãnh đạo xuất sắc của họ trong việc hướng dẫn công việc hiện đại hóa và sửa chữa Đại Thính Đường Salt Lake."
            }
        },
        {
            "content": "đường hướng",
            "type": "noun",
            "example": {
                "en": "I just can't have any doubt about the direction I'm taking.",
                "vi": "Tôi không muốn có sự nghi ngờ về đường hướng mà tôi sẽ đi."
            }
        },
        {
            "content": "nẻo",
            "type": "noun",
            "example": {
                "en": "At night, Tyler and I were alone for half a mile in every direction.",
                "vi": "Đến đêm, Tyler và tôi luôn ở một mình trong vòng nửa dặm khắp các nẻo đường."
            }
        },
        {
            "content": "directorate",
            "type": "",
            "example": {}
        },
        {
            "content": "đằng",
            "type": "noun",
            "example": {
                "en": "But who was behind that direction?",
                "vi": "Nhưng ai đứng đằng sau chỉ dẫn này?"
            }
        },
        {
            "content": "mặt",
            "type": "noun",
            "example": {
                "en": "What kills these things, aside from direct sunlight?",
                "vi": "Thứ gì giết chết được bọn chúng, ngoài ánh sáng mặt trời ra?"
            }
        },
        {
            "content": "chỉ thị",
            "type": "",
            "example": {
                "en": "He has given clear directives about how we should behave.",
                "vi": "Ngài đã đưa ra những chỉ thị rõ ràng về cách chúng ta nên xử sự."
            }
        },
        {
            "content": "huấn thị",
            "type": "",
            "example": {}
        },
        {
            "content": "lời chỉ bảo",
            "type": "",
            "example": {}
        },
        {
            "content": "phương diện",
            "type": "",
            "example": {
                "en": "This “if-then” format can also be seen in the direction of individual lives, as well as families and whole nations.",
                "vi": "Dạng “nếu-thì” này cũng có thể được thấy trong phương diện của cuộc sống cá nhân, cũng như gia đình và toàn thể quốc gia."
            }
        },
        {
            "content": "sự cai quản",
            "type": "",
            "example": {}
        },
        {
            "content": "sự chỉ huy",
            "type": "",
            "example": {}
        },
        {
            "content": "sự điều khiển",
            "type": "",
            "example": {
                "en": "Two fine veterinary surgeons under my direction were able to save his life.",
                "vi": "Hai nhà phẫu phuật thú y dưới sự điều khiển của tôi đã cứu được mạng của nó."
            }
        },
        {
            "content": "địa chỉ",
            "type": "noun",
            "example": {
                "en": "I have sent directions to my living space.",
                "vi": "Tôi đã gửi cho cậu địa chỉ nơi ở của tôi rồi."
            }
        },
        {
            "content": "chỉ dẫn",
            "type": "",
            "example": {
                "en": "Why can it be difficult to follow direction?",
                "vi": "Tại sao có thể chúng ta thấy khó để làm theo sự chỉ dẫn?"
            }
        },
        {
            "content": "hướng dẫn",
            "type": "",
            "example": {
                "en": "He directs and blesses this work, and He watches over and guides us.",
                "vi": "Ngài hướng dẫn và ban phước cho công việc này, và Ngài trông chừng và hướng dẫn chúng ta."
            }
        }
    ]
}