{
    "word": "distinct",
    "type": [
        "adjective"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/dəˈstiNG(k)t/",
            "/dəˈstɪŋ(k)t/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/dɪˈstɪŋ(k)t/"
        ]
    },
    "meanings": [
        {
            "content": "riêng biệt",
            "type": "adjective",
            "example": {
                "en": "Like diamonds, all of us have our own distinct qualities.",
                "vi": "Giống như những hạt kim cương, tất cả chúng ta đều có những đức tính riêng biệt."
            }
        },
        {
            "content": "khác biệt",
            "type": "adjective",
            "example": {
                "en": "The distinction between types of pancreatic cancer is an important one .",
                "vi": "Sự khác biệt giữa hai loại ung thư tuyến tụy là một sự khác biệt quan trọng ."
            }
        },
        {
            "content": "riêng",
            "type": "",
            "example": {
                "en": "She likes to preserve the distinction of rank.",
                "vi": "Bà thích mọi người giữ bản sắc riêng của giai cấp họ."
            }
        },
        {
            "content": "riêng rẽ",
            "type": "adjective",
            "example": {
                "en": "In the Godhead there are three separate and distinct personages.",
                "vi": "CÓ ba Đấng riêng rẽ và riêng biệt trong Thiên Chù Đoàn"
            }
        },
        {
            "content": "dễ nhận",
            "type": "",
            "example": {
                "en": "Jessica had a distinct skill: she knew how to swim against a rip current.",
                "vi": "Jessica có một kỹ năng dễ nhận thấy: chị ấy biết cách bơi chống lại dòng nước xoáy."
            }
        },
        {
            "content": "dễ thấy",
            "type": "",
            "example": {
                "en": "There's a distinct possibility.",
                "vi": "Phải, đúng vậy. Một khả năng dễ thấy."
            }
        },
        {
            "content": "dứt khoát",
            "type": "",
            "example": {}
        },
        {
            "content": "nhất định",
            "type": "adjective",
            "example": {
                "en": "If you've got a distinct disorder with a distinct cause,",
                "vi": "Nếu bạn có một chứng bệnh với một nguyên nhân nhất định"
            }
        },
        {
            "content": "rõ ràng",
            "type": "noun",
            "example": {
                "en": "Let us consider nine distinct ways that may be open to us.",
                "vi": "Chúng ta hãy xem xét chín cách rõ ràng mà chúng ta có thể làm được."
            }
        },
        {
            "content": "rõ rệt",
            "type": "adjective",
            "example": {
                "en": "Still others develop distinct baldness at the crown of the head .",
                "vi": "Tuy nhiên những người khác lại bị hói rõ rệt ở đỉnh đầu ."
            }
        },
        {
            "content": "dễ nhận thấy",
            "type": "noun",
            "example": {
                "en": "And the third thing about intelligence is, it's distinct.",
                "vi": "Và điều thứ ba về trí thông minh là, Nó rất dễ nhận thấy."
            }
        }
    ]
}