{
    "word": "efficiency",
    "type": [
        "noun"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/əˈfiSHənsē/",
            "/əˈfɪʃənsi/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ɪˈfɪʃ(ə)nsi/"
        ]
    },
    "meanings": [
        {
            "content": "hiệu quả",
            "type": "noun",
            "example": {
                "en": "How did this homeless man learn to kill so efficiently?",
                "vi": "Làm sao tên vô gia cư này học được cách giết người hiệu quả?"
            }
        },
        {
            "content": "năng lực",
            "type": "noun",
            "example": {
                "en": "What is it that makes you so efficient, Sergeant?",
                "vi": "Cái gì làm cho anh có nhiều năng lực vậy, Trung sĩ?"
            }
        },
        {
            "content": "hiệu lực",
            "type": "noun",
            "example": {}
        },
        {
            "content": "hiệu suất",
            "type": "noun",
            "example": {
                "en": "So what he's talking about here is shared production, and efficiency is the name of the game.",
                "vi": "Cái được nói tới là sản xuất chia nhỏ, và hiệu suất là điều quan trọng nhất."
            }
        },
        {
            "content": "sự hiệu quả",
            "type": "noun",
            "example": {
                "en": "So the question is, how is the brain able to achieve this kind of efficiency?",
                "vi": "Câu hỏi là làm thế nào mà bộ não có thể đạt được sự hiệu quả đó"
            }
        },
        {
            "content": "tính hiệu quả",
            "type": "",
            "example": {
                "en": "Perhaps we live in a world fabricated for efficiency.",
                "vi": "Có lẽ ta sống trong một thế giới bị tính hiệu quả làm cho phức tạp."
            }
        },
        {
            "content": "hiệu năng",
            "type": "noun",
            "example": {
                "en": "So imagine if we can help enhance their efficiency",
                "vi": "Hãy tưởng tượng, liệu chúng ta có thể nâng hiệu năng của họ"
            }
        },
        {
            "content": "khả năng",
            "type": "noun",
            "example": {
                "en": "By the rote mastery of this art, your firing efficiency will rise by no less than 120%.",
                "vi": "Khi làm chủ được kỹ thuật này khả năng bắn súng sẽ tăng không ít hơn 120%."
            }
        },
        {
            "content": "năng suất",
            "type": "noun",
            "example": {
                "en": "And it actually causes your car to charge safely and efficiently.",
                "vi": "Và nó sạc điện cho xe của bạn một cách an toàn và năng suất."
            }
        },
        {
            "content": "sản lượng",
            "type": "",
            "example": {
                "en": "but our production system efficiency is actually declining.",
                "vi": "thế nhưng hiệu suất sản lượng thật sự lại đi xuống."
            }
        },
        {
            "content": "tài năng",
            "type": "noun",
            "example": {
                "en": "How efficient of you.",
                "vi": "Ông quả là tài năng!"
            }
        }
    ]
}