{
    "word": "employ",
    "type": [
        "verb",
        "noun"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/əmˈploi/",
            "/əmˈplɔɪ/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ɪmˈplɔɪ/",
            "/ɛmˈplɔɪ/"
        ]
    },
    "meanings": [
        {
            "content": "dùng",
            "type": "verb",
            "example": {
                "en": "You see how Themistokles employs deception with such grace?",
                "vi": "Ngươi thấy cách Themistokles dùng nghi binh uyển chuyển đến thế không?"
            }
        },
        {
            "content": "thuê",
            "type": "",
            "example": {
                "en": "Consequently, he will no longer be employed here winding the clocks.",
                "vi": "Bởi vậy, ông ta sẽ không được thuê để bảo dưỡng đồng hồ ở đây nữa."
            }
        },
        {
            "content": "dụng",
            "type": "verb",
            "example": {
                "en": "If war does break out, they'll be the only ones gainfully employed.",
                "vi": "Nếu thực sự nổ ra chiến tranh, chúng là thứ duy nhất hữu dụng."
            }
        },
        {
            "content": "công việc",
            "type": "noun",
            "example": {
                "en": "It is also employed to make ‘yes or no’ decisions on daily matters.",
                "vi": "Người ta cũng dùng cách này để quyết định ‘nên hay không nên’ làm các công việc hằng ngày."
            }
        },
        {
            "content": "dĩ",
            "type": "verb",
            "example": {}
        },
        {
            "content": "tận dụng",
            "type": "",
            "example": {
                "en": "They employ techniques and equipment that are tried and proven.",
                "vi": "Họ tận dụng những kỹ thuật và đồ trang bị mà đã được thử nghiệm và chứng minh."
            }
        },
        {
            "content": "sử dụng",
            "type": "verb",
            "example": {
                "en": "In 2008, detailed bone analysis suggested these dinosaurs employed a system of air sacs.",
                "vi": "Năm 2008, phân tích xương cho thấy loài khủng long này sử dụng một hệ thống túi khí."
            }
        },
        {
            "content": "sự dùng",
            "type": "",
            "example": {}
        },
        {
            "content": "việc làm",
            "type": "noun",
            "example": {
                "en": "You will see no trickery, for no trickery is employed.",
                "vi": "Bạn sẽ không thấy trò lừa nào cả. Vì không lừa là không có việc làm."
            }
        },
        {
            "content": "tuyển dụng",
            "type": "",
            "example": {
                "en": "She runs a successful web development company and employs several people.",
                "vi": "Cô ấy điều hành thành công một công ty phát triển mạng và tuyển dụng nhiều nhân viên."
            }
        }
    ]
}