{
    "word": "estate",
    "type": [
        "noun"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/iˈstāt/",
            "/ɪˈsteɪt/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ɪˈsteɪt/",
            "/ɛˈsteɪt/"
        ]
    },
    "meanings": [
        {
            "content": "tài sản",
            "type": "noun",
            "example": {
                "en": "Well, the unfortunate demise of your husband has left you quite a sizable estate.",
                "vi": "Cái chết bất hạnh của cồng bà đã để lại cho bà một tài sản to lớn."
            }
        },
        {
            "content": "bất động sản",
            "type": "noun",
            "example": {
                "en": "I agree with the opinion that real estate is overpriced.",
                "vi": "Tôi đồng ý với ý kiến rằng bất động sản bị định giá quá cao."
            }
        },
        {
            "content": "di sản",
            "type": "noun",
            "example": {
                "en": "I'm just coming back to settle my brother's estate.",
                "vi": "Tôi chỉ quay về đây để giải quyết di sản của anh tôi."
            }
        },
        {
            "content": "quyền sở hữu",
            "type": "",
            "example": {}
        },
        {
            "content": "gia sản",
            "type": "noun",
            "example": {
                "en": "It's a drop in the bucket from your estate.",
                "vi": "Chỉ là muối bỏ biển so với gia sản của cô."
            }
        },
        {
            "content": "hoàn cảnh",
            "type": "noun",
            "example": {}
        },
        {
            "content": "sản nghiệp",
            "type": "noun",
            "example": {
                "en": "In a sense, they also divided spoil, in that Haman’s vast estate went to them.",
                "vi": "Theo một nghĩa nào đó, họ cũng “phân chia mồi cướp được”, đó là sản nghiệp to lớn của Ha-man mà họ nhận."
            }
        },
        {
            "content": "tình trạng",
            "type": "",
            "example": {
                "en": "They returned to their spiritual estate with great rejoicing—rejoicing that has continued down until today.",
                "vi": "Họ được phục hồi tình trạng thiêng liêng với sự vui mừng lớn—sự vui mừng mà đến nay vẫn còn."
            }
        },
        {
            "content": "đẳng cấp",
            "type": "",
            "example": {
                "en": "Well, it's common for people in the first estate to leave a trust for any potential recurrence.",
                "vi": "Thông thường những người thuộc đẳng cấp thứ nhất tin tưởng vào tiềm năng tái diễn của họ."
            }
        },
        {
            "content": "điền trang",
            "type": "",
            "example": {
                "en": "You mean that Hindley has sold you the estate?",
                "vi": "Anh muốn nói là Hindley đã bán điền trang cho anh?"
            }
        }
    ]
}