{
    "word": "excellent",
    "type": [
        "adjective",
        "adverb",
        "noun"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ˈeks(ə)lənt/",
            "/ˈɛks(ə)lənt/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ˈɛks(ə)l(ə)nt/"
        ]
    },
    "meanings": [
        {
            "content": "xuất sắc",
            "type": "adjective",
            "example": {
                "en": "Work of superior quality, meeting high standards of precision and excellence, is in demand.",
                "vi": "Người ta chuộng việc làm phải có chất lượng cao, đạt tiêu chuẩn chính xác và xuất sắc."
            }
        },
        {
            "content": "tuyệt vời",
            "type": "adjective",
            "example": {
                "en": "Many people have found the diminutive Chihuahua to be an excellent companion.",
                "vi": "Nhiều người nhận thấy chú chó Chihuahua bé tí này là một người bạn tuyệt vời."
            }
        },
        {
            "content": "tuyệt",
            "type": "adjective",
            "example": {
                "en": "But my beloved husband's death will prove an excellent motivator.",
                "vi": "Nhưng cái chết của người chồng yêu quý của tôi sẽ chứng tỏ một động lực tuyệt vời."
            }
        },
        {
            "content": "ưu",
            "type": "",
            "example": {
                "en": "We're a beacon of excellence in a sea of mediocrity.",
                "vi": "Mình là một ngọn đèn hiệu ưu việt trong một đại dương tầm thường."
            }
        },
        {
            "content": "rất tốt",
            "type": "adjective",
            "example": {
                "en": "Some excel at this, including many with little if any secular schooling.",
                "vi": "Một số người có trí nhớ rất tốt, kể cả nhiều người có trình độ học vấn thấp."
            }
        },
        {
            "content": "ưu tú",
            "type": "",
            "example": {
                "en": "He is an excellent example of one who follows the Savior.",
                "vi": "Ông là một tấm gương ưu tú của một người noi theo Đấng Cứu Rỗi."
            }
        },
        {
            "content": "hoàn hảo",
            "type": "adjective",
            "example": {
                "en": "You'd be an excellent addition to the team, claire.",
                "vi": "Cháu sẽ là một thành phần hoàn hảo cho cuộc nghiên cứu, Claire."
            }
        },
        {
            "content": "hoàn thiện",
            "type": "adjective",
            "example": {
                "en": "It is this, I say, which leads on and helps towards moral excellence and towards happiness. . . .",
                "vi": "Theo tôi, đây là điều không những giúp mà còn dẫn đến sự hoàn thiện về đạo đức và cả hạnh phúc nữa. . ."
            }
        },
        {
            "content": "tuyệt diệu",
            "type": "adjective",
            "example": {
                "en": "Plus, there's excellent light in the afternoon.",
                "vi": "Hơn nữa, ở đó có ánh sáng tuyệt diệu vào buổi chiều."
            }
        },
        {
            "content": "cừ",
            "type": "",
            "example": {
                "en": "You' re an excellent doctor",
                "vi": "Em là một bác sĩ cừ"
            }
        },
        {
            "content": "hơn hẳn",
            "type": "",
            "example": {}
        },
        {
            "content": "thượng hạng",
            "type": "adjective",
            "example": {}
        },
        {
            "content": "trội hơn",
            "type": "",
            "example": {
                "en": "So modestly accept that you will not excel in every endeavor.—Proverbs 11:2.",
                "vi": "Vậy hãy khiêm tốn chấp nhận rằng mình sẽ không trội hơn người khác trong mọi việc.—Châm-ngôn 11:2."
            }
        },
        {
            "content": "cả",
            "type": "adjective",
            "example": {
                "en": "His whole family, including his wife and daughter, give excellent support to the small congregation in the Canary Islands, where they now live.",
                "vi": "Cả gia đình anh, kể cả vợ và con gái, hiện đang sinh sống và giúp đỡ cho hội thánh nhỏ ở quần đảo Canary."
            }
        },
        {
            "content": "rất giỏi",
            "type": "",
            "example": {
                "en": "I am excellent at this sort of work.",
                "vi": "Tôi rất giỏi trong những việc như vậy."
            }
        },
        {
            "content": "tuyệt trần",
            "type": "",
            "example": {}
        }
    ]
}