{
    "word": "expectation",
    "type": [
        "noun"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ˌekspekˈtāSH(ə)n/",
            "/ˌɛkspɛkˈteɪʃ(ə)n/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ɛkspɛkˈteɪʃ(ə)n/"
        ]
    },
    "meanings": [
        {
            "content": "kỳ vọng",
            "type": "noun",
            "example": {
                "en": "It was wrong of me to expect so much of you.",
                "vi": "Tao đã sai khi kỳ vọng quá nhiều ở mày."
            }
        },
        {
            "content": "sự mong chờ",
            "type": "",
            "example": {
                "en": "He actually expected me to love him unconditionally.",
                "vi": "Anh ta thật sự mong chờ rằng tôi sẽ yêu anh ta vô điều kiện."
            }
        },
        {
            "content": "chờ mong",
            "type": "",
            "example": {
                "en": "What did you expect?",
                "vi": "Thế các ông chờ mong điều gì?"
            }
        },
        {
            "content": "dự kiến",
            "type": "",
            "example": {
                "en": "The eye of the storm is expected to hit Friday night.",
                "vi": "Tâm bão dự kiến vào bờ vào tối thứ Sáu."
            }
        },
        {
            "content": "hy vọng",
            "type": "verb",
            "example": {
                "en": "If we ban Chinese students from thinking, what exactly do we expect from them?",
                "vi": "Nếu chúng ta cấm sinh viên Trung Quốc suy nghĩ, chúng ta thật sự hy vọng gì ở họ?"
            }
        },
        {
            "content": "khả năng",
            "type": "",
            "example": {
                "en": "The way they run these sites gives them the expectation of anonymity.",
                "vi": "Cách họ vận hành trang web cho họ khả năng ẩn danh."
            }
        },
        {
            "content": "lý do trông mong",
            "type": "",
            "example": {}
        },
        {
            "content": "mong mỏi",
            "type": "noun",
            "example": {
                "en": "As a child, I awaited his visits with expectation and joy.",
                "vi": "Lúc còn nhỏ, tôi vui mừng mong mỏi những cuộc viếng thăm của anh."
            }
        },
        {
            "content": "sự chờ đợi",
            "type": "",
            "example": {
                "en": "No, living in expectation of Gog’s imminent attack does not cause them to shrink back in fear.",
                "vi": "Chắc chắn sống trong sự chờ đợi cuộc tấn công sắp tới của Gót không làm cho họ sợ hãi thối lui."
            }
        },
        {
            "content": "sự dự tính",
            "type": "",
            "example": {}
        },
        {
            "content": "sự ngóng chờ",
            "type": "",
            "example": {}
        },
        {
            "content": "sự trông mong",
            "type": "",
            "example": {
                "en": "When a wicked man dies, his hope perishes; and even expectation based on powerfulness has perished.",
                "vi": "Khi kẻ ác chết, sự trông-mong nó mất; và sự trông-đợi của kẻ cường-bạo bị diệt."
            }
        },
        {
            "content": "sự tính trước",
            "type": "",
            "example": {}
        },
        {
            "content": "trông mong",
            "type": "",
            "example": {
                "en": "It was not expected that we would live without transgressing one law or another.",
                "vi": "Chúng ta không trông mong sẽ sống mà không phạm vào một số luật lệ."
            }
        },
        {
            "content": "điều mong đợi",
            "type": "",
            "example": {
                "en": "Of course, some expectations in marriage are entirely proper.",
                "vi": "Tất nhiên, một số điều mong đợi nơi hôn nhân là hoàn toàn chính đáng."
            }
        }
    ]
}