{
    "word": "expression",
    "type": [
        "noun"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ikˈspreSHən/",
            "/ɪkˈsprɛʃən/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ɪkˈsprɛʃ(ə)n/",
            "/ɛkˈsprɛʃ(ə)n/"
        ]
    },
    "meanings": [
        {
            "content": "biểu thức",
            "type": "noun",
            "example": {
                "en": "Click to remove a word or regular expression from the list",
                "vi": "Nhấn vào để bỏ một từ hay một biểu thức chính quy khỏi danh sách"
            }
        },
        {
            "content": "thành ngữ",
            "type": "noun",
            "example": {
                "en": "Now mark the expression—that which was sown in his heart.",
                "vi": "Giờ đây hãy lưu ý đến thành ngữ—điều mà đã được gieo vào lòng người ấy."
            }
        },
        {
            "content": "vẻ",
            "type": "noun",
            "example": {
                "en": "Two other residents of the nursing home gazed at me with puzzled expressions.",
                "vi": "Hai người khác ở trong nhà dưỡng lão chăm chú nhìn tôi với vẻ bối rối."
            }
        },
        {
            "content": "từ ngữ",
            "type": "",
            "example": {
                "en": "Instead, he chose clear, simple expressions to reach the hearts of his listeners.",
                "vi": "Thay vì thế, ngài chọn những từ ngữ đơn giản, rõ ràng để động đến lòng người nghe."
            }
        },
        {
            "content": "nét",
            "type": "",
            "example": {
                "en": "Not without changing the expression on my face.",
                "vi": "Không thể được nếu không thay đổi nét kênh kiệu của em."
            }
        },
        {
            "content": "châm ngôn",
            "type": "noun",
            "example": {
                "en": "A proverb often expresses a profound truth in very few words.",
                "vi": "Một câu Châm-ngôn thường diễn đạt một lẽ thật thâm thúy qua chỉ vài từ."
            }
        },
        {
            "content": "cụm từ",
            "type": "noun",
            "example": {
                "en": "Why does the expression “standing before the throne” not refer to a heavenly class?",
                "vi": "Tại sao cụm từ “đứng trước ngôi” không chỉ lớp người được lên trời?"
            }
        },
        {
            "content": "giọng",
            "type": "noun",
            "example": {
                "en": "Now read it aloud with appropriate expressiveness.",
                "vi": "Kế đó hãy đọc lớn với giọng diễn cảm thích hợp."
            }
        },
        {
            "content": "sự biểu đạt",
            "type": "noun",
            "example": {
                "en": "So I really do believe that design is the highest form of creative expression.",
                "vi": "Và tôi thật sự tin rằng thiết kế là hình thức cao nhất của sự biểu đạt sáng tạo"
            }
        },
        {
            "content": "sự diễn đạt",
            "type": "noun",
            "example": {
                "en": "Mastery of the mother tongue is a prerequisite for creative expression in other languages.",
                "vi": "Sự lưu loát ấy là nền tảng cho sự diễn đạt phong phú trong ngôn ngữ khác."
            }
        },
        {
            "content": "biểu hiện",
            "type": "verb noun",
            "example": {
                "en": "True gratitude is an expression of hope and testimony.",
                "vi": "Lòng biết ơn chân thật là một biểu hiện về niềm hy vọng và chứng ngôn."
            }
        },
        {
            "content": "sự biểu lộ",
            "type": "noun",
            "example": {
                "en": "Thus, his looking after elderly parents is an expression of godly devotion.",
                "vi": "Vậy thì sự chăm sóc cho cha mẹ già là một sự biểu lộ lòng tin kính."
            }
        },
        {
            "content": "sự bóp",
            "type": "",
            "example": {}
        },
        {
            "content": "sự vắt",
            "type": "",
            "example": {}
        },
        {
            "content": "sự ép",
            "type": "",
            "example": {}
        },
        {
            "content": "từ",
            "type": "noun",
            "example": {
                "en": "What does the expression “threefold cord” mean as regards marriage?",
                "vi": "Khi áp dụng cho hôn nhân, cụm từ “sợi dây bện ba” có nghĩa gì?"
            }
        },
        {
            "content": "ngữ",
            "type": "noun",
            "example": {
                "en": "Now mark the expression—that which was sown in his heart.",
                "vi": "Giờ đây hãy lưu ý đến thành ngữ—điều mà đã được gieo vào lòng người ấy."
            }
        },
        {
            "content": "sự biểu hiện",
            "type": "",
            "example": {
                "en": "Rather, it is an expression of his nature in ways that are right and just.",
                "vi": "Trái lại, nó là một sự biểu hiện của bản chất Ngài theo cách đúng và chính trực."
            }
        },
        {
            "content": "vẻ mặt",
            "type": "",
            "example": {
                "en": "They had an almost heavenly expression, an attitude of reverence and peace.",
                "vi": "Họ đã có một vẻ mặt gần như thánh thiện, một thái độ tôn kính và bình an."
            }
        }
    ]
}