{
    "word": "famous",
    "type": [
        "adjective"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ˈfāməs/",
            "/ˈfeɪməs/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ˈfeɪməs/"
        ]
    },
    "meanings": [
        {
            "content": "nổi tiếng",
            "type": "adjective",
            "example": {
                "en": "You should visit Kyoto, which is famous for its old temples and shrines.",
                "vi": "Bạn nên đến Tokyo, nơi nổi tiếng với những địa danh như ngôi chùa cổ, đền Shinto..."
            }
        },
        {
            "content": "nổi danh",
            "type": "adjective",
            "example": {
                "en": "Have you ever read two biographies about the same famous person?",
                "vi": "Bạn có bao giờ đọc hai bài tiểu sử của cùng một người nổi danh không?"
            }
        },
        {
            "content": "trứ danh",
            "type": "adjective",
            "example": {
                "en": "Before you fast please take this famous Fragrant Rain tea",
                "vi": "Trước khi đi... xin hãy thưởng thức trà Hương Vũ trứ danh"
            }
        },
        {
            "content": "chiến",
            "type": "noun",
            "example": {}
        },
        {
            "content": "có tiếng",
            "type": "adjective",
            "example": {
                "en": "Your team's style is very famous in the amateur soccer field.",
                "vi": "Đội của cậu đã có tiếng trong lãnh vực bóng đá không chuyên"
            }
        },
        {
            "content": "lừng danh",
            "type": "adjective",
            "example": {
                "en": "A famous admiral of buccaneers took the Knights'galley and the bird.",
                "vi": "Một thuyền trưởng cướp biển lừng danh đã cướp chiếc thuyền và con chim của các Hiệp Sĩ."
            }
        },
        {
            "content": "vang danh",
            "type": "adjective",
            "example": {
                "en": "Demonstrate... why the name Whirlwind Tiger is so famous.",
                "vi": "Hãy chứng tỏ... Tại sao cái tên Cơn Lốc Mãnh Hổ được vang danh đi"
            }
        },
        {
            "content": "cừ",
            "type": "",
            "example": {}
        },
        {
            "content": "cao thủ",
            "type": "",
            "example": {}
        },
        {
            "content": "lẫy lừng",
            "type": "adjective",
            "example": {
                "en": "One of his most famous hacks was a social network attack",
                "vi": "Một trong những chiến tích lẫy lừng của hắn là tấn công vào một mạng xã hội."
            }
        },
        {
            "content": "lừng lẫy",
            "type": "adjective",
            "example": {
                "en": "You are the boat builder that helped make Ragnar so famous.",
                "vi": "Anh là thợ đóng thuyền đã làm Ragnar tiếng tăm lừng lẫy đó à"
            }
        }
    ]
}