{
    "word": "feeling",
    "type": [
        "adjective",
        "noun",
        "verb"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ˈfēliNG/",
            "/ˈfilɪŋ/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ˈfiːlɪŋ/"
        ]
    },
    "meanings": [
        {
            "content": "cảm giác",
            "type": "",
            "example": {
                "en": "It's the best feeling.",
                "vi": "Đó là cảm giác tuyệt vời nhất."
            }
        },
        {
            "content": "cảm xúc",
            "type": "noun",
            "example": {
                "en": "Dan didn't even try to hide that feeling.",
                "vi": "Dan thậm chí chẳng cố giấu cảm xúc đó."
            }
        },
        {
            "content": "rờ mó",
            "type": "",
            "example": {}
        },
        {
            "content": "sự cảm thấy",
            "type": "",
            "example": {
                "en": "I really feel sorry for that old man who lives alone and has no family.",
                "vi": "Tôi thực sự cảm thấy thượng hại ông lão đó, ông ấy sống một mình và không có gia đình."
            }
        },
        {
            "content": "sự cảm động",
            "type": "",
            "example": {
                "en": "Neither should warmth and feeling be confused with sentimentality and emotionalism.",
                "vi": "Cũng đừng nhầm lẫn sự nhiệt thành và tình cảm với tính đa cảm hay sự cảm động thái quá."
            }
        },
        {
            "content": "sự xúc động",
            "type": "",
            "example": {
                "en": "The feeling is most of the press will be using it by the a.m.",
                "vi": "Sự xúc động sẽ là thứ hầu hết các báo sẽ sử dụng trong sáng nay."
            }
        },
        {
            "content": "cảm",
            "type": "verb",
            "example": {
                "en": "I get the feeling you're trying to tell me something.",
                "vi": "Tôi cảm thấy rằng bạn đang muốn nói gì đó với tôi."
            }
        },
        {
            "content": "nỗi",
            "type": "noun",
            "example": {
                "en": "I have to remind myself of the fear you must be feeling.",
                "vi": "Anh phải nhắc nhở mình về nỗi sợ hãi của em."
            }
        },
        {
            "content": "sự cảm giác",
            "type": "noun",
            "example": {
                "en": "'Cause it really feels like it's about the kiss.",
                "vi": "vì thật sự cảm giác như là do nụ hôn đó vậy."
            }
        },
        {
            "content": "yêu mến",
            "type": "",
            "example": {
                "en": "Healthy human beings express feelings, such as affection, by giving gifts.",
                "vi": "Còn người lành mạnh bày tỏ cảm xúc của họ ra, ví dụ như yêu mến, bằng cách tặng quà."
            }
        },
        {
            "content": "chân thật",
            "type": "",
            "example": {
                "en": "Yet, real love is not just something we feel.",
                "vi": "Nhưng tình yêu thương chân thật không chỉ là điều mà chúng ta cảm thấy trong lòng."
            }
        },
        {
            "content": "có cảm giác",
            "type": "",
            "example": {
                "en": "And when it does, does it feel like it's coming from inside you?",
                "vi": "Và khi nó đến cháu có cảm giác nó phát ra từ bên trong cháu?"
            }
        },
        {
            "content": "có tình",
            "type": "",
            "example": {
                "en": "Because despite your best efforts, you've allowed yourself to feel something.",
                "vi": "Bời vì với tất cả nỗ lực của mình, anh đã cho phép bản thân có tình cảm."
            }
        },
        {
            "content": "có tình cảm",
            "type": "",
            "example": {
                "en": "Because despite your best efforts, you've allowed yourself to feel something.",
                "vi": "Bời vì với tất cả nỗ lực của mình, anh đã cho phép bản thân có tình cảm."
            }
        },
        {
            "content": "cảm nghĩ",
            "type": "",
            "example": {
                "en": "Do you consult your own feelings in this case or seek to gratify mine?",
                "vi": "Cô đang thăm dò cảm nghĩ của chính cô trong trường hợp này hay đang dò dẫm các cảm nghĩ của tôi?"
            }
        },
        {
            "content": "cảm tình",
            "type": "noun",
            "example": {
                "en": "I thought she was beginning to have some deep feelings for me also.",
                "vi": "Tôi nghĩ rằng cô ta cũng bắt đầu có cảm tình với tôi."
            }
        },
        {
            "content": "cảm tính",
            "type": "noun",
            "example": {
                "en": "You don't have any personal feelings in this.",
                "vi": "Em không làm theo cảm tính đấy chứ."
            }
        },
        {
            "content": "cảm tưởng",
            "type": "noun",
            "example": {
                "en": "But I had a feeling he hadn’t got the point.",
                "vi": "Nhưng tôi có cảm tưởng nó không thật sự hiểu tôi muốn nói gì."
            }
        },
        {
            "content": "cảm động",
            "type": "",
            "example": {
                "en": "As I contemplate that solemn occasion, my feelings are deeply touched.",
                "vi": "Khi suy ngẫm về sự kiện đặc biệt long trọng đó, tôi thấy cảm động vô cùng."
            }
        },
        {
            "content": "lòng tự ái",
            "type": "",
            "example": {
                "en": "Gossip has destructive power and can wound people’s feelings.",
                "vi": "Tật ngồi lê đôi mách có khả năng hủy hoại và có thể làm tổn thương lòng tự ái của người khác."
            }
        },
        {
            "content": "nhạy cảm",
            "type": "",
            "example": {
                "en": "You thought me devoid of every proper feeling, I am sure.",
                "vi": "Lúc ấy em đã nghĩ anh không nhạy cảm gì cả. Anh chắc chắn em nghĩ như thế."
            }
        },
        {
            "content": "sâu sắc",
            "type": "",
            "example": {
                "en": "It sees and hears and feels keenly what happens.",
                "vi": "Nó nhìn và nghe thấy một cách sâu sắc những điều đang xảy ra."
            }
        },
        {
            "content": "sức truyền cảm",
            "type": "",
            "example": {}
        },
        {
            "content": "sự bắt mạch",
            "type": "",
            "example": {}
        },
        {
            "content": "sự nhạy cảm",
            "type": "",
            "example": {}
        },
        {
            "content": "sự sờ mó",
            "type": "",
            "example": {}
        },
        {
            "content": "sự thông cảm",
            "type": "",
            "example": {}
        },
        {
            "content": "thật tình",
            "type": "",
            "example": {
                "en": "I know how you feel, but really and truly, what would it hurt to let her have her way?",
                "vi": "Không biết em nghĩ sao, nhưng thật tình, làm theo ý mẹ thì có hại gì?"
            }
        },
        {
            "content": "xúc cảm",
            "type": "",
            "example": {
                "en": "It confirms that those feelings are normal.",
                "vi": "Kinh Thánh xác nhận những xúc cảm ấy là bình thường."
            }
        },
        {
            "content": "ý kiến",
            "type": "noun",
            "example": {
                "en": "I, for one, would like to hear how the president feels about all this.",
                "vi": "Tôi muốn lắng nghe ý kiến của Tổng thống."
            }
        },
        {
            "content": "tình",
            "type": "noun",
            "example": {
                "en": "Well, right now I don't feel too agreeable.",
                "vi": "Ngay bây giờ tôi thấy không có mấy đồng tình."
            }
        },
        {
            "content": "thương",
            "type": "verb noun",
            "example": {
                "en": "A famished lion feels no pity for its prey.",
                "vi": "Một con sư tử đói cồn cào sẽ không thương tiếc con mồi."
            }
        },
        {
            "content": "Cảm giác",
            "type": "",
            "example": {
                "en": "It's the best feeling.",
                "vi": "Đó là cảm giác tuyệt vời nhất."
            }
        },
        {
            "content": "tình cảm",
            "type": "noun",
            "example": {
                "en": "Maybe feelings are feelings because we can't control them.",
                "vi": "Có lẽ tình cảm vẫn là tình cảm bởi vì mình không thể kiểm soát được nó."
            }
        }
    ]
}