{
    "word": "fist",
    "type": [
        "verb",
        "noun"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/fist/",
            "/fɪst/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/fɪst/"
        ]
    },
    "meanings": [
        {
            "content": "nắm tay",
            "type": "",
            "example": {
                "en": "The only thing you'll be abusing tonight is your own fist.",
                "vi": "Việc duy nhất ông sẽ lạm dụng đêm nay là tự nắm tay của mình."
            }
        },
        {
            "content": "quả đấm",
            "type": "noun",
            "example": {
                "en": "The laws of my fist are about to compel your teeth.",
                "vi": "Luật của quả đấm của ta sắp \" ép \" vào răng của cháu đấy."
            }
        },
        {
            "content": "quyền",
            "type": "noun",
            "example": {
                "en": "Hopefully the string can restrain your fists and help you control yourself.",
                "vi": "Hy vọng sợi dây sau này mỗi lần anh ra quyền Giúp anh kìm chế bản thân"
            }
        },
        {
            "content": "nắm đấm",
            "type": "noun",
            "example": {
                "en": "If my fist feels weak to you, it means my own feelings are weak.",
                "vi": "Nếu nắm đấm của tôi còn yếu, chỉ là do tình cảm yếu mềm của tôi."
            }
        },
        {
            "content": "đấm",
            "type": "",
            "example": {
                "en": "I was so happy that I wanted to throw my fist into the air!",
                "vi": "Tôi mừng đến nỗi muốn đấm lên trời!"
            }
        },
        {
            "content": "thụi",
            "type": "",
            "example": {}
        },
        {
            "content": "bàn tay",
            "type": "noun",
            "example": {
                "en": "I'd go to Africa and bring you back a diamond as big as your fist.",
                "vi": "Tôi sẽ đi châu Phi và đem về một vốc kim cương vừa với bàn tay em."
            }
        },
        {
            "content": "chữ viết",
            "type": "noun",
            "example": {}
        },
        {
            "content": "nắm chặt",
            "type": "",
            "example": {
                "en": "You can't shake someone's hand with a clenched fist.",
                "vi": "Khi bắt tay ai không được nắm chặt quá."
            }
        },
        {
            "content": "điều khiển",
            "type": "",
            "example": {
                "en": "Master Ng Mui created this Wing Chun fist style, the secret is the control of power with flexibility",
                "vi": "Ngũ Mai sư thái tạo ra đòn thế của Vịnh Xuân Quyền, bí mật ở chỗ điều khiển lực sao cho phù hợp.."
            }
        },
        {
            "content": "Nắm đấm",
            "type": "",
            "example": {
                "en": "Your fist isn't going to solve the problem.",
                "vi": "Nắm đấm của anh sẽ không giải quyết được vấn đề."
            }
        }
    ]
}