{
    "word": "follow",
    "type": [
        "verb",
        "noun"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ˈfälō/",
            "/ˈfɑloʊ/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ˈfɒləʊ/"
        ]
    },
    "meanings": [
        {
            "content": "đi theo",
            "type": "",
            "example": {
                "en": "Tom wants us to follow him.",
                "vi": "Tom muốn chúng ta đi theo anh ấy."
            }
        },
        {
            "content": "theo",
            "type": "verb adposition",
            "example": {
                "en": "All you have to do is follow his advice.",
                "vi": "Mọi thứ bạn phải làm là thực hiện theo lời khuyên của anh ấy."
            }
        },
        {
            "content": "theo sau",
            "type": "",
            "example": {
                "en": "Kill him, and you'll bear the wrath of his following.",
                "vi": "Giết hắn đi, và anh sẽ phải chịu sự phẫn nộ của những kẻ theo sau."
            }
        },
        {
            "content": "đi theo sau",
            "type": "",
            "example": {
                "en": "Chuck your guns out and follow them with your hands high!",
                "vi": "Thảy súng ra ngoài, đi theo sau hai tay đưa cao, thì sẽ không có ai bị thương!"
            }
        },
        {
            "content": "noi",
            "type": "verb",
            "example": {
                "en": "I only pray your grandmother follows your lead.",
                "vi": "Tôi chỉ có thể cầu nguyện rằng bà của hoàng hậu sẽ noi gương người."
            }
        },
        {
            "content": "hành động theo",
            "type": "",
            "example": {
                "en": "8 Some people think that listening to their conscience simply means following their feelings.",
                "vi": "8 Một số người cho rằng lắng nghe lương tâm có nghĩa là hành động theo cảm xúc của mình."
            }
        },
        {
            "content": "sau đây",
            "type": "",
            "example": {
                "en": "We believe that the following encouragement can help to remedy the situation.",
                "vi": "Chúng tôi thiết nghĩ rằng lời khuyến khích sau đây có thể giúp giải quyết vấn đề này."
            }
        },
        {
            "content": "cú đánh theo",
            "type": "",
            "example": {}
        },
        {
            "content": "hiểu kịp",
            "type": "",
            "example": {
                "en": "Just let me see if I'm following you here, Russell.",
                "vi": "Cứ để tôi xem mình có hiểu kịp anh không đã, Russell."
            }
        },
        {
            "content": "kế theo",
            "type": "",
            "example": {}
        },
        {
            "content": "kế tiếp",
            "type": "verb",
            "example": {
                "en": "His own grandchild to follow you on the throne.",
                "vi": "Cháu của ông ấy sẽ theo ngươi kế tiếp lên ngai vàng."
            }
        },
        {
            "content": "làm nghề",
            "type": "",
            "example": {
                "en": "One of her brothers, Roy, followed the family business of raising sheep.",
                "vi": "Một trong mấy anh em của bà là Roy làm nghề doanh nghiệp nuôi cừu của gia đình."
            }
        },
        {
            "content": "lẩn quẩn",
            "type": "verb",
            "example": {}
        },
        {
            "content": "nghe kịp",
            "type": "",
            "example": {
                "en": "Do you follow me?",
                "vi": "Anh nghe kịp không?"
            }
        },
        {
            "content": "nửa suất thêm",
            "type": "",
            "example": {}
        },
        {
            "content": "sinh ra",
            "type": "",
            "example": {
                "en": "To understand how this can occur, consider the following scenario.",
                "vi": "Để hiểu vấn đề nảy sinh ra sao, hãy xem một thí dụ."
            }
        },
        {
            "content": "theo dõi",
            "type": "",
            "example": {
                "en": "How can I follow up on invitations to act?",
                "vi": "Bằng cách nào tôi có thể theo dõi các lời mời để hành động?"
            }
        },
        {
            "content": "theo nghề",
            "type": "",
            "example": {
                "en": "I followed in my parents footsteps you know.",
                "vi": "Tôi đi theo nghề của bố mẹ tôi."
            }
        },
        {
            "content": "theo đuổi",
            "type": "",
            "example": {
                "en": "And it certainly can't follow them up here.",
                "vi": "Và chắc chắn không thể theo đuổi chúng lên cao."
            }
        },
        {
            "content": "tiếp theo",
            "type": "",
            "example": {
                "en": "Enter your username, followed by your password.",
                "vi": "Nhập tên người dùng của bạn, tiếp theo đó là mật khẩu."
            }
        },
        {
            "content": "tuân lệnh",
            "type": "",
            "example": {
                "en": "What's important is that you stop asking me questions and agree to follow me blindly!",
                "vi": "Quan trọng là các bạn hãy dừng hỏi và tuân lệnh tôi."
            }
        },
        {
            "content": "tùy tòng",
            "type": "",
            "example": {}
        },
        {
            "content": "xảy đến",
            "type": "",
            "example": {
                "en": "Great opposition and much persecution followed the believers of its authenticity.",
                "vi": "Sự chống đối nặng nề và nhiều sự ngược đãi xảy đến cho những người tin vào sự trung thực của sách đó."
            }
        },
        {
            "content": "đi hầu",
            "type": "",
            "example": {
                "en": "In the years that followed, Melody and I traveled to most parts of India.",
                "vi": "Những năm sau, tôi và Melody đi hầu hết đất nước Ấn Độ."
            }
        },
        {
            "content": "tuân",
            "type": "",
            "example": {
                "en": "We're still following the same principles that we would always.",
                "vi": "Chúng tôi vẫn tuân thủ những nguyên tắc như chúng tôi vẫn làm."
            }
        },
        {
            "content": "hiểu",
            "type": "verb",
            "example": {
                "en": "The following comments shed light on the matter.",
                "vi": "Những lời bình luận sau đây giúp chúng ta hiểu rõ vấn đề."
            }
        }
    ]
}