{
    "word": "fundamental",
    "type": [
        "adjective",
        "noun"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ˌfəndəˈmen(t)əl/",
            "/ˌfəndəˈmɛn(t)əl/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/fʌndəˈmɛnt(ə)l/"
        ]
    },
    "meanings": [
        {
            "content": "cơ bản",
            "type": "adjective",
            "example": {
                "en": "And the fundamental idea is you want to make inferences and then take actions.",
                "vi": "Và ý tưởng cơ bản là bạn muốn thực hiện suy luận và sau đó mới hành động."
            }
        },
        {
            "content": "chủ yếu",
            "type": "adjective",
            "example": {
                "en": "Their actions raised fundamental issues that struck at the very foundation of universal law and order.",
                "vi": "Hành động của họ đã nêu lên những vấn đề chủ yếu tấn công nền tảng của an ninh trật tự trong vũ trụ."
            }
        },
        {
            "content": "gốc",
            "type": "noun",
            "example": {
                "en": "at a fundamentally primal level in Nathaniel's psyche,",
                "vi": "gốc rễ trong tâm hồn và tâm trí của Nathaniel,"
            }
        },
        {
            "content": "chung",
            "type": "adjective",
            "example": {
                "en": "Because all humans have inherited a fundamental flaw that can warp their judgment.",
                "vi": "Vì do di truyền, toàn thể nhân loại đều có một khuyết điểm chung khiến sự phán đoán của chúng ta bị lệch lạc."
            }
        },
        {
            "content": "bản lãnh",
            "type": "noun, adjective",
            "example": {}
        },
        {
            "content": "cơ sở",
            "type": "adjective",
            "example": {
                "en": "It's fundamental to Darwin and Mendel and so on.",
                "vi": "Nó là cơ sở cho Darwin và Mendel và những người khác."
            }
        },
        {
            "content": "nguyên tắc",
            "type": "adjective",
            "example": {
                "en": "Aside from these fundamentals the medicine must strenghten the basic functions.",
                "vi": "Từ những thứ căn bản, phương thuốc này phải dựa trên những nguyên tắc cơ bản nhất"
            }
        },
        {
            "content": "nguyên tắc cơ bản",
            "type": "",
            "example": {}
        },
        {
            "content": "nốt gốc",
            "type": "",
            "example": {}
        },
        {
            "content": "quy tắc cơ bản",
            "type": "",
            "example": {}
        },
        {
            "content": "thuộc cơ bản/gốc",
            "type": "",
            "example": {}
        },
        {
            "content": "chủ",
            "type": "adjective",
            "example": {
                "en": "He says that's one of the fundamental laws of democracy, no exception.",
                "vi": "Hắn nói đó là một trong những điều luật căn bản của chế độ dân chủ."
            }
        },
        {
            "content": "chính",
            "type": "noun",
            "example": {
                "en": "I think what we don't wanna fault to is... a type of fundamental literalism.",
                "vi": "Tôi nghĩ rằng những gì ta không muốn chối bỏ chính là một dạng đức tin."
            }
        },
        {
            "content": "quan trọng",
            "type": "adjective",
            "example": {
                "en": "How we treat those closest to us is of fundamental importance.",
                "vi": "Cách chúng ta đối xử với những người thân cận với mình thật là vô cùng quan trọng."
            }
        }
    ]
}