{
    "word": "genuine",
    "type": [
        "adjective"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ˈjenyo͞oən/",
            "/ˈdʒɛnjuən/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ˈdʒɛnjʊɪn/"
        ]
    },
    "meanings": [
        {
            "content": "thật",
            "type": "adjective",
            "example": {
                "en": "And praise really does have to be genuine, but she takes responsibility for that.",
                "vi": "Lời khen không nhất thiết phải thật chân thành, nhưng cô ấy để tâm đến nó."
            }
        },
        {
            "content": "chính cống",
            "type": "adjective",
            "example": {
                "en": "How many other genuine heroes you got lined up?",
                "vi": "Thế ông có bao nhiêu anh hùng chiến tranh chính cống khác đang xếp hàng vậy?"
            }
        },
        {
            "content": "thành thật",
            "type": "",
            "example": {
                "en": "The wording and the tone of voice should convey the genuineness of sorrow.",
                "vi": "Lời lẽ và giọng nói nên biểu hiện sự hối tiếc thành thật."
            }
        },
        {
            "content": "thực",
            "type": "adjective",
            "example": {
                "en": "I can see that you're genuinely slightly bothered, but it's never going to be the same.",
                "vi": "Tôi thấy anh thực tâm lo lắng nhưng ngày xưa chẳng bao giờ trở lại."
            }
        },
        {
            "content": "chân thành",
            "type": "adjective",
            "example": {
                "en": "On the contrary, he displays genuine concern for the welfare of all peoples.",
                "vi": "Trái lại, Ngài bày tỏ sự quan tâm chân thành đến hạnh phúc của mọi dân tộc."
            }
        },
        {
            "content": "chính hiệu",
            "type": "adjective",
            "example": {
                "en": "Floor is genuine wood.",
                "vi": "Sàn gỗ chính hiệu."
            }
        },
        {
            "content": "chân chính",
            "type": "adjective",
            "example": {
                "en": "And remember, humility is at the root of genuine wisdom.",
                "vi": "Và hãy nhớ rằng khiêm nhường là cội rễ của sự khôn ngoan chân chính."
            }
        },
        {
            "content": "chân thật",
            "type": "",
            "example": {
                "en": "Of course, we always welcome honest and genuine questions.",
                "vi": "Dĩ nhiên, chúng ta luôn luôn tiếp nhận những câu hỏi chân thành và chân thật."
            }
        },
        {
            "content": "xác thực",
            "type": "adjective",
            "example": {
                "en": "What, then, if the prophecies are genuine?",
                "vi": "Vậy, nếu các lời tiên tri xác thực thì sao?"
            }
        },
        {
            "content": "đích thực",
            "type": "",
            "example": {
                "en": "It was the genuine one article by Petrus Christus.",
                "vi": "Nhưng là một tác phẩm đích thực của Petrus Christus."
            }
        }
    ]
}