{
    "word": "glory",
    "type": [
        "verb",
        "noun"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ˈɡlôrē/",
            "/ˈɡlɔri/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ˈɡlɔːri/"
        ]
    },
    "meanings": [
        {
            "content": "vinh quang",
            "type": "noun",
            "example": {
                "en": "“And the glory of the terrestrial is one, even as the glory of the moon is one.",
                "vi": "Và vinh quang trung thiên thì độc nhất giống như vinh quang của mặt trăng thì độc nhất."
            }
        },
        {
            "content": "danh vọng",
            "type": "noun",
            "example": {
                "en": "A wise man does not fight for glory alone.",
                "vi": "Người thông minh chiến đấu vì nhiều thứ khác ngoài danh vọng."
            }
        },
        {
            "content": "danh tiếng",
            "type": "",
            "example": {
                "en": "No fame, no glory, no money. What are you doing?",
                "vi": "Không danh tiếng, không vinh quang, không tiền bạc. Mình đang làm gì cơ chứ?"
            }
        },
        {
            "content": "vẻ huy hoàng",
            "type": "noun",
            "example": {}
        },
        {
            "content": "cảnh tiên",
            "type": "",
            "example": {}
        },
        {
            "content": "hãnh diện",
            "type": "",
            "example": {
                "en": "Wherefore Cain was called Master dMahan, and he gloried in his wickedness.",
                "vi": "Vậy nên Ca In được gọi là Thầy bMa Hân, và hắn lấy làm hãnh diện về sự tà ác của mình."
            }
        },
        {
            "content": "hạnh phúc ở thiên đường",
            "type": "",
            "example": {}
        },
        {
            "content": "quang vinh",
            "type": "",
            "example": {
                "en": "I mean, we don't see with his eyes, so we don't know the glory of his plan.",
                "vi": "Ta không nhìn được mọi thứ qua con mắt của Người, nên ta không hiểu được kế hoạch quang vinh của Người."
            }
        },
        {
            "content": "sự vinh quang",
            "type": "",
            "example": {
                "en": "Rebuilt stone for stone and restored to all of its original glory.",
                "vi": "Xây dựng lại đá và khôi phục tới sự vinh quang nguyên bản của nó."
            }
        },
        {
            "content": "sự vẻ vang",
            "type": "noun",
            "example": {
                "en": "Yet, much of the power and glory of the Roman Empire was built on the backs of slaves.",
                "vi": "Nhưng sức mạnh và sự vẻ vang mà đế quốc La Mã có được là nhờ việc bóc lột những người nô lệ."
            }
        },
        {
            "content": "thanh danh",
            "type": "",
            "example": {}
        },
        {
            "content": "thời kỳ hưng thịnh",
            "type": "",
            "example": {}
        },
        {
            "content": "thời kỳ vinh hiển",
            "type": "",
            "example": {}
        },
        {
            "content": "tự hào",
            "type": "adjective",
            "example": {
                "en": "11 Nevertheless, in this I do not glory, for I am unworthy to glory of myself.",
                "vi": "11 Tuy nhiên, trong việc này tôi không dám tự hào, vì tôi không xứng đáng để khoe khoang về điều đó."
            }
        },
        {
            "content": "vinh dự",
            "type": "",
            "example": {
                "en": "That you, dear Felix, in all your glory and inconvenience will do me the honour.",
                "vi": "Anh, Felix thân yêu, em sẽ đẻ con với anh,... sự phiền phức này sẽ làm cho em được vinh dự."
            }
        },
        {
            "content": "vầng hào quang",
            "type": "",
            "example": {}
        },
        {
            "content": "vẻ lộng lẫy",
            "type": "",
            "example": {
                "en": "Orchids in All Their Glory",
                "vi": "Hoa phong lan với cả vẻ lộng lẫy"
            }
        },
        {
            "content": "vẻ rực rỡ",
            "type": "",
            "example": {
                "en": "There he saw two personages, whose brightness and glory defy all description.",
                "vi": "Ở đó, ông đã thấy hai Nhân Vật, vẻ rực rỡ và hào quang chói lọi không bút nào tả xiết."
            }
        },
        {
            "content": "ánh hào quang",
            "type": "noun",
            "example": {
                "en": "The pursuit of military glory disgusts me now.",
                "vi": "Sự theo đuổi ánh hào quang trong quân ngũ làm tôi thấy bây giờ hối hận."
            }
        },
        {
            "content": "vinh",
            "type": "",
            "example": {
                "en": "All that glory would suddenly turn to shame and foolishness.",
                "vi": "Và mọi vinh quang đó sẽ trở thành nỗi xấu hổ và tủi nhục."
            }
        },
        {
            "content": "sự huy hoàng",
            "type": "",
            "example": {
                "en": "You're not a man who slaughters innocents for gain or glory.",
                "vi": "Bệ hạ không phải là kẻ giết hại sinh linh vì lợi ích hay vì sự huy hoàng."
            }
        }
    ]
}