{
    "word": "grievous",
    "type": [
        "adjective"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ˈɡrēvəs/",
            "/ˈɡrivəs/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ˈɡriːvəs/"
        ]
    },
    "meanings": [
        {
            "content": "đau khổ",
            "type": "adjective",
            "example": {
                "en": "When confronted with grievous trials, why should we reflect on our blessings?",
                "vi": "Khi đương đầu với các thử thách gây đau khổ, tại sao chúng ta nên suy ngẫm về những ân phước của mình?"
            }
        },
        {
            "content": "đau",
            "type": "adjective verb",
            "example": {
                "en": "Note that grievous in this context means extremely disturbing.",
                "vi": "Hãy lưu ý rằngđau buồn trong văn cảnh này có nghĩa là vô cùng đau lòng."
            }
        },
        {
            "content": "nặng",
            "type": "adjective noun",
            "example": {
                "en": "For either parent to deliberately abandon their children is a very grievous mistake.",
                "vi": "Bởi vì người cha hay mẹ nào mà cố tình bỏ phế con cái họ thì là một lỗi lầm nặng nề."
            }
        },
        {
            "content": "ghê tởm",
            "type": "",
            "example": {
                "en": "He had engaged in grievous immoral conduct and was being counseled by Alma.",
                "vi": "Ông ấy đã có hành vi vô luân ghê tởm và đã được An Ma khuyên dạy."
            }
        },
        {
            "content": "sầu khổ",
            "type": "adjective",
            "example": {}
        },
        {
            "content": "tai hại",
            "type": "",
            "example": {}
        },
        {
            "content": "trầm trọng",
            "type": "adjective",
            "example": {
                "en": "□ What are the root causes of mankind’s grievous problems?",
                "vi": "□ Một số nguyên nhân sâu xa của các vấn đề trầm trọng của nhân loại là gì?"
            }
        },
        {
            "content": "trắng trợn",
            "type": "",
            "example": {}
        },
        {
            "content": "đau thương",
            "type": "",
            "example": {
                "en": "Violating the law of chastity is a grievous sin and a misuse of our physical tabernacles.",
                "vi": "Việc vi phạm luật trinh khiết là một tội lỗi đau thương và là cách lạm dụng thân thể của chúng ta."
            }
        },
        {
            "content": "đau đớn",
            "type": "adjective",
            "example": {
                "en": "Towards dressing such grievous injuries?",
                "vi": "Để băng bó cho vết thương đau đớn này?"
            }
        },
        {
            "content": "đau buồn",
            "type": "adjective",
            "example": {
                "en": "A proud person is discontented, always wants more, and rebels at grievous circumstances.",
                "vi": "Người kiêu ngạo không toại nguyện, luôn luôn ham muốn nhiều hơn và chống đối hoàn cảnh đau buồn."
            }
        }
    ]
}