{
    "word": "harm",
    "type": [
        "verb",
        "noun"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/härm/",
            "/hɑrm/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/hɑːm/"
        ]
    },
    "meanings": [
        {
            "content": "hại",
            "type": "noun",
            "example": {
                "en": "Such a program will help the rich but harm the poor.",
                "vi": "Một chương trình như vậy sẽ giúp đỡ người giàu có hại tới người nghèo."
            }
        },
        {
            "content": "làm hại",
            "type": "",
            "example": {
                "en": "Doctors take an oath not to harm anyone.",
                "vi": "Những vị bác sĩ tuyên thệ sẽ không làm hại bất kỳ ai."
            }
        },
        {
            "content": "tai hại",
            "type": "",
            "example": {
                "en": "Addictions and inappropriate or harmful propensities cause heartache.",
                "vi": "Những thói nghiện và xu hướng không thích đáng hoặc tai hại tạo ra nỗi đau lòng."
            }
        },
        {
            "content": "thiệt hại",
            "type": "noun",
            "example": {
                "en": "Many feel that even mistaken beliefs cause little harm to anyone.",
                "vi": "Nhiều người nghĩ rằng dù có tin sai cũng không gây thiệt hại gì cho ai."
            }
        },
        {
            "content": "nguy hại",
            "type": "noun",
            "example": {
                "en": "There are certain tests I could run that wouldn't be harmful.",
                "vi": "Tôi có thể làm một số thí nghiệm mà không gây nguy hại gì."
            }
        },
        {
            "content": "sự tổn hại",
            "type": "noun",
            "example": {
                "en": "Whatever harm may come to them, it can and will be undone.",
                "vi": "Bất cứ sự tổn hại nào xảy ra cho họ thì sẽ thành vô hiệu."
            }
        },
        {
            "content": "tổn thất",
            "type": "noun",
            "example": {
                "en": "If no harm has been done, then isn't it okay?",
                "vi": "Nếu không bị tổn thất gì, thì không sao cả đúng không?"
            }
        },
        {
            "content": "gây tai hại",
            "type": "",
            "example": {
                "en": "Undue pressure from others can indeed be harmful.",
                "vi": "Quá nhiều áp lực từ người khác có thể gây tai hại."
            }
        },
        {
            "content": "hãm hại",
            "type": "verb",
            "example": {
                "en": "The machine identifies malice and an intent to harm.",
                "vi": "Máy xác định ác ý và ý định hãm hại."
            }
        },
        {
            "content": "làm tổn hại",
            "type": "",
            "example": {
                "en": "I never intended harm to come to anyone.",
                "vi": "Tôi không hề có ý định làm tổn hại ai cả."
            }
        },
        {
            "content": "phương hại",
            "type": "",
            "example": {
                "en": "We won't let you harm her",
                "vi": "Chúng ta sẽ không để ngươi phương hại nàng."
            }
        },
        {
            "content": "tác hại",
            "type": "noun",
            "example": {
                "en": "So, as you see, people care about harm and care issues.",
                "vi": "Bạn có thể thấy mọi người có quan tâm về các vấn đề tác hại và quan tâm."
            }
        },
        {
            "content": "tổn hao",
            "type": "noun",
            "example": {
                "en": "They must be constantly watched, least they harm themselves in the simple act of being men.",
                "vi": "Nó phải được theo dõi thường xuyên, khi họ tự làm tổn hao mình cho việc đó"
            }
        },
        {
            "content": "ý muốn hại người",
            "type": "",
            "example": {}
        },
        {
            "content": "điều gây tai hại",
            "type": "",
            "example": {}
        },
        {
            "content": "đụng chạm",
            "type": "",
            "example": {}
        },
        {
            "content": "tổn hại",
            "type": "",
            "example": {
                "en": "If you lay down your arms, you will not be harmed.",
                "vi": "Nếu ông và bĩnh sĩ hạ vũ khí, các ông sẽ không bị tổn hại."
            }
        }
    ]
}