{
    "word": "has",
    "type": [
        "verb"
    ],
    "meanings": [
        {
            "content": "biết",
            "type": "verb",
            "example": {
                "en": "She has no opinion about religion.",
                "vi": "Cô ấy chẳng biết gì về tôn giáo."
            }
        },
        {
            "content": "biết được",
            "type": "",
            "example": {
                "en": "How do we know that has anything to do with Riley?",
                "vi": "Sao chúng ta biết được là nó có liên quan tới Riley?"
            }
        },
        {
            "content": "bảo",
            "type": "adjective verb noun",
            "example": {
                "en": "I assure you, he has only the interests of the Republic at heart.",
                "vi": "Tôi bảo đảm, ngài ấy chỉ quan tâm đến nền Cộng hòa thôi."
            }
        },
        {
            "content": "bắt",
            "type": "verb",
            "example": {
                "en": "The beginning of the end of the end of the beginning has begun.",
                "vi": "Sự bắt đầu của cái kết của cái kết của sự bắt đầu đã bắt đầu."
            }
        },
        {
            "content": "bắt buộc phải",
            "type": "",
            "example": {
                "en": "Nobody has to come along.",
                "vi": "Không ai bị bắt buộc phải đi."
            }
        },
        {
            "content": "bị",
            "type": "verb noun",
            "example": {
                "en": "Our kid's immune system has a factory defect.",
                "vi": "Hệ miễn dịch của thằng cu bị hỏng từ trứng nước."
            }
        },
        {
            "content": "bịp",
            "type": "",
            "example": {
                "en": "A man has to stick to what he is good at.",
                "vi": "Một người đàn ông phải biết lừa bịp mới là người tốt."
            }
        },
        {
            "content": "cho là",
            "type": "",
            "example": {
                "en": "I expect everyone has a reason to be nervous tonight.",
                "vi": "Tôi cho là tối nay ai cũng có lý do để lo lắng."
            }
        },
        {
            "content": "cho phép",
            "type": "",
            "example": {
                "en": "The school district has given us permission to search rawlings'office.",
                "vi": "Khu học chánh đã cho phép chúng ta lục soát văn phòng Rawlings."
            }
        },
        {
            "content": "chủ trương",
            "type": "",
            "example": {
                "en": "This religion advocates compassion and tolerance, and it has fascinated many by its complicated philosophy.",
                "vi": "Tôn giáo này chủ trương lòng nhân từ và khoan dung đã làm say mê nhiều người bởi triết lý phức tạp."
            }
        },
        {
            "content": "có",
            "type": "verb",
            "example": {
                "en": "Our club has three times as many members as yours.",
                "vi": "Câu lạc bộ của chúng tôi có số thành viên gấp ba lần của bạn."
            }
        },
        {
            "content": "có bổn phận phải",
            "type": "",
            "example": {}
        },
        {
            "content": "hiểu",
            "type": "verb",
            "example": {
                "en": "Can't she see that it has nothing to do with you?",
                "vi": "Cô ta không hiểu rằng em không liên quan gì tới chuyện này sao?"
            }
        },
        {
            "content": "hành động lừa bịp",
            "type": "",
            "example": {}
        },
        {
            "content": "hút",
            "type": "verb",
            "example": {
                "en": "The association has helped hundreds of thousands of smokers quit .",
                "vi": "Hiệp hội đã giúp hàng trăm ngàn người hút thuốc bỏ thuốc lá ."
            }
        },
        {
            "content": "hưởng",
            "type": "verb",
            "example": {
                "en": "For years, your probability formula has decided the fate of others.",
                "vi": "Nhiều năm qua, những ảnh hưởng của anh đã quyết định vận mệnh của nhiều người khác."
            }
        },
        {
            "content": "lừa bịp",
            "type": "",
            "example": {
                "en": "A man has to stick to what he is good at.",
                "vi": "Một người đàn ông phải biết lừa bịp mới là người tốt."
            }
        },
        {
            "content": "muốn",
            "type": "verb",
            "example": {
                "en": "I've always done whatever the Court has asked of me.",
                "vi": "Tôi đã luôn làm bất cứ việc gì Hội muốn tôi làm."
            }
        },
        {
            "content": "nhận được",
            "type": "",
            "example": {
                "en": "Imagine a son who has just received a letter from his father for whom he has deep affection.",
                "vi": "Giả sử một con trai vừa mới nhận được thư người cha yêu dấu."
            }
        },
        {
            "content": "nhớ",
            "type": "verb",
            "example": {
                "en": "She has been properly punctured and her memory modified.",
                "vi": "Bà ta đã trở về trạng thái cũ và thay đổi trí nhớ."
            }
        },
        {
            "content": "nhờ",
            "type": "",
            "example": {
                "en": "My family has relied on MI6 twice, Mr Bond.",
                "vi": "Gia đình tôi đã cậy nhờ Ml-6 hai lần."
            }
        },
        {
            "content": "nói",
            "type": "verb",
            "example": {
                "en": "He stays in the room next to mine and has a lisp.",
                "vi": "Anh ta ở cạnh phòng tôi. Anh ấy nói ngọng."
            }
        },
        {
            "content": "nắm",
            "type": "",
            "example": {
                "en": "Need to know what Crain has on you.",
                "vi": "Nên hãy nói tôi biết Crain đã nắm được thóp gì của cô?"
            }
        },
        {
            "content": "nắm chặt",
            "type": "",
            "example": {}
        },
        {
            "content": "phải",
            "type": "adjective verb",
            "example": {
                "en": "Poor is not the one who has too little, but the one who wants too much.",
                "vi": "Người nghèo không phải là người có quá ít mà là người muốn quá nhiều."
            }
        },
        {
            "content": "sai khiến",
            "type": "",
            "example": {}
        },
        {
            "content": "sự lừa bịp",
            "type": "",
            "example": {}
        },
        {
            "content": "thắng",
            "type": "verb noun",
            "example": {
                "en": "That boy has just saved this war for us.",
                "vi": "Tên nhóc đó vừa giúp ta thắng cuộc chiến này."
            }
        },
        {
            "content": "thắng thế",
            "type": "",
            "example": {
                "en": "It has been said that for evil to prevail, it is only necessary for good people to do nothing.4",
                "vi": "Người ta nói rằng để cho điều tà ác thắng thế, thì chỉ cần những người tốt không làm gì cả.4"
            }
        },
        {
            "content": "tin chắc là",
            "type": "",
            "example": {
                "en": "I want to know why you're so sure that destiny has nothing in store for us.",
                "vi": "Tôi muốn biết tại sao cô quá tin chắc là... số phận không có dành chút gì cho chúng ta."
            }
        },
        {
            "content": "tóm",
            "type": "",
            "example": {}
        },
        {
            "content": "uống",
            "type": "verb",
            "example": {
                "en": "All this talk of blood and slaying has put me off my tea.",
                "vi": "Ngừng mấy cái chuyện linh tinh đó đi và uống trà thôi."
            }
        },
        {
            "content": "ăn",
            "type": "verb",
            "example": {
                "en": "She has invited me to dine with her.",
                "vi": "Cô ấy mời con đến ăn bữa tối."
            }
        },
        {
            "content": "co quyen sach trong cap phai khong",
            "type": "",
            "example": {}
        }
    ]
}