{
    "word": "hide",
    "type": [
        "verb",
        "noun"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/hīd/",
            "/haɪd/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/hʌɪd/"
        ]
    },
    "meanings": [
        {
            "content": "giấu",
            "type": "verb",
            "example": {
                "en": "Dan didn't even try to hide that feeling.",
                "vi": "Dan thậm chí chẳng cố giấu cảm xúc đó."
            }
        },
        {
            "content": "da",
            "type": "noun",
            "example": {
                "en": "They even made their sleeping bags from reindeer hide.",
                "vi": "Họ thậm chí còn làm túi ngủ của mình từ da tuần lộc."
            }
        },
        {
            "content": "trốn",
            "type": "verb",
            "example": {
                "en": "Is there another Fragmentation we can hide out in?",
                "vi": "Còn phân mảnh nào nữa mà chúng ta có thể trốn không?"
            }
        },
        {
            "content": "che giấu",
            "type": "",
            "example": {
                "en": "No point in trying to hide behind that face.",
                "vi": "Cố che giấu nỗi sợ sau gương mặt đó không ích gì đâu."
            }
        },
        {
            "content": "ẩn",
            "type": "verb",
            "example": {
                "en": "I have since had this great hall emptied, so there is nowhere to hide!",
                "vi": "Từ đó ta đã ra lênh để Đại điện trống không để thích khách không nơi ẩn nấp."
            }
        },
        {
            "content": "che",
            "type": "verb",
            "example": {
                "en": "No point in trying to hide behind that face.",
                "vi": "Cố che giấu nỗi sợ sau gương mặt đó không ích gì đâu."
            }
        },
        {
            "content": "dấu",
            "type": "noun",
            "example": {
                "en": "Well, if everything goes like I expect, there won't be anything to hide.",
                "vi": "Well, nếu mọi chuyện diễn ra như tôi mong đợi, sẽ chẳng có chuyện gì phải dấu cả."
            }
        },
        {
            "content": "che dấu",
            "type": "noun",
            "example": {
                "en": "Knowing when people are hiding something behind their smiles.",
                "vi": "Biết là khi nào người ta đang che dấu điều gì đó đằng sau nụ cười."
            }
        },
        {
            "content": "nấp",
            "type": "verb",
            "example": {
                "en": "Michael was hiding in the car when I went out last night.",
                "vi": "Michael đã nấp trong xe khi anh ra ngoài tối qua."
            }
        },
        {
            "content": "náu",
            "type": "",
            "example": {
                "en": "We have survived by hiding and running from them but they are the gatekeepers.",
                "vi": "Chúng ta tồn tại nhờ ẩn náu khỏi chúng, nhưng chúng là những người giữ cửa."
            }
        },
        {
            "content": "yểm",
            "type": "verb",
            "example": {}
        },
        {
            "content": "cất giấu",
            "type": "noun",
            "example": {
                "en": "Only then will we be able to know where those signatures are hiding,",
                "vi": "Chỉ khi đó chúng ta mới có thể biết các vết tích được cất giấu ở đâu,"
            }
        },
        {
            "content": "giấu giếm",
            "type": "",
            "example": {
                "en": "Why would they need guns unless they have something to hide?",
                "vi": "Tại sao chúng lại cần súng nếu không phải đang giấu giếm thứ gì đó?"
            }
        },
        {
            "content": "giữ kín",
            "type": "verb",
            "example": {}
        },
        {
            "content": "ẩn náu",
            "type": "",
            "example": {
                "en": "The hiding place is irrelevant when the hidden hide for no reason.",
                "vi": "Chỗ ẩn náu không quan trọng khi người ta ẩn náu không có lý do."
            }
        },
        {
            "content": "Hide",
            "type": "",
            "example": {
                "en": "The last one was David Hide, orthodontist, manic-depressive.",
                "vi": "Người khách cuối cùng là David Hide, một bác sĩ chỉnh răng bị mắc chứng trầm cảm."
            }
        },
        {
            "content": "bì",
            "type": "noun",
            "example": {}
        }
    ]
}