{
    "word": "hold",
    "type": [
        "adjective",
        "verb",
        "noun"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/hōld/",
            "/hoʊld/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/həʊld/"
        ]
    },
    "meanings": [
        {
            "content": "cầm",
            "type": "verb",
            "example": {
                "en": "Hold that for me.",
                "vi": "Cầm nó hộ mình."
            }
        },
        {
            "content": "giữ",
            "type": "verb",
            "example": {
                "en": "It was all I could do to hold onto this amazing creature.",
                "vi": "Tôi chỉ có thể cố giữ chặt thứ sinh vật kỳ lạ đó."
            }
        },
        {
            "content": "nắm",
            "type": "verb",
            "example": {
                "en": "When he was holding you by the jacket.",
                "vi": "Khi hắn ta nắm lấy áo của ông."
            }
        },
        {
            "content": "chứa",
            "type": "verb",
            "example": {
                "en": "The champ is holding nothing back as he cracks open the hurt locker!",
                "vi": "Nhà vô địch tung hết sức, nó đang mở chiếc tủ chứa đau đớn ra!"
            }
        },
        {
            "content": "khoang",
            "type": "noun",
            "example": {
                "en": "If I open the cargo hold, you'll lose them all.",
                "vi": "Em mà mở chốt khoang hàng, anh sẽ mất chúng đấy."
            }
        },
        {
            "content": "nắm giữ",
            "type": "",
            "example": {
                "en": "And in the end, what we must fight to hold on to.",
                "vi": "Và rốt cuộc, đó chính là thứ mà chúng ta phải chiến đấu để nắm giữ cho mình."
            }
        },
        {
            "content": "chứa đựng",
            "type": "verb",
            "example": {
                "en": "A gene holds the information needed to build a protein.",
                "vi": "Một gen chứa đựng dữ kiện cần thiết để tạo nên một protein."
            }
        },
        {
            "content": "theo",
            "type": "verb adposition",
            "example": {
                "en": "He was holding something when he left, but I couldn't see what it was.",
                "vi": "Hắn có cầm theo cái gì đó. Nhưng em chẳng kịp nhìn rõ."
            }
        },
        {
            "content": "cho là",
            "type": "",
            "example": {
                "en": "The woman appeared to be holding something in front of her face which is believed to be a camera .",
                "vi": "Người phụ nữ này dường như đang cầm cái gì đó ở phía trước mặt mà được cho là một máy quay phim ."
            }
        },
        {
            "content": "còn mãi",
            "type": "",
            "example": {
                "en": "He will try to hold on to it, but it will not last.",
                "vi": "Hắn cố giữ chặt nhà, nhưng nó không còn mãi."
            }
        },
        {
            "content": "có hiệu lực",
            "type": "",
            "example": {}
        },
        {
            "content": "cứ vẫn",
            "type": "",
            "example": {}
        },
        {
            "content": "giữ vững",
            "type": "",
            "example": {
                "en": "I would've been better off holding my ground.",
                "vi": "Tốt hơn hết là tôi nên giữ vững lập trường."
            }
        },
        {
            "content": "kéo dài",
            "type": "",
            "example": {
                "en": "He may hold out four, maybe five days, not for much longer.",
                "vi": "Nó có thể kéo dài tới bốn, có thể là năm ngày, nhưng ko nhiều hơn vậy đâu."
            }
        },
        {
            "content": "thu hút",
            "type": "",
            "example": {
                "en": "And animals easily hold the attention of children with autism .",
                "vi": "Và thú nuôi cũng dễ dàng thu hút sự chú ý của trẻ bị bệnh tự kỷ ."
            }
        },
        {
            "content": "tin rằng",
            "type": "",
            "example": {
                "en": "Still others hold that all religion is good.",
                "vi": "Còn những người khác tin rằng tôn giáo nào cũng tốt."
            }
        },
        {
            "content": "tiến hành",
            "type": "",
            "example": {}
        },
        {
            "content": "bế",
            "type": "verb",
            "example": {
                "en": "How strange to imagine, holding one's infant self.",
                "vi": "Thật lạ lùng khi nghĩ về, bế phiên bản sơ sinh của mình."
            }
        },
        {
            "content": "ở",
            "type": "verb adposition",
            "example": {
                "en": "A marksman never holds his arrow too long on the string.",
                "vi": "Nếu tên ở trên cung quá lâu, sẽ mất đi độ chính xác."
            }
        },
        {
            "content": "diễn ra",
            "type": "",
            "example": {
                "en": "Just go, and you will be able to hold your convention without any problem.",
                "vi": "Hãy đi, và đại hội các ông sẽ diễn ra bình an vô sự."
            }
        },
        {
            "content": "giữ chắc",
            "type": "",
            "example": {
                "en": "You sure that thing's gonna hold you up?",
                "vi": "Em có chắc cái đó giữ chắc được em không?"
            }
        },
        {
            "content": "giữ vị trí",
            "type": "",
            "example": {
                "en": "He is determined to hold onto his lead.",
                "vi": "Cậu ấy quyết tâm giữ vị trí dẫn đầu"
            }
        },
        {
            "content": "giữ yên",
            "type": "",
            "example": {
                "en": "The vitreous body helps hold the rest of the retina in place.",
                "vi": "Pha lê dịch giúp giữ yên tại chỗ phần còn lại của võng mạc."
            }
        },
        {
            "content": "sẽ thế nào",
            "type": "",
            "example": {
                "en": "What if the Commissioner gets hold of this ledger?",
                "vi": "Nếu như chuyên viên sở cảnh chính lấy được quyển sổ đỏ này thì sẽ thế nào?"
            }
        },
        {
            "content": "đựng",
            "type": "verb",
            "example": {
                "en": "I don't know how much longer reid can hold out.",
                "vi": "Tôi không biết Reid có thể chịu đựng bao lâu nữa."
            }
        },
        {
            "content": "nén",
            "type": "",
            "example": {
                "en": "We have to hold it in at all times.",
                "vi": "Chúng tôi phải kềm nén nó mọi lúc mọi nơi."
            }
        },
        {
            "content": "nín",
            "type": "noun",
            "example": {
                "en": "Well then I hope you're really good at holding your breath.",
                "vi": "Vậy thì tôi mong anh giỏi mà nín thở"
            }
        },
        {
            "content": "chiếm",
            "type": "",
            "example": {
                "en": "I can't move on Prohaszka's holdings until the glare is off.",
                "vi": "Tôi không thể chiếm lấy cổ phần của Prohaszka cho đến khi không bị soi xét nữa."
            }
        },
        {
            "content": "đúng",
            "type": "adjective",
            "example": {
                "en": "I'll hold my side of the deal, I promise.",
                "vi": "Tớ sẽ thực hiện đúng thỏa thuận, tớ hứa, làm ơn."
            }
        },
        {
            "content": "nói",
            "type": "noun",
            "example": {
                "en": "The man holds no love for Rome, through weight of his words.",
                "vi": "Người này chả yêu quý gì Rome, qua cách nói chuyện của hắn."
            }
        },
        {
            "content": "vịn",
            "type": "verb",
            "example": {
                "en": "Brother Mark Littleford lost hold and was thrown against the low iron rail.",
                "vi": "Anh Mark Littleford tuột tay và bị ném vào phía cái tay vịn thấp bằng sắt."
            }
        },
        {
            "content": "choán",
            "type": "",
            "example": {}
        },
        {
            "content": "kiêm",
            "type": "verb",
            "example": {}
        },
        {
            "content": "chiếm hữu",
            "type": "verb",
            "example": {}
        },
        {
            "content": "chỗ dựa",
            "type": "",
            "example": {
                "en": "“I was so concerned about being strong for others that I felt I had to hold in my feelings.",
                "vi": "Tôi quá lo đến việc là mình phải mạnh mẽ để làm chỗ dựa cho người khác nên cố kìm nén cảm xúc."
            }
        },
        {
            "content": "coi là",
            "type": "",
            "example": {
                "en": "I think we'll hold them to a standstill, which is as good as winning.",
                "vi": "Tôi nghĩ là chỉ có thể cầm chân chúng, nhưng cũng được coi là một thắng lợi rồi."
            }
        },
        {
            "content": "có giá trị",
            "type": "",
            "example": {
                "en": "You know it'll never hold up in court.",
                "vi": "Anh biết nó sẽ không bao giờ có giá trị trước tòa."
            }
        },
        {
            "content": "có thể áp dụng",
            "type": "",
            "example": {}
        },
        {
            "content": "có ý nghĩ là",
            "type": "",
            "example": {}
        },
        {
            "content": "cầm nắm",
            "type": "",
            "example": {
                "en": "Now the good news is, Boranes you can get hold of.",
                "vi": "Tin tốt là các bạn có thể cầm nắm được Borane."
            }
        },
        {
            "content": "cố định",
            "type": "",
            "example": {
                "en": "Fibrous joints also hold the teeth in the jawbone .",
                "vi": "Các khớp bất động cũng có nhiệm vụ giữ răng cố định ở xương hàm ."
            }
        },
        {
            "content": "dừng lại",
            "type": "",
            "example": {
                "en": "Yeah, hold up here a minute, hold up here.",
                "vi": "Yeah, dừng lại một phút, dừng lại nào."
            }
        },
        {
            "content": "hàm súc",
            "type": "verb",
            "example": {}
        },
        {
            "content": "kìm lại",
            "type": "",
            "example": {
                "en": "I want you to stop holding back, Skye.",
                "vi": "Tôi muốn cô đừng kìm lại nữa, Skye."
            }
        },
        {
            "content": "lôi cuốn",
            "type": "",
            "example": {}
        },
        {
            "content": "nhà lao",
            "type": "",
            "example": {}
        },
        {
            "content": "nhà tù",
            "type": "",
            "example": {
                "en": "I thought that prison would hold her for eternity.",
                "vi": "Ta cứ nghĩ nhà tù đó sẽ giam giữ mụ vĩnh viễn."
            }
        },
        {
            "content": "pháo đài",
            "type": "noun",
            "example": {}
        },
        {
            "content": "sở hữu",
            "type": "verb",
            "example": {
                "en": "Mr. Haqqani holds advanced degrees in mathematics from Cambridge and Caltech.",
                "vi": "Haqqani sở hữu bằng cao học lĩnh vực toán học tại Cambridge và Caltech."
            }
        },
        {
            "content": "sự cầm",
            "type": "",
            "example": {
                "en": "even though I'm actually holding the stick quite tightly.",
                "vi": "ngay cả khi tôi đang thực sự cầm chắc chiếc que trống."
            }
        },
        {
            "content": "sự giam cầm",
            "type": "",
            "example": {}
        },
        {
            "content": "sự hiểu thấu",
            "type": "",
            "example": {}
        },
        {
            "content": "sự nắm chặt",
            "type": "",
            "example": {}
        },
        {
            "content": "sự nắm giữ",
            "type": "",
            "example": {}
        },
        {
            "content": "sự nắm được",
            "type": "",
            "example": {}
        },
        {
            "content": "theo đuổi",
            "type": "",
            "example": {
                "en": "faithfully holding to it, going down in a blaze of glory,",
                "vi": "tiếp tục trung thành theo đuổi, rồi đi xuống trong vinh quang,"
            }
        },
        {
            "content": "thành luỹ",
            "type": "",
            "example": {}
        },
        {
            "content": "tiếp tục đi theo",
            "type": "",
            "example": {}
        },
        {
            "content": "tán thành",
            "type": "",
            "example": {
                "en": "I cannot approve another loan to a government which already holds significant debts.",
                "vi": "Tôi không thể tán thành một khoản vay khác cho chính quyền đang nắm giữ các khoản nợ nặng nề."
            }
        },
        {
            "content": "vật để nắm lấy",
            "type": "",
            "example": {}
        },
        {
            "content": "vật đỡ",
            "type": "",
            "example": {}
        },
        {
            "content": "xem là",
            "type": "",
            "example": {
                "en": "And those who keep firm hold of it will be called happy.",
                "vi": "Và ai giữ chặt nó được xem là hạnh phúc."
            }
        },
        {
            "content": "xâm chiếm",
            "type": "",
            "example": {
                "en": "But... the creeping anxiety that had taken hold of me would soon gradually melt away.",
                "vi": "Nhưng... nỗi lo sợ đã dần xâm chiếm tôi cũng sẽ dần tan đi."
            }
        },
        {
            "content": "đồn ải",
            "type": "",
            "example": {}
        },
        {
            "content": "đợi một tí",
            "type": "",
            "example": {}
        },
        {
            "content": "đứng lại",
            "type": "",
            "example": {
                "en": "OK, hold it there, I want to get this shot of the newlyweds.",
                "vi": "Ok, đứng lại đó, tôi muốn chụp hình cặp vợ chồng mới cưới."
            }
        },
        {
            "content": "ảnh hưởng",
            "type": "verb noun",
            "example": {
                "en": "I hate that she has this hold on me.",
                "vi": "Tui ghét việc cô ta gây ảnh hưởng lên tui."
            }
        },
        {
            "content": "bắt giữ",
            "type": "",
            "example": {
                "en": "Drazen's people, who are holding your daughter hostage, want me dead.",
                "vi": "Bọn người Drazen đang bắt giữ con gái anh và muốn tôi phải chết."
            }
        },
        {
            "content": "ngừng lại",
            "type": "",
            "example": {
                "en": "When the music stops, invite the child holding the stick to share a good choice she or he can make.",
                "vi": "Khi nhạc ngừng lại, hãy bảo đứa trẻ đang cầm cây gậy chia sẻ một điều tốt mà nó có thể chọn."
            }
        },
        {
            "content": "tiếp tục",
            "type": "",
            "example": {
                "en": "You may not get there, but you hold on to that.",
                "vi": "Có thể cũng chẳng đi đến đâu, nhưng cứ tiếp tục đi."
            }
        },
        {
            "content": "tổ chức",
            "type": "verb noun",
            "example": {
                "en": "However, there was no place big enough to hold the meetings.",
                "vi": "Tuy nhiên, không có nơi nào đủ rộng để tổ chức các buổi họp."
            }
        }
    ]
}