{
    "word": "host",
    "type": [
        "verb",
        "noun"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/hōst/",
            "/hoʊst/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/həʊst/"
        ]
    },
    "meanings": [
        {
            "content": "chủ nhà",
            "type": "noun",
            "example": {
                "en": "It seems that clown fish even provide their host with energy.",
                "vi": "Dường như cá hề còn cung cấp năng lượng cho chủ nhà của mình."
            }
        },
        {
            "content": "loạt",
            "type": "noun",
            "example": {
                "en": "It is a gateway sin that leads to a host of other human weaknesses.",
                "vi": "Đó là một tội dẫn đến một loạt yếu điểm khác của con người."
            }
        },
        {
            "content": "chủ khách sạn",
            "type": "",
            "example": {}
        },
        {
            "content": "chủ quán trọ",
            "type": "",
            "example": {}
        },
        {
            "content": "chủ tiệc",
            "type": "noun",
            "example": {
                "en": "If the conversation strays, the host can tactfully redirect it.",
                "vi": "Nếu cuộc trò chuyện đi sai hướng, chủ tiệc có thể tế nhị đổi hướng câu chuyện."
            }
        },
        {
            "content": "cây chủ",
            "type": "",
            "example": {
                "en": "these are roots that emerge from the trunk and branch of the host trees themselves.",
                "vi": "mà đó là rễ hình thành từ cành và thân của loài cây chủ mà chúng đang sinh sống."
            }
        },
        {
            "content": "khổ chủ",
            "type": "",
            "example": {}
        },
        {
            "content": "số đông",
            "type": "",
            "example": {}
        },
        {
            "content": "sự việc",
            "type": "",
            "example": {
                "en": "No guests or hosts in the vicinity when it occurred.",
                "vi": "Không hề có người chơi hay nhân vật nào ở khu vực đó khi sự việc xảy ra cả."
            }
        },
        {
            "content": "tôn bánh thánh",
            "type": "",
            "example": {}
        },
        {
            "content": "vật chủ",
            "type": "",
            "example": {
                "en": "It can't stay in the host if the host is damaged.",
                "vi": "Nó không thể ở trong vật chủ nếu vật chủ bị tổn thương."
            }
        },
        {
            "content": "đám đông",
            "type": "",
            "example": {}
        },
        {
            "content": "đăng cai",
            "type": "verb",
            "example": {
                "en": "This year, the final tournament will be jointly hosted by Poland and Ukraine.",
                "vi": "Năm nay, vòng chung kết được Ba Lan và Ukraine đồng đăng cai."
            }
        },
        {
            "content": "đạo quân",
            "type": "",
            "example": {
                "en": "And now I find you leading a host to war.",
                "vi": "Và bây giờ con đã dẫn đầu một đạo quân chinh chiến."
            }
        },
        {
            "content": "chiêu đãi viên",
            "type": "noun",
            "example": {}
        },
        {
            "content": "người đón tiếp",
            "type": "noun",
            "example": {
                "en": "In this way there was an “interchange of encouragement” between the visitors and their hosts.",
                "vi": "Bằng cách này, các quan khách và người đón tiếp họ đều “cùng nhau giục lòng mạnh-mẽ”."
            }
        },
        {
            "content": "nhiều",
            "type": "",
            "example": {}
        },
        {
            "content": "chúa",
            "type": "noun",
            "example": {
                "en": "I want all of Ako to share in this honor of hosting our great commander.",
                "vi": "Ta muốn cả Ako này cùng chia sẻ vinh dự được tiếp đón Mạc chúa của chúng ta."
            }
        },
        {
            "content": "Vật chủ",
            "type": "",
            "example": {
                "en": "The host kills the virus, or the virus kills the host.",
                "vi": "Vật chủ tiêu diệt vi-rút, hoặc vi-rút tiêu diệt vật chủ."
            }
        },
        {
            "content": "bánh lễ",
            "type": "",
            "example": {}
        },
        {
            "content": "bánh thánh",
            "type": "noun",
            "example": {
                "en": "The priest, after partaking of the bread and wine, invites the faithful to receive Communion, usually by eating only the bread, or the Host.",
                "vi": "Sau khi ăn bánh và uống rượu, linh mục sẽ mời các tín hữu nhận lãnh Mình Thánh Chúa, thường chỉ là ăn bánh thánh."
            }
        },
        {
            "content": "lưu trữ",
            "type": "",
            "example": {
                "en": "hosting companies, whatnot — to delay their billing until December.",
                "vi": "các công ty lưu trữ dữ liệu, — trì hoãn hóa đơn yêu cầu thanh toán cho đến tháng mười hai."
            }
        },
        {
            "content": "máy chủ",
            "type": "adjective",
            "example": {
                "en": "Honing in on the host server right now.",
                "vi": "Dò IP trên máy chủ đi..."
            }
        },
        {
            "content": "rất đông",
            "type": "",
            "example": {}
        },
        {
            "content": "vô số",
            "type": "",
            "example": {
                "en": "And after countless cycles of repetition, these hosts, they were varying.",
                "vi": "Và sau vô số những vòng lặp, các nhân vật này, chúng đang biến đổi."
            }
        }
    ]
}