{
    "word": "in",
    "type": [
        "adjective",
        "verb",
        "noun",
        "adverb",
        "adposition"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/in/",
            "/ɪn/",
            "/ˈˌī ˈen/",
            "/ˈˌaɪ ˈɛn/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ɪn/"
        ]
    },
    "meanings": [
        {
            "content": "trong",
            "type": "adposition, sinh ra Những",
            "example": {
                "en": "I will have been staying in this hotel for one month next Sunday.",
                "vi": "Tôi sẽ ở lại khách sạn này trong một tháng kể từ ngày thứ hai tới."
            }
        },
        {
            "content": "ở",
            "type": "adposition",
            "example": {
                "en": "There are some interesting exhibits in the museum.",
                "vi": "Có một vài hiện vật lý thú đươc trưng bày ở bảo tàng."
            }
        },
        {
            "content": "tại",
            "type": "adposition",
            "example": {
                "en": "He lives in a house far from the village.",
                "vi": "Anh ấy sống tại một ngôi nhà xa làng."
            }
        },
        {
            "content": "vào",
            "type": "adjective, conjunction",
            "example": {
                "en": "No, I cannot let you in, there's one person too many.",
                "vi": "Không, tôi không cho bạn vào được. Đã nhiều người quá rồi."
            }
        },
        {
            "content": "bằng",
            "type": "adjective noun adposition",
            "example": {
                "en": "Students often find it very difficult to understand a lecture in a foreign language.",
                "vi": "Sinh viên cảm thường thấy rất khó hiểu một bài giảng bằng tiếng nước ngoài."
            }
        },
        {
            "content": "đến",
            "type": "verb adposition",
            "example": {
                "en": "How tall do you think my daughter will be in three years?",
                "vi": "Bạn nghĩ là trong ba năm tới con gái tôi sẽ cao đến đâu?"
            }
        },
        {
            "content": "thành",
            "type": "adjective verb noun adposition",
            "example": {
                "en": "Tom and three other crew members were injured in the accident.",
                "vi": "Tom và ba thành viên khác của đội đã bị thương trong tai nạn."
            }
        },
        {
            "content": "vào lúc",
            "type": "",
            "example": {
                "en": "What time do you leave home in the morning?",
                "vi": "Buổi sáng bạn rời khỏi nhà vào lúc mấy giờ?"
            }
        },
        {
            "content": "theo",
            "type": "verb adposition",
            "example": {
                "en": "I wish people would stop saying things in ways that crush young dreams.",
                "vi": "Tôi mong sao mọi người ngưng nói ra ý kiến theo kiểu chà đạp những ước mơ trẻ."
            }
        },
        {
            "content": "về",
            "type": "verb",
            "example": {
                "en": "I specialize in medieval history.",
                "vi": "Tôi chuyên về lịch sử thời Trung cổ."
            }
        },
        {
            "content": "nhỏ xíu",
            "type": "adjective",
            "example": {
                "en": "No normal man lives in a little biddy hole like that.",
                "vi": "Không có người bình thường nào sống trong một cái lỗ nhỏ xíu như vầy."
            }
        },
        {
            "content": "đang đến",
            "type": "",
            "example": {
                "en": "I was just reading up about the other cases in the area that you're headed to.",
                "vi": "Tôi vừa tìm hiểu những vụ khác xung quanh khu vực các cậu đang đến."
            }
        },
        {
            "content": "đang",
            "type": "",
            "example": {
                "en": "It is said that his father is in hospital now.",
                "vi": "Nghe nói cha anh ta đang ở trong bệnh viện."
            }
        },
        {
            "content": "để",
            "type": "conjunction verb",
            "example": {
                "en": "I would like to go to Austria in order to study music.",
                "vi": "Tôi muốn đi Áo để học âm nhạc."
            }
        },
        {
            "content": "vì",
            "type": "conjunction",
            "example": {
                "en": "We got caught in the storm.",
                "vi": "Chúng tôi bị mắc kẹt vì cơn bão."
            }
        },
        {
            "content": "trong lúc",
            "type": "",
            "example": {
                "en": "What should I do in the meantime?",
                "vi": "Tôi nên làm gì trong lúc ấy?"
            }
        },
        {
            "content": "trên",
            "type": "adjective adposition",
            "example": {
                "en": "May Day is also a festival day for the workers in the world.",
                "vi": "Ngày Quốc tế lao động cũng là ngày lễ dành cho người lao động trên toàn thế giới."
            }
        },
        {
            "content": "nội",
            "type": "adjective noun adposition",
            "example": {
                "en": "One day, grandpa caught her with a man in the laundry.",
                "vi": "Có một lần ông nội bắt gặp bả với chồng của bà giặt ủi."
            }
        },
        {
            "content": "gặt",
            "type": "",
            "example": {
                "en": "The fruit that we produce results, not in sorrow, but in great joy.",
                "vi": "Bông trái mà chúng ta gặt hái không phải là nỗi đau buồn mà là niềm vui lớn."
            }
        },
        {
            "content": "far",
            "type": "",
            "example": {}
        },
        {
            "content": "bao quanh",
            "type": "verb",
            "example": {
                "en": "Would you not prefer to live in the city, surrounded by real people?",
                "vi": "Tại sao chị không muốn sống ở thành phố bao quanh bởi những con người thực?"
            }
        },
        {
            "content": "bên trong",
            "type": "adposition",
            "example": {
                "en": "With this system a protection circuit has been built in.",
                "vi": "Với hệ thống này, mạch bảo vệ đã được thiết kế tích hợp bên trong."
            }
        },
        {
            "content": "chỗ vào",
            "type": "",
            "example": {
                "en": "You've been in an awful lot of wrong places at the wrong time lately.",
                "vi": "Anh hay đến nhầm chỗ vào nhầm thời điểm."
            }
        },
        {
            "content": "cầm quyền",
            "type": "",
            "example": {
                "en": "and that, in fact, you're not the authority",
                "vi": "Và rằng thật ra các bạn không phải là người cầm quyền"
            }
        },
        {
            "content": "cặp bến",
            "type": "",
            "example": {
                "en": "When they docked at the wharf in Nauvoo, she was by Priscilla’s side.",
                "vi": "Khi tàu cặp bến Nauvoo, người phụ nữ này luôn bên cạnh Priscilla."
            }
        },
        {
            "content": "nơi vào",
            "type": "",
            "example": {
                "en": "But she can't have been in two places at the same time, can she?",
                "vi": "Nhưng cô ấy không thể xuất hiện ở hai nơi vào cùng một thời điểm, phải không?"
            }
        },
        {
            "content": "quây lại",
            "type": "",
            "example": {}
        },
        {
            "content": "sự đưa vào",
            "type": "",
            "example": {}
        },
        {
            "content": "thu lại",
            "type": "",
            "example": {
                "en": "We can play the original in one ear, and a new recording in the other.",
                "vi": "Ta có thể chơi bản gốc bằng 1 tai và thu lại bằng tai còn lại."
            }
        },
        {
            "content": "thu thập lại",
            "type": "",
            "example": {
                "en": "And specifically, I'm interested in collecting my own stories,",
                "vi": "Cụ thể là tôi có hứng thú thu thập lại chuyện của mình,"
            }
        },
        {
            "content": "thu vén lại",
            "type": "",
            "example": {}
        },
        {
            "content": "trong khi",
            "type": "",
            "example": {
                "en": "She takes a new lover while he is in anguish.",
                "vi": "Trong khi anh ta đang đau khổ thì cô ta có người yêu mới."
            }
        },
        {
            "content": "vào trong",
            "type": "",
            "example": {
                "en": "Write it down in your personal journal or in your scriptures.",
                "vi": "Hãy viết điều này vào trong nhật ký cá nhân hoặc trong thánh thư của các em."
            }
        },
        {
            "content": "đang là cái mốt",
            "type": "",
            "example": {}
        },
        {
            "content": "đang lúc",
            "type": "",
            "example": {
                "en": "In November 1994, while engaging in the preaching work, Ella suddenly felt very weak.",
                "vi": "Tháng 11 năm 1994, đang lúc làm công tác rao giảng, chị Ella đột nhiên cảm thấy quá yếu mệt."
            }
        },
        {
            "content": "đang mùa",
            "type": "",
            "example": {
                "en": "even in the summertime, because of the violence.",
                "vi": "kể cả đang mùa hè, vì lo sợ bạo lực."
            }
        },
        {
            "content": "đang nắm chính quyền",
            "type": "",
            "example": {}
        },
        {
            "content": "đang thịnh hành",
            "type": "",
            "example": {
                "en": "How can you counteract the negative propaganda so prevalent in this world?",
                "vi": "Làm sao bạn có thể kháng cự quan điểm sai lệch đang thịnh hành trong thế gian này?"
            }
        },
        {
            "content": "đến bến",
            "type": "",
            "example": {
                "en": "The coast guard confirms it arrives at Pier 21 at the Jersey Docks in less than three hours.",
                "vi": "Bảo vệ bờ biển xác nhận nó sẽ đến bến 21 tại cảng Jersey trong ít hơn 3 giờ nữa."
            }
        },
        {
            "content": "ở bên trong",
            "type": "",
            "example": {
                "en": "Do you know what was in the box?",
                "vi": "Cậu có biết thứ gì ở bên trong cái hòm đó không?"
            }
        },
        {
            "content": "ở nhà",
            "type": "",
            "example": {
                "en": "In the meantime you can stay in my house.",
                "vi": "Trong khi chờ đợi hãy ở nhà của em."
            }
        },
        {
            "content": "ở trong",
            "type": "adposition",
            "example": {
                "en": "It is said that his father is in hospital now.",
                "vi": "Nghe nói cha anh ta đang ở trong bệnh viện."
            }
        },
        {
            "content": "ở vào",
            "type": "",
            "example": {
                "en": "For months you've been hinting I was in line for that promotion.",
                "vi": "Nhiều tháng qua, ông đã gợi ý là tôi sẽ ở vào vị trí đó."
            }
        }
    ]
}