{
    "word": "interest",
    "type": [
        "verb",
        "noun"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ˈint(ə)rəst/",
            "/ˈɪnt(ə)rəst/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ˈɪnt(ə)rɪst/"
        ]
    },
    "meanings": [
        {
            "content": "quyền lợi",
            "type": "noun",
            "example": {
                "en": "The public interest is not always the same as the national interest.",
                "vi": "Quyền lợi cộng đồng không phải lúc nào cũng giống với quyền lợi quốc gia."
            }
        },
        {
            "content": "lợi tức",
            "type": "",
            "example": {
                "en": "And during harvest, put it back with interest, food interest.",
                "vi": "Và trong mùa thu hoạch, hãy gửi vào kho cùng với một lợi tức, lợi tức lương thực."
            }
        },
        {
            "content": "sự chú ý",
            "type": "noun",
            "example": {
                "en": "Because of the interest shown, some of these studies continued well into the night.",
                "vi": "Vì có sự chú ý, một số cuộc học hỏi ấy đã kéo dài đến khuya."
            }
        },
        {
            "content": "sự quan tâm",
            "type": "",
            "example": {
                "en": "You've always complained that we don't take enough interest in your business.",
                "vi": "Bạn luôn than phiền về việc chúng tôi không dành một sự quan tâm đúng mức tới việc kinh doanh của bạn."
            }
        },
        {
            "content": "tiền lãi",
            "type": "",
            "example": {
                "en": "Compounding works by paying interest on interest .",
                "vi": "Cơ chế kép này hoạt động trên nguyên tắc trả lãi cho tiền lãi ."
            }
        },
        {
            "content": "điều quan tâm",
            "type": "",
            "example": {}
        },
        {
            "content": "lãi",
            "type": "noun",
            "example": {
                "en": "Other than the skyrocketing interest rates on personal loans?",
                "vi": "Ngoài chuyện tăng ầm ầm của lãi suất cho vay cá nhân hả?"
            }
        },
        {
            "content": "hiệp hội",
            "type": "",
            "example": {
                "en": "Credit unions , banks and other financial institutions pay interest on savings accounts .",
                "vi": "Hiệp hội tín dụng , ngân hàng và các tổ chức tài chính khác đều chi trả lãi cho các tài khoản tiết kiệm ."
            }
        },
        {
            "content": "lời",
            "type": "noun",
            "example": {
                "en": "Are you interested in my advice on this, or you just want me to deliver the message?",
                "vi": "Cô muốn nghe lời khuyên của tôi hay cô chỉ muốn tôi truyền tải thông điệp?"
            }
        },
        {
            "content": "sự hứng thú",
            "type": "noun",
            "example": {
                "en": "Well, I wasn't so interested in the swimming.",
                "vi": "Tôi không thực sự hứng thú với việc bơi lội ấy."
            }
        },
        {
            "content": "thuyết phục",
            "type": "",
            "example": {
                "en": "How do you persuade people that it is in their interest",
                "vi": "Làm thế nào bạn thuyết phục mọi người rằng đó là quyền lợi của họ"
            }
        },
        {
            "content": "dính dáng đến",
            "type": "",
            "example": {}
        },
        {
            "content": "hứng thú",
            "type": "adjective",
            "example": {
                "en": "The only girls who are interested in me are girls I have no interest in.",
                "vi": "Người duy nhất thích tớ thì tớ lại chẳng có hứng thú gì."
            }
        },
        {
            "content": "liên quan đến",
            "type": "",
            "example": {
                "en": "The tape came from a conspiracy theory group that's interested in Savage.",
                "vi": "Cuộn băng từ một nhóm theo lý thuyết âm mưu mà có liên quan đến Savage"
            }
        },
        {
            "content": "làm cho chú ý",
            "type": "",
            "example": {}
        },
        {
            "content": "làm cho quan tâm",
            "type": "",
            "example": {}
        },
        {
            "content": "làm cho thích thú",
            "type": "",
            "example": {}
        },
        {
            "content": "làm tham gia",
            "type": "",
            "example": {}
        },
        {
            "content": "làm... chú ý",
            "type": "",
            "example": {}
        },
        {
            "content": "lợi ích",
            "type": "noun",
            "example": {
                "en": "He worked day and night in the interest of his firm.",
                "vi": "Anh ấy làm việc ngày đêm vì lợi ích của xí nghiệp mình."
            }
        },
        {
            "content": "quan tâm",
            "type": "verb",
            "example": {
                "en": "Everyone is more or less interested in art.",
                "vi": "Ai cũng ít nhiều có chút quan tâm đến nghệ thuật."
            }
        },
        {
            "content": "sự thích thú",
            "type": "noun",
            "example": {
                "en": "But we certainly don't want them to, nor is it in their best interest.",
                "vi": "Nhưng ta chắc chắn không muốn họ làm vậy, hay nó là sự thích thú nhất của họ."
            }
        },
        {
            "content": "tầm quan trọng",
            "type": "",
            "example": {
                "en": "This impressed upon me the importance of getting our publications into the hands of interested ones.",
                "vi": "Điều này khắc ghi trong tôi tầm quan trọng của việc trao các sách báo vào tay những người chú ý."
            }
        },
        {
            "content": "ích kỷ",
            "type": "adjective",
            "example": {
                "en": "Those who are selfish seek their own interests and pleasure above all else.",
                "vi": "Những người ích kỷ tìm kiếm lợi ích và niềm vui của mình trên hết."
            }
        },
        {
            "content": "điều chú ý",
            "type": "",
            "example": {}
        },
        {
            "content": "điều thích thú",
            "type": "",
            "example": {
                "en": "The interest for the flower were huge and bulbs were sold for unbelievable high prices .",
                "vi": "Điều thích thú đối với loài hoa này là rất nhiều và củ của nó được bán với giá cao không thể tin nổi ."
            }
        },
        {
            "content": "Lãi suất",
            "type": "",
            "example": {
                "en": "Credit card interest rates make the price of the charged items a great deal more expensive .",
                "vi": "Lãi suất thẻ tín dụng làm giá các mặt hàng được tính đắt hơn rất nhiều ."
            }
        },
        {
            "content": "làm ... chú ý",
            "type": "",
            "example": {}
        },
        {
            "content": "lãi suất",
            "type": "noun",
            "example": {
                "en": "Other than the skyrocketing interest rates on personal loans?",
                "vi": "Ngoài chuyện tăng ầm ầm của lãi suất cho vay cá nhân hả?"
            }
        },
        {
            "content": "nhấn trọng âm",
            "type": "",
            "example": {}
        }
    ]
}