{
    "word": "into",
    "type": [
        "adposition"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ˈinto͞o/",
            "/ˈɪntu/",
            "/ˈin(t)ə/",
            "/ˈɪn(t)ə/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ˈɪntʊ/",
            "/ˈɪntə/"
        ]
    },
    "meanings": [
        {
            "content": "vào",
            "type": "conjunction, adposition",
            "example": {
                "en": "Ten people were packed into the small room.",
                "vi": "Mười người bị nhét vào một căn phòng nhỏ."
            }
        },
        {
            "content": "thành",
            "type": "noun",
            "example": {
                "en": "From this standpoint history can be divided into two main epochs.",
                "vi": "Từ lập trường này, lịch sử có thể được chia ra thành hai niên đại chính."
            }
        },
        {
            "content": "vào trong",
            "type": "adposition",
            "example": {
                "en": "Go into that room and deposit your specimen into the container.",
                "vi": "Vào trong phòng kia và lấy mẫu tinh trùng của anh vào cái cốc này."
            }
        },
        {
            "content": "sang",
            "type": "conjunction",
            "example": {
                "en": "Do we turn our good feelings into practical assistance?",
                "vi": "Chúng ta có hướng những cảm nghĩ tốt của mình sang sự phụ giúp thực tiễn không?"
            }
        },
        {
            "content": "hoá ra",
            "type": "",
            "example": {
                "en": "We must not allow our creative protest to degenerate into physical violence .",
                "vi": "Chúng ta không được để cho cuộc tuần hành phản kháng chưa từng có này hoá ra lại là một cuộc bạo động ."
            }
        },
        {
            "content": "thành ra",
            "type": "",
            "example": {
                "en": "After my family died, I ran into a great deal of money.",
                "vi": "Gia đình tôi chết hết, thành ra tôi có nhiều tiền."
            }
        },
        {
            "content": "bước sang",
            "type": "adposition",
            "example": {
                "en": "I still have my life to live, still have many more pages to pass into.",
                "vi": "Tôi vẫn có cuộc đời để sống, vẫn còn nhiều trang để bước sang."
            }
        },
        {
            "content": "chia",
            "type": "",
            "example": {
                "en": "From this standpoint history can be divided into two main epochs.",
                "vi": "Từ lập trường này, lịch sử có thể được chia ra thành hai niên đại chính."
            }
        },
        {
            "content": "chuyển sang",
            "type": "adposition",
            "example": {
                "en": "They have grieved it, they have died into it, and allowed and encouraged poison to turn into medicine.",
                "vi": "Họ đau buồn, và chết trong đó và cho phép và khuyến khích chất độc chuyển sang thuốc."
            }
        },
        {
            "content": "đâm vào",
            "type": "",
            "example": {
                "en": "Like a sword, she has no say into whose body she is thrust.",
                "vi": "Như lưỡi kiếm, cô ta không được quyền nói xem mình đâm vào ai."
            }
        },
        {
            "content": "trong",
            "type": "adjective adposition",
            "example": {
                "en": "An odd idea popped into my head.",
                "vi": "Một ý tưởng kỳ lạ lóe lên trong đầu tôi."
            }
        },
        {
            "content": "ở",
            "type": "verb adposition",
            "example": {
                "en": "It started acting up again when I moved into my new place.",
                "vi": "Nó bắt đầu trở lại từ khi tôi chuyển đến nơi ở mới."
            }
        },
        {
            "content": "tại",
            "type": "adposition",
            "example": {
                "en": "No, I was just not into that conversation.",
                "vi": "Không, tại tôi không thích nên cúp thôi."
            }
        },
        {
            "content": "bên trong",
            "type": "",
            "example": {
                "en": "Divine nature breathes into us the desire to serve others.",
                "vi": "Thiên tính phát triển bên trong chúng ta một ước muốn để phục vụ những người khác."
            }
        }
    ]
}