{
    "word": "know",
    "type": [
        "verb",
        "noun"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/nō/",
            "/noʊ/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/nəʊ/"
        ]
    },
    "meanings": [
        {
            "content": "biết",
            "type": "verb",
            "example": {
                "en": "I know that you put your best effort into it.",
                "vi": "Tôi biết rằng anh đã cố gắng hết sức."
            }
        },
        {
            "content": "hiểu biết",
            "type": "verb",
            "example": {
                "en": "They will understand and know things that others cannot.",
                "vi": "Họ sẽ hiểu biết những điều mà những người khác không thể hiểu biết được."
            }
        },
        {
            "content": "biết rõ vấn đề",
            "type": "",
            "example": {}
        },
        {
            "content": "biết rõ về",
            "type": "",
            "example": {
                "en": "If you know me so well, then you know I won't go home.",
                "vi": "Nếu như biết rõ về tôi, thì anh biết tôi sẽ không về nhà."
            }
        },
        {
            "content": "biết tin",
            "type": "",
            "example": {
                "en": "Well, if you hear of anything about this guy, just let me know?",
                "vi": "Nếu cậu biết tin gì về tên này, cho tớ biết ngay nhé."
            }
        },
        {
            "content": "biết được",
            "type": "",
            "example": {
                "en": "To know the heart of one sorcerer is to know them all.",
                "vi": "Biết được trái tim của một pháp sư là có thể biết được toàn bộ bọn chúng."
            }
        },
        {
            "content": "hay biết",
            "type": "",
            "example": {
                "en": "These people are inviting their own extinction in through the front door, and they don't even know it.",
                "vi": "Con người góp phần tạo ra ngày tận thế mà không hay biết."
            }
        },
        {
            "content": "nhận biết",
            "type": "",
            "example": {
                "en": "You don't know how hard that is to know.",
                "vi": "Ngài cũng biết rằng rất khó để nhận biết."
            }
        },
        {
            "content": "nhận thức",
            "type": "verb",
            "example": {
                "en": "I don't know if you're aware of this, Gary, but we are not teenagers anymore.",
                "vi": "Tớ không biết liệu cậu có nhận thức được không, nhưng chúng ta không còn trẻ trâu nữa."
            }
        },
        {
            "content": "phân biệt được",
            "type": "",
            "example": {
                "en": "How do you know what's a glitch and what's me?",
                "vi": "Làm sao bà phân biệt được đâu là sự cố đâu là tôi?"
            }
        },
        {
            "content": "quen biết",
            "type": "",
            "example": {
                "en": "I think everyone who knows me and knows you is here.",
                "vi": "Những người quen em, và những người quen biết anh gần như đều có mặt."
            }
        },
        {
            "content": "đã biết mùi",
            "type": "",
            "example": {
                "en": "But like in the milk commercial, if you know what odor you want to detect,",
                "vi": "Nhưng, giống như trong quảng cáo sữa trên, nếu bạn đã biết mùi bạn muốn phát hiện,"
            }
        },
        {
            "content": "đã trải qua",
            "type": "",
            "example": {
                "en": "I do not want to know anything about the future you experienced.",
                "vi": "Tôi không muốn biết bất kì điều gì về tương lai cậu đã trải qua."
            }
        },
        {
            "content": "có quen",
            "type": "",
            "example": {
                "en": "Did Tom know Mary?",
                "vi": "Tom có quen Mary không?"
            }
        },
        {
            "content": "nhận",
            "type": "verb",
            "example": {
                "en": "I can't remember what Timothy looks like, but I'm sure I'll know him by sight.",
                "vi": "Tôi không sao nhớ nổi Timothy trông như thế nào, nhưng tôi tin chắc là tôi sẽ nhận ra anh ấy ngay."
            }
        },
        {
            "content": "thuộc",
            "type": "verb",
            "example": {
                "en": "There's a personal history in there for you to know by heart, too.",
                "vi": "Có một bản tiểu sử cá nhân ở trong kia để cho anh học thuộc lòng."
            }
        },
        {
            "content": "cảm thấy",
            "type": "verb",
            "example": {
                "en": "I know what it's like when someone disappoints you.",
                "vi": "Tôi hiểu cô cảm thấy thế nào khi ai đó làm cô thất vọng."
            }
        },
        {
            "content": "nhận ra",
            "type": "",
            "example": {
                "en": "I can't remember what Timothy looks like, but I'm sure I'll know him by sight.",
                "vi": "Tôi không sao nhớ nổi Timothy trông như thế nào, nhưng tôi tin chắc là tôi sẽ nhận ra anh ấy ngay."
            }
        }
    ]
}