{
    "word": "troubled",
    "type": [
        "adjective",
        "verb"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ˈtrəbəld/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ˈtrʌb(ə)ld/"
        ]
    },
    "meanings": [
        {
            "content": "rối loạn",
            "type": "adjective",
            "example": {
                "en": "Most people suffering from an anxiety disorder or depression have trouble sleeping .",
                "vi": "Hầu hết những người bị rối loạn lo âu hoặc trầm cảm đều cảm thấy khó ngủ ."
            }
        },
        {
            "content": "băn khoăn",
            "type": "adjective",
            "example": {
                "en": "His life had no direction, and that troubled him deeply.",
                "vi": "Cuộc đời anh không định hướng, và điều đó khiến anh băn khoăn vô cùng."
            }
        },
        {
            "content": "bồn chồn",
            "type": "adjective",
            "example": {
                "en": "He becomes greatly troubled and tells the three: “I am deeply grieved, even to death.",
                "vi": "Ngài cảm thấy bồn chồn nên nói với ba sứ đồ: “Tôi đau buồn đến chết mất."
            }
        },
        {
            "content": "gió bụi",
            "type": "",
            "example": {}
        },
        {
            "content": "hỗn loạn",
            "type": "",
            "example": {
                "en": "We live in a troubled world, a world of many challenges.",
                "vi": "Chúng ta sống trong một thế giới hỗn loạn, một thế giới có nhiều thử thách."
            }
        },
        {
            "content": "khó chịu",
            "type": "",
            "example": {
                "en": "Then you won't have any trouble signing this.",
                "vi": "Vậy thì chắc cô sẽ không thấy khó chịu khi kí vào đây chứ?"
            }
        },
        {
            "content": "không trong",
            "type": "",
            "example": {}
        },
        {
            "content": "không yên",
            "type": "adjective",
            "example": {
                "en": "But I was still troubled, and I was troubled because I felt this was capricious.",
                "vi": "Nhưng tôi vẫn thấy không yên tâm, không yên tâm vì nó dễ thay đổi."
            }
        },
        {
            "content": "lao tâm",
            "type": "",
            "example": {}
        },
        {
            "content": "lo lắng",
            "type": "adjective",
            "example": {
                "en": "Think of the anxiety that will no longer trouble our mind and heart.",
                "vi": "Hãy hình dung lòng và trí chúng ta không còn nặng trĩu lo lắng."
            }
        },
        {
            "content": "phiền phức",
            "type": "",
            "example": {
                "en": "Think about how much trouble I'll get into if you keep beating these people.",
                "vi": "Nghĩ xem, tôi sẽ gặp phiền phức nếu cậu cứ tiếp tục đánh những người này."
            }
        },
        {
            "content": "đục",
            "type": "",
            "example": {}
        }
    ]
}