{
    "word": "up",
    "type": [
        "adjective",
        "verb",
        "noun",
        "adverb",
        "adposition"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/əp/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ʌp/"
        ]
    },
    "meanings": [
        {
            "content": "lên",
            "type": "adverb, adposition",
            "example": {
                "en": "Tom tried to stand up, but he couldn't.",
                "vi": "Tom đã cố gắng đứng lên, nhưng anh ấy không làm được."
            }
        },
        {
            "content": "ở trên",
            "type": "",
            "example": {
                "en": "The fourth group, made up of your best riflemen, we'll have up here.",
                "vi": "Toán thứ tư, gồm những tay súng trường thiện xạ, chúng ta ở trên này."
            }
        },
        {
            "content": "hết",
            "type": "verb",
            "example": {
                "en": "It'll look even better at night, obviously, all lit up.",
                "vi": "Sẽ còn đẹp hơn vào buổi tối, rõ ràng là thế, khi bật hết đèn lên."
            }
        },
        {
            "content": "dậy",
            "type": "verb",
            "example": {
                "en": "She found it necessary to accustom her child to getting up early.",
                "vi": "Cô ấy nhận ra điều cần thiết là tập cho bọn trẻ của cô ấy thức dậy sớm."
            }
        },
        {
            "content": "đến",
            "type": "verb adposition",
            "example": {
                "en": "Don't forget to pick me up tomorrow morning.",
                "vi": "Đừng quên đến đón em sáng mai."
            }
        },
        {
            "content": "xong",
            "type": "adjective verb",
            "example": {
                "en": "I'll pick you up tomorrow after work.",
                "vi": "Tôi sẽ đón bạn vào ngày mai sau khi xong việc."
            }
        },
        {
            "content": "hoàn toàn",
            "type": "",
            "example": {
                "en": "My goal is to come up here independently.",
                "vi": "Mục tiêu của tôi là lên đây một cách hoàn toàn độc lập."
            }
        },
        {
            "content": "lên trên",
            "type": "",
            "example": {
                "en": "There were always rockets going up into the sky, up into space, going up there.",
                "vi": "Luôn có những tàu tên lửa phóng lên bầu trời, đi vào không gian, lên trên đó."
            }
        },
        {
            "content": "mạnh lên",
            "type": "",
            "example": {
                "en": "The proteins have to set up, strengthen and firm up.",
                "vi": "Các protein phải thiết lập, mạnh lên và củng cố."
            }
        },
        {
            "content": "to lên",
            "type": "",
            "example": {
                "en": "Turn up the radio a little bit.",
                "vi": "Bật radio to lên một chút đi."
            }
        },
        {
            "content": "đứng lên",
            "type": "",
            "example": {
                "en": "Tom tried to stand up, but he couldn't.",
                "vi": "Tom đã cố gắng đứng lên, nhưng anh ấy không làm được."
            }
        },
        {
            "content": "tới",
            "type": "adjective verb adposition",
            "example": {
                "en": "The meeting will have broken up by the time you arrive there.",
                "vi": "Cuộc họp sẽ giải tán trong khi bạn tới đó."
            }
        },
        {
            "content": "ngược dòng",
            "type": "",
            "example": {
                "en": "It's eight days up-river, and five days on the return.",
                "vi": "Nó đi ngược dòng tám ngày, và năm ngày trong chuyến về."
            }
        },
        {
            "content": "ngủ dậy",
            "type": "",
            "example": {
                "en": "I'll hose it off after he wakes up.",
                "vi": "Khi nào bố ngủ dậy, chị sẽ giặt cho."
            }
        },
        {
            "content": "nêu",
            "type": "",
            "example": {
                "en": "Shawn, quoted at the outset, sums matters up nicely.",
                "vi": "Em Shawn được nêu lên ở đầu bài tóm tắt lại vấn đề cách chí lý."
            }
        },
        {
            "content": "tới gần",
            "type": "",
            "example": {
                "en": "Then I ride up close and shoot him.",
                "vi": "Thì tôi sẽ xông tới gần và bắn hắn."
            }
        },
        {
            "content": "vất vả",
            "type": "",
            "example": {
                "en": "You have all worked very hard to get AmWorks up and running.",
                "vi": "Mọi người đã rất vất vả để Amworks đi vào hoạt động."
            }
        },
        {
            "content": "đưa ra",
            "type": "",
            "example": {
                "en": "What I come up with are forms like these.",
                "vi": "Những gì tôi đưa ra là những cấu trúc như thế này."
            }
        },
        {
            "content": "ngược",
            "type": "",
            "example": {
                "en": "As the sea level rises, the water's coming up, backflowing into our streets through our drains.",
                "vi": "Khi mực nước biển dâng lên, nước tràn ngược vào hết cái lỗ cống rãnh trên đường."
            }
        },
        {
            "content": "cừ",
            "type": "",
            "example": {
                "en": "I mean, he's a nice kid, but he passed up sleeping with Brandy, man.",
                "vi": "Ý mình là, nó là thằng cừ đấy, nhưng nó đã bỏ lỡ cơ hội ngủ với Brandy mà."
            }
        },
        {
            "content": "giỏi",
            "type": "adjective adverb",
            "example": {
                "en": "You can't just go up there and make music and think it's good enough.",
                "vi": "Bạn không thể chỉ viết nhạc và nghĩ như thế là đủ giỏi rồi."
            }
        },
        {
            "content": "chuyến tàu ngược",
            "type": "",
            "example": {}
        },
        {
            "content": "chuyến tàu về",
            "type": "",
            "example": {}
        },
        {
            "content": "dốc lên",
            "type": "",
            "example": {
                "en": "After an arduous climb up a steep mountain path, they clapped their hands to announce their arrival to the householder.",
                "vi": "Sau khi phải vất vả leo hết một đường dốc lên núi, các anh vỗ tay để báo hiệu cho chủ nhà ra đón."
            }
        },
        {
            "content": "người đang lên",
            "type": "",
            "example": {}
        },
        {
            "content": "ngược lên",
            "type": "",
            "example": {
                "en": "His son was a minister, the one they strung up.",
                "vi": "Con trai ông ta là một mục sư, người mà họ treo ngược lên."
            }
        },
        {
            "content": "sự lên",
            "type": "",
            "example": {
                "en": "Wow, she really traded up.",
                "vi": "Chà, cô ta thực sự lên đời."
            }
        },
        {
            "content": "sự thành công",
            "type": "",
            "example": {
                "en": "In this situation, is it really possible to bring up children successfully?",
                "vi": "Trong tình trạng này, có thể nào thật sự thành công trong việc nuôi dưỡng con cái không?"
            }
        },
        {
            "content": "sự thăng",
            "type": "",
            "example": {
                "en": "and seeking to move up in your organization.",
                "vi": "đang tìm kiếm sự thăng tiến trong tổ chức của mình."
            }
        },
        {
            "content": "thông thạo",
            "type": "",
            "example": {}
        },
        {
            "content": "tăng vọt lên",
            "type": "",
            "example": {
                "en": "It shoots up and it keeps going up.",
                "vi": "Nó tăng vọt lên và tiếp tục tăng lên."
            }
        },
        {
            "content": "tơi bời",
            "type": "verb",
            "example": {
                "en": "And you let your friends beat you up",
                "vi": "Mày còn để tụi bạn đánh mày tơi bời"
            }
        },
        {
            "content": "đột nhiên làm",
            "type": "",
            "example": {}
        },
        {
            "content": "đột nhiên nói",
            "type": "",
            "example": {}
        },
        {
            "content": "đột nhiên đứng dậy",
            "type": "",
            "example": {}
        },
        {
            "content": "đứng dậy",
            "type": "",
            "example": {
                "en": "When he finished speaking, he stood up and walked away.",
                "vi": "Nói xong,anh đứng dậy ra về."
            }
        },
        {
            "content": "ở cuối",
            "type": "",
            "example": {
                "en": "And he ended up hanging at the end of a rope with no possibility of getting up.",
                "vi": "Và tính mạng ông ấy bị treo ở cuối đoạn thừng mà không cách nào leo lên được."
            }
        },
        {
            "content": "trên",
            "type": "adjective adposition",
            "example": {
                "en": "We flush three hostiles topside, you light'em up.",
                "vi": "Chúng tôi đưa ba tên địch lên trên, các anh đốt chúng lên nhé."
            }
        },
        {
            "content": "cuối",
            "type": "noun",
            "example": {
                "en": "I finally came up with a great idea.",
                "vi": "Cuối cùng tôi cũng tìm được một ý tưởng tuyệt vời."
            }
        },
        {
            "content": "khó khăn",
            "type": "",
            "example": {
                "en": "Most people come up against a wall, they give up.",
                "vi": "Hầu hết mọi người khi gặp phải khó khăn, họ đều sẽ bỏ cuộc."
            }
        }
    ]
}