{
    "word": "upon",
    "type": [
        "adverb",
        "adposition"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/əˈpän/",
            "/əˈpɑn/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/əˈpɒn/"
        ]
    },
    "meanings": [
        {
            "content": "trên",
            "type": "adjective adposition",
            "example": {
                "en": "Perhaps there is a way for you to keep your head upon your shoulders.",
                "vi": "Có lẽ có một cách giúp ngươi vẫn giữ được cái đầu trên đôi vai mình."
            }
        },
        {
            "content": "ở trên",
            "type": "",
            "example": {
                "en": "How do you keep a wave upon the sand?",
                "vi": "Làm sao giữ sóng ở trên cát được?"
            }
        },
        {
            "content": "nhờ",
            "type": "",
            "example": {
                "en": "Or are you telling them that you still think of them as helpless infants who must rely upon you for everything?",
                "vi": "Hay bạn đang ngụ ý rằng con là một đứa trẻ kém cỏi, mọi việc đều phải nhờ cậy nơi bạn?"
            }
        },
        {
            "content": "theo",
            "type": "verb adposition",
            "example": {
                "en": "His horn washed up upon the riverbank, about six days past.",
                "vi": "Cái tù và của anh ấy trôi dọc theo sông, khoảng sáu ngày trước."
            }
        },
        {
            "content": "với",
            "type": "conjunction verb adposition",
            "example": {
                "en": "You must not be so severe upon yourself.",
                "vi": "Cha không phải khắt khe với bản thân thế đâu."
            }
        },
        {
            "content": "bằng",
            "type": "adjective noun adposition",
            "example": {
                "en": "Who is instructed to “gird sackcloth upon the loins,” and why?",
                "vi": "Ai được bảo “hãy thắt lưng bằng bao gai”, và tại sao?"
            }
        },
        {
            "content": "lúc",
            "type": "noun",
            "example": {
                "en": "A lot of financial responsibilities are laid upon me right now.",
                "vi": "Rất nhiều trách nhiệm về tài chính đang được đặt lên vai tôi lúc này."
            }
        },
        {
            "content": "chống lại",
            "type": "",
            "example": {
                "en": "Brothers and sisters, the hour is upon us.",
                "vi": "Các anh chị em thời gian đang chống lại chúng ta."
            }
        },
        {
            "content": "nhờ vào",
            "type": "",
            "example": {
                "en": "Relying upon the Savior’s Atonement, we can change.",
                "vi": "Nhờ vào Sự Chuộc Tội của Đấng Cứu Rỗi, chúng ta có thể thay đổi."
            }
        },
        {
            "content": "trong khong",
            "type": "",
            "example": {}
        },
        {
            "content": "trong lúc",
            "type": "",
            "example": {
                "en": "To be so put upon, so overlooked, when all the while you have such power.",
                "vi": "Khi bị ngược đãi, phớt lờ, trong lúc ngươi có sức mạnh nhường này."
            }
        },
        {
            "content": "vào lúc",
            "type": "",
            "example": {
                "en": "He happened upon me a moment after I first read your letter.",
                "vi": "Anh ấy xuất hiện trước mặt em vào lúc em đọc xong thư của chị."
            }
        }
    ]
}