{
    "word": "vessel",
    "type": [
        "verb",
        "noun"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ˈvesəl/",
            "/ˈvɛsəl/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ˈvɛs(ə)l/"
        ]
    },
    "meanings": [
        {
            "content": "thuyền",
            "type": "noun",
            "example": {
                "en": "A light from a stranded vessel gleams far off.",
                "vi": "Một ánh đèn lóe lên từ con thuyền mắc cạn ở nơi xa."
            }
        },
        {
            "content": "bình",
            "type": "noun",
            "example": {
                "en": "And what I have here is an empty glass vessel.",
                "vi": "Và những gì tôi có ở đây là một bình thủy tinh rỗng."
            }
        },
        {
            "content": "mạch",
            "type": "noun",
            "example": {
                "en": "Why should we care about the blood vessel of a tumor?",
                "vi": "Tại sao chúng ta cần quan tâm đến mạch máu trong khối u?"
            }
        },
        {
            "content": "thuyền lớn",
            "type": "noun",
            "example": {
                "en": "And after graduating to larger vessels, they too began to migrate from port to port.",
                "vi": "Và khi đặt chân lên thuyền lớn hơn, chúng bắt đầu đi từ cảng này sang cảng khác."
            }
        },
        {
            "content": "tàu thuỷ",
            "type": "noun",
            "example": {}
        },
        {
            "content": "tàu",
            "type": "noun",
            "example": {
                "en": "You have been selected as the vessel for the ultimate evil.",
                "vi": "Anh được lựa chọn là con tàu hồi sinh của ác quỷ tối thượng."
            }
        },
        {
            "content": "chậu",
            "type": "noun",
            "example": {
                "en": "He then commanded Baruch to seal these deeds of purchase in an earthenware vessel for safekeeping.",
                "vi": "Sau đó ông bảo Ba-rúc lưu những tờ khế này trong một chậu đất và niêm phong lại."
            }
        },
        {
            "content": "chai",
            "type": "noun",
            "example": {
                "en": "but this is — children are not empty vessels.",
                "vi": "trẻ em không phải là những cái chai rỗng."
            }
        },
        {
            "content": "chén",
            "type": "noun",
            "example": {
                "en": "Bring me the golden vessels from the temple of Jerusalem.",
                "vi": "Hãy mang những chén vàng lấy từ đền thờ Jerusalem ra đây."
            }
        },
        {
            "content": "mạch máu",
            "type": "noun",
            "example": {
                "en": "Angiogenesis inhibitors prevent the tumors from creating blood vessels.",
                "vi": "Thuốc ức chế mạch máu sẽ ngăn cản việc hình thành mạch máu của khối u."
            }
        },
        {
            "content": "tàu lớn",
            "type": "noun",
            "example": {
                "en": "How does a vessel of this size function without a crew?",
                "vi": "Làm sao con tàu lớn mức này hoạt động mà không có phi hành đoàn?"
            }
        },
        {
            "content": "vại",
            "type": "noun",
            "example": {
                "en": "Then the difficulty lies not with the seed, but within the vessel.",
                "vi": "Vậy nghĩa là \" hạt giống \" không có vấn đề gì nhưng rất khó chui vào cái'vại \"."
            }
        },
        {
            "content": "lọ",
            "type": "noun",
            "example": {
                "en": "(1 Peter 3:7) Imagine handling a delicate porcelain vessel, obviously more fragile than a wooden one.",
                "vi": "(1 Phi-e-rơ 3:7) Hãy thử tưởng tượng mình cầm một lọ sứ, hẳn nhiên là dễ vỡ hơn cái bằng gỗ."
            }
        },
        {
            "content": "thùng",
            "type": "noun",
            "example": {
                "en": "You put it into a 15-liter vessel, about three gallons,",
                "vi": "Chúng ta đặt nó vào thùng 15 lít, chứa được khoảng 3 gallon chất lỏng,"
            }
        },
        {
            "content": "ống",
            "type": "noun",
            "example": {
                "en": "The cardiologist inserts the catheter into a blood vessel in the leg that leads to the heart .",
                "vi": "Bác sĩ tim mạch chèn ống thông vào một mạch máu ở cẳng chân dẫn đến tim ."
            }
        },
        {
            "content": "船",
            "type": "",
            "example": {}
        },
        {
            "content": "tàu thủy",
            "type": "noun",
            "example": {}
        }
    ]
}