{
    "word": "was",
    "type": [
        "verb"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/wəz/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/wɒz/",
            "/wəz/"
        ]
    },
    "meanings": [
        {
            "content": "be to phải",
            "type": "",
            "example": {}
        },
        {
            "content": "bị",
            "type": "verb noun",
            "example": {
                "en": "Please explain the reason why she was arrested.",
                "vi": "Xin hãy giải thích lý do vì sao cô ta đã bị bắt giữ."
            }
        },
        {
            "content": "có",
            "type": "verb",
            "example": {
                "en": "I was surprised at the sudden thunder.",
                "vi": "Tôi sửng sốt vì đột nhiên có tiếng sấm."
            }
        },
        {
            "content": "diễn ra",
            "type": "",
            "example": {
                "en": "There was an interest in what was going on.",
                "vi": "Có một điều thú vị nằm trong những điều đã diễn ra."
            }
        },
        {
            "content": "giá",
            "type": "noun",
            "example": {
                "en": "Please appreciate how honest I was just now.",
                "vi": "Làm ơn hãy đánh giá cao việc tớ tự hào thế nào bây giờ đi."
            }
        },
        {
            "content": "là",
            "type": "verb noun",
            "example": {
                "en": "He told me his father was a doctor.",
                "vi": "Anh ấy bảo tôi rằng cha của anh ấy là một bác sĩ."
            }
        },
        {
            "content": "sẽ",
            "type": "",
            "example": {
                "en": "Markku was twenty-two and certain that he was the next Einstein.",
                "vi": "Lúc đó Markku hai mươi mốt tuổi và chắc chắn rằng mình sẽ giống như Einstein."
            }
        },
        {
            "content": "sống",
            "type": "verb noun",
            "example": {
                "en": "Jim was willing to sacrifice your life for his own rewards.",
                "vi": "Jim muốn đổi mạng sống của cháu lấy phần thưởng cho hắn."
            }
        },
        {
            "content": "thì",
            "type": "conjunction noun adverb",
            "example": {
                "en": "I came home from work and he was back.",
                "vi": "Tôi thì từ chỗ làm về còn anh ta thì đã quay lại."
            }
        },
        {
            "content": "trở nên",
            "type": "verb",
            "example": {
                "en": "The family said farewell, and once again the room was still.",
                "vi": "Gia đình nói lời từ giã, và một lần nữa căn phòng trở nên yên tịnh."
            }
        },
        {
            "content": "trở thành",
            "type": "verb",
            "example": {
                "en": "Beethoven was deaf in his late years.",
                "vi": "Beethoven trở thành điếc vào những năm cuối đời."
            }
        },
        {
            "content": "tồn tại",
            "type": "",
            "example": {
                "en": "This was a time when there was no freedom of thought in Italy.",
                "vi": "Ngày ấy, tự do suy nghĩ không tồn tại ở Italy."
            }
        },
        {
            "content": "xảy ra",
            "type": "verb",
            "example": {
                "en": "When the big earthquake happened, I was only ten.",
                "vi": "Một trận động đất lớn đã xảy ra khi tôi mới chỉ mười tuổi."
            }
        },
        {
            "content": "đang",
            "type": "",
            "example": {
                "en": "Tom was looking for some people to help him move his piano.",
                "vi": "Tom đang tìm người giúp anh ấy chuyển cái piano đi."
            }
        },
        {
            "content": "được",
            "type": "verb",
            "example": {
                "en": "The statue was carved from a block of cherry wood.",
                "vi": "Bức tượng được chạm khắc từ gỗ cây anh đào."
            }
        },
        {
            "content": "định",
            "type": "verb",
            "example": {
                "en": "I was gonna swing by this weekend and use the machine.",
                "vi": "Và con định cuối tuần này bơi trong đống đó."
            }
        },
        {
            "content": "ở",
            "type": "verb adposition",
            "example": {
                "en": "I was here all the time.",
                "vi": "Tôi ở đây từ đó đến giờ."
            }
        }
    ]
}