{
    "word": "way",
    "type": [
        "verb",
        "noun",
        "adverb",
        "interjection"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/wā/",
            "/weɪ/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/weɪ/"
        ]
    },
    "meanings": [
        {
            "content": "cách",
            "type": "noun",
            "example": {
                "en": "I can't understand her way of thinking at all.",
                "vi": "Tôi hoàn toàn không thể hiểu cách suy nghĩ của cô ấy."
            }
        },
        {
            "content": "đường đi",
            "type": "",
            "example": {
                "en": "We always walk by the post office on the way to work.",
                "vi": "Chúng tôi luôn đi bộ ngang qua bưu điện trên đường đi làm"
            }
        },
        {
            "content": "đường",
            "type": "noun",
            "example": {
                "en": "He went his way, I go my way.",
                "vi": "Anh đi đường anh , tôi đi đường tôi."
            }
        },
        {
            "content": "hướng",
            "type": "noun",
            "example": {
                "en": "Well, I don't think it was supposed to happen that way.",
                "vi": "Tôi không nghĩ chuyện lại xảy ra theo hướng đó."
            }
        },
        {
            "content": "phương",
            "type": "noun",
            "example": {
                "en": "In what ways might this phrase help priesthood holders?",
                "vi": "Cụm từ này có thể giúp những người nắm giữ chức tư tế trong các phương diện nào?"
            }
        },
        {
            "content": "phía",
            "type": "noun",
            "example": {
                "en": "Draw all the way back now to your cheek.",
                "vi": "Kéo sợi dây cung căng lên, về phía má."
            }
        },
        {
            "content": "lối",
            "type": "noun",
            "example": {
                "en": "The blind man felt his way toward the exit.",
                "vi": "Người đàn ông mù lần mò về phía lối ra."
            }
        },
        {
            "content": "chiều",
            "type": "verb noun",
            "example": {
                "en": "Round trip? Only one-way.",
                "vi": "Vé khứ hồi phải không? Một chiều thôi."
            }
        },
        {
            "content": "cách thức",
            "type": "",
            "example": {
                "en": "How do we make the Lord’s ways our ways?",
                "vi": "Làm thế nào chúng ta làm cho những cách thức của Chúa thành cách thức của mình?"
            }
        },
        {
            "content": "khoảng cách",
            "type": "noun",
            "example": {
                "en": "It's a long way from knowing he was killing them.",
                "vi": "Nó là một khoảng cách dài để biết anh ta đã giết chúng."
            }
        },
        {
            "content": "mức độ",
            "type": "",
            "example": {
                "en": "We don't have a way to measure the animals'emotional experience.",
                "vi": "Chúng ta không có cách nào để đo mức độ cảm xúc của động vật."
            }
        },
        {
            "content": "phương pháp",
            "type": "noun",
            "example": {
                "en": "But one other thing that we have to rethink is the way that we dye our clothes.",
                "vi": "Nhưng có một thứ khác ta cần phải cân nhắc, đó là phương pháp nhuộm đồ."
            }
        },
        {
            "content": "việc",
            "type": "noun",
            "example": {
                "en": "Then I will have to find some other way of occupying my time.",
                "vi": "Vậy tôi sẽ tìm việc gì khác để làm cho hết thời gian."
            }
        },
        {
            "content": "đằng",
            "type": "noun",
            "example": {
                "en": "So, in through that door there, all the way in the back by the kitchen.",
                "vi": "Thế nên, lôi từ cửa kia qua, phía đằng sau nhà bếp."
            }
        },
        {
            "content": "cung cách",
            "type": "noun",
            "example": {
                "en": "It's beautiful in its own way.",
                "vi": "Nó đẹp theo cung cách riêng của nó."
            }
        },
        {
            "content": "mặt",
            "type": "noun",
            "example": {
                "en": "So, go to the store warehouse in Metairie, that way you're not here.",
                "vi": "Vậy ai đã đến đây khi anh không có mặt?"
            }
        },
        {
            "content": "nếp",
            "type": "noun",
            "example": {}
        },
        {
            "content": "ngả",
            "type": "noun",
            "example": {}
        },
        {
            "content": "đạo",
            "type": "noun",
            "example": {
                "en": "A vast and terrible army is coming this way.",
                "vi": "Một đạo quân đông đúc và khủng khiếp đang tới đây."
            }
        },
        {
            "content": "nẻo",
            "type": "noun",
            "example": {
                "en": "The ball went one way and the goalkeeper went the other.",
                "vi": "Bóng đi một đường và thủ môn đi một nẻo."
            }
        },
        {
            "content": "loại",
            "type": "noun",
            "example": {
                "en": "That was discarded because it was way too expensive.",
                "vi": "Tàu này bị loại bỏ vì quá đắt."
            }
        },
        {
            "content": "phách",
            "type": "noun",
            "example": {
                "en": "They act it out. They act it out, and they're on their way",
                "vi": "Chúng bèn phá bĩnh. Chúng phá phách và trượt dài,"
            }
        },
        {
            "content": "biện pháp",
            "type": "",
            "example": {
                "en": "They are a vital way for countries to raise funds .",
                "vi": "Chúng là một biện pháp cực kỳ quan trọng để các nước huy vốn ."
            }
        },
        {
            "content": "bằng con đường",
            "type": "",
            "example": {
                "en": "But it's very hard to create that in standard ways.",
                "vi": "Nhưng rất khó để tạo ra nó bằng con đường chính thống."
            }
        },
        {
            "content": "chừng mực",
            "type": "",
            "example": {
                "en": "In a way, it is Hubble's equivalent for the infrared.",
                "vi": "Trong một chừng mực nào đó, nó tương đương với kính Hubble về hồng ngoại."
            }
        },
        {
            "content": "coi như là",
            "type": "",
            "example": {
                "en": "Sadly, for my kind, coming here is a one-way ticket.",
                "vi": "Buồn cái là với người như bọn tôi sang đây coi như là vé một chiều rồi."
            }
        },
        {
            "content": "con đường",
            "type": "noun",
            "example": {
                "en": "Now we can offer you two a way out, a way through.",
                "vi": "Chúng tao sẽ cho bọn mày một con đường thoát, một con đường."
            }
        },
        {
            "content": "cá tính",
            "type": "",
            "example": {
                "en": "Certain ways and manners too are open to misinterpretation.",
                "vi": "Một số cá tính và cử chỉ cũng dễ bị hiểu lầm."
            }
        },
        {
            "content": "giả thuyết",
            "type": "",
            "example": {
                "en": "Sometimes the best way to test a hypothesis",
                "vi": "Đôi khi cách tốt nhất để thử nghiệm một giả thuyết"
            }
        },
        {
            "content": "giả định",
            "type": "",
            "example": {}
        },
        {
            "content": "lề lối",
            "type": "noun",
            "example": {
                "en": "He's a stranger to our ways.",
                "vi": "Cậu ta là người lạ trong lề lối của chúng ta."
            }
        },
        {
            "content": "lề thói",
            "type": "",
            "example": {
                "en": "\" I belong to the warrior in whom the old ways have joined the new. \"",
                "vi": "Tôi thuộc về chiến binh mà nơi người đó lề thói cũ và mới đã hòa nhập."
            }
        },
        {
            "content": "lối đi",
            "type": "",
            "example": {
                "en": "Does this look like the right way to you?",
                "vi": "Cô có thấy nó giống lối đi đúng không?"
            }
        },
        {
            "content": "ngành kinh doanh",
            "type": "",
            "example": {}
        },
        {
            "content": "như là",
            "type": "",
            "example": {
                "en": "Same way one loses a truckload of weapons.",
                "vi": "Cũng giống như là mất dấu một xe tải đầy vũ khí vậy."
            }
        },
        {
            "content": "như thể",
            "type": "",
            "example": {
                "en": "seem to be getting in the way of their solving their own problems.",
                "vi": "dường như thể hiện trong cách họ giải quyết vấn đề riêng."
            }
        },
        {
            "content": "nẻo đường",
            "type": "",
            "example": {
                "en": "in a lot of ways I'm grateful for it.",
                "vi": "trong đó lại có rất nhiều nẻo đường làm tôi biết ơn"
            }
        },
        {
            "content": "phương diện",
            "type": "",
            "example": {
                "en": "In one way or another, many are heavy laden.",
                "vi": "Trong phương diện này hay phương diện khác, nhiều người đang mang những gánh nặng."
            }
        },
        {
            "content": "phương kế",
            "type": "",
            "example": {
                "en": "6 They search out new ways of wrongdoing;",
                "vi": "6 Chúng nghĩ ra nhiều phương kế xấu xa"
            }
        },
        {
            "content": "phương sách",
            "type": "",
            "example": {}
        },
        {
            "content": "phạm vi",
            "type": "",
            "example": {
                "en": "There's no way we can narrow that down, bro.",
                "vi": "Làm gì có cách nào để thu hẹp phạm vi chứ."
            }
        },
        {
            "content": "phạm vi hoạt động",
            "type": "",
            "example": {}
        },
        {
            "content": "quy mô",
            "type": "noun",
            "example": {
                "en": "because that is the only way that they can get to scale.",
                "vi": "vì chỉ có cách đó các công ty mới có thể mở rộng quy mô."
            }
        },
        {
            "content": "quãng đường",
            "type": "",
            "example": {
                "en": "I've come a long way to meet you, to help you.",
                "vi": "Chú đã đi cả quãng đường dài để gặp các cháu, để giúp các cháu."
            }
        },
        {
            "content": "sự chạy",
            "type": "",
            "example": {}
        },
        {
            "content": "sự thịnh vượng",
            "type": "",
            "example": {
                "en": "I believe that the only way we can sustain growth and prosperity in the West",
                "vi": "Tôi tin rằng cách duy nhất giúp ta duy trì sự thịnh vượng và phát triển"
            }
        },
        {
            "content": "sự tiến bộ",
            "type": "",
            "example": {
                "en": "In what ways are advancement and maturity made manifest?",
                "vi": "Sự tiến bộ và sự thành thục được thấy rõ qua những cách nào?"
            }
        },
        {
            "content": "thẩm quyền",
            "type": "",
            "example": {
                "en": "What I have to say is way above your pay grade.",
                "vi": "Việc tôi cần nói vượt quá thẩm quyền của ông."
            }
        },
        {
            "content": "thể cách",
            "type": "noun",
            "example": {
                "en": "this is apocryphal by the way, but I don't care —",
                "vi": "có thể cách đó không chính xác, nhưng tôi không quan tâm —"
            }
        },
        {
            "content": "tình hình",
            "type": "noun",
            "example": {
                "en": "However , over the past year , that has changed in a dramatic way .",
                "vi": "Tuy nhiên , trong năm qua tình hình đã thay đổi một cách đáng kể ."
            }
        },
        {
            "content": "tình thế",
            "type": "",
            "example": {
                "en": "But it could just as easily have gone the other way.",
                "vi": "Nhưng tình thế dễ xoay ngược lắm đó."
            }
        },
        {
            "content": "tình trạng",
            "type": "",
            "example": {
                "en": "I was in a bad way when I got here.",
                "vi": "Con đang trong tình trạng khó khăn khi tới đây."
            }
        },
        {
            "content": "tốc độ",
            "type": "noun",
            "example": {
                "en": "But you're not getting your speed the same way Barry got his.",
                "vi": "Nhưng con không có được tốc độ của mình như cái cách mà Barry đã có."
            }
        },
        {
            "content": "vùng ở gần",
            "type": "",
            "example": {}
        },
        {
            "content": "đi qua",
            "type": "",
            "example": {
                "en": "I walked through the emergency department on my way home.",
                "vi": "Tôi đi qua phòng cấp cứu trên đường về nhà."
            }
        },
        {
            "content": "đoạn đường",
            "type": "",
            "example": {
                "en": "Our last stop was under a cherry tree a short way from the house .",
                "vi": "Cuối cùng chúng tôi dừng lại dưới tán cây anh đào cách nhà một đoạn đường ngắn ."
            }
        },
        {
            "content": "đường lối",
            "type": "",
            "example": {
                "en": "But man’s ways are not and never will be the Lord’s ways.",
                "vi": "Nhưng đường lối của con người không phải và không bao giờ sẽ là đường lối của Chúa."
            }
        },
        {
            "content": "đồ",
            "type": "verb noun",
            "example": {
                "en": "By the way, I had to throw in the furniture.",
                "vi": "Nhân tiện, tôi phải chuyển đồ gỗ vào trước."
            }
        },
        {
            "content": "phương thức",
            "type": "noun",
            "example": {
                "en": "So its way of doing farming has to change .",
                "vi": "Vì vậy cần phải thay đổi phương thức canh tác ."
            }
        },
        {
            "content": "thói quen",
            "type": "",
            "example": {
                "en": "Perhaps we once had the habit of pressing matters until we got our way.",
                "vi": "Có lẽ một thời chúng ta có thói quen muốn mọi sự theo ý chúng ta."
            }
        },
        {
            "content": "đường giao thông",
            "type": "",
            "example": {
                "en": "It is everyone’s sure way to know; it is everyone’s lifeline to heaven.",
                "vi": "Đó là cách chắc chắn cho mọi người để biết; đó là đường giao thông huyết mạch đến thiên thượng."
            }
        }
    ]
}