{
    "word": "were",
    "type": [
        "verb",
        "noun"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/wər/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/wə/"
        ]
    },
    "meanings": [
        {
            "content": "be to phi",
            "type": "",
            "example": {}
        },
        {
            "content": "bị",
            "type": "verb",
            "example": {
                "en": "Ten people were packed into the small room.",
                "vi": "Mười người bị nhét vào một căn phòng nhỏ."
            }
        },
        {
            "content": "có",
            "type": "verb",
            "example": {
                "en": "I brought some calculations in case you were feeling a bit better.",
                "vi": "Tôi có mang theo một vài phép tính phòng trường hợp cậu khoẻ lên."
            }
        },
        {
            "content": "diễn ra",
            "type": "",
            "example": {
                "en": "If things were heading better, You could be by his side.",
                "vi": "Nếu mọi chuyện diễn ra tốt hơn, anh có thể ở bên cạnh cha."
            }
        },
        {
            "content": "giá",
            "type": "noun",
            "example": {
                "en": "Diego stole the right stones, but he had no idea they were worthless.",
                "vi": "Diego lấy cắp đúng mấy viên đá đó nhưng không hề biết chúng vô giá trị."
            }
        },
        {
            "content": "là",
            "type": "verb noun",
            "example": {
                "en": "Tom and I were meant for each other.",
                "vi": "Tôi và Tom đã từng là thứ gì đó của nhau."
            }
        },
        {
            "content": "sẽ",
            "type": "",
            "example": {
                "en": "But I stopped believing you were coming back.",
                "vi": "Nhưng tôi đã ngừng tin bọn cô sẽ quay lại."
            }
        },
        {
            "content": "sống",
            "type": "verb noun",
            "example": {
                "en": "When they moved in together, I figured that's where things were headed.",
                "vi": "Khi họ chuyển về sống với nhau, tớ nghĩ rằng mọi chuyện đã ổn thỏa."
            }
        },
        {
            "content": "thì",
            "type": "conjunction noun adverb",
            "example": {
                "en": "We were right under their noses, and they didn't even see us!",
                "vi": "Chúng ta dưới ngay cái mũi họ, còn họ thì lại không hề thấy chúng ta!"
            }
        },
        {
            "content": "trở nên",
            "type": "verb",
            "example": {
                "en": "And then it started to get wild, and people were getting freaky in the pool and stuff.",
                "vi": "Rồi mọi thứ trở nên điên cuồng, và mọi người trở nên điên rồ trong hồ bơi."
            }
        },
        {
            "content": "trở thành",
            "type": "verb",
            "example": {
                "en": "We were practically brother and sister before we were man and wife.",
                "vi": "Chúng tôi cũng như là anh em trước khi trở thành vợ chồng."
            }
        },
        {
            "content": "tồn tại",
            "type": "",
            "example": {
                "en": "I've always known that there were people like you out there.",
                "vi": "Tôi luôn biết có những người như các bạn tồn tại."
            }
        },
        {
            "content": "xy ra",
            "type": "",
            "example": {}
        },
        {
            "content": "đang",
            "type": "",
            "example": {
                "en": "A bunch of people were standing outside waiting.",
                "vi": "Cả đống người đang đứng bên ngoài chờ."
            }
        },
        {
            "content": "được",
            "type": "verb",
            "example": {
                "en": "The fronts of the houses were hung with flags.",
                "vi": "mặt tiền các ngôi nhà đều đã được treo cờ."
            }
        },
        {
            "content": "định",
            "type": "verb",
            "example": {
                "en": "I didn't know you were thinking about going to college.",
                "vi": "Bố không biết con định học đại học đấy."
            }
        },
        {
            "content": "ở",
            "type": "verb adposition",
            "example": {
                "en": "Tom's kids were here a while ago looking for him.",
                "vi": "Mấy đứa trẻ nhà Tom đã ở đây một lúc trước để tìm anh ta."
            }
        }
    ]
}