{
    "word": "widowed",
    "type": [
        "adjective",
        "verb"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ˈwidōd/",
            "/ˈwɪdoʊd/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ˈwɪdəʊd/"
        ]
    },
    "meanings": [
        {
            "content": "goá",
            "type": "adjective",
            "example": {
                "en": "I was still a young woman when Savage left me a widow.",
                "vi": "Khi tôi từng là một cô gái trẻ cho đến khi Savage biến tôi thành goá phụ."
            }
        },
        {
            "content": "góa",
            "type": "adjective",
            "example": {
                "en": "These were women who had not married, were divorced, or were widowed.",
                "vi": "Một số phụ nữ này chưa kết hôn, đã ly dị, hoặc góa phụ."
            }
        },
        {
            "content": "bị cướp mất",
            "type": "",
            "example": {}
        },
        {
            "content": "bị mất",
            "type": "",
            "example": {
                "en": "She does not imagine that she could become “a widow,” losing her imperial ruler as well as her “children,” or populace.",
                "vi": "Nó không hề nghĩ là mình có thể bị “góa-bụa”, tức bị mất hoàng đế cũng như “con-cái”, hay là thần dân."
            }
        },
        {
            "content": "goá bụa",
            "type": "adjective",
            "example": {
                "en": "The people also maltreated those who were defenseless —the “fatherless boy and widow.”",
                "vi": "Người ta cũng hiếp đáp những người thân cô thế cô là “kẻ mồ-côi cùng người goá-bụa” (câu 7)."
            }
        },
        {
            "content": "góa chồng",
            "type": "",
            "example": {
                "en": "Sandra has an older friend, Elaine, who has been a widow for some six years.",
                "vi": "Sandra có một người bạn lớn tuổi hơn tên là Elaine đã góa chồng khoảng sáu năm."
            }
        },
        {
            "content": "không có",
            "type": "",
            "example": {
                "en": "Not much industry in this part of the world, so he's turned to his widowed mother for help.",
                "vi": "Ở đây không có nhiều công việc, nên anh ta quay sang người mẹ góa của mình. \" Góa à? \""
            }
        },
        {
            "content": "góa vợ",
            "type": "",
            "example": {
                "en": "Daniel is a widower who has six children.",
                "vi": "Anh Daniel góa vợ và có sáu con."
            }
        }
    ]
}