{
    "word": "will",
    "type": "verb, noun",
    "spelling": "/wɪl/, [wɪɫ]",
    "meanings": [
        {
            "content": "sẽ",
            "type": "verb, adverb",
            "example": {
                "en": "Such a program will help the rich but harm the poor.",
                "vi": "Một chương trình như vậy sẽ giúp đỡ người giàu có hại tới người nghèo."
            }
        },
        {
            "content": "ý chí",
            "type": "noun",
            "example": {
                "en": "He will give you the strength and the will to pursue what is right!",
                "vi": "Ngài sẽ cho bạn sức mạnh và ý chí theo đuổi điều phải!"
            }
        },
        {
            "content": "chúc thư",
            "type": "noun",
            "example": {
                "en": "Is she below the criteria established in her will?",
                "vi": "Chị ấy ở dưới mức đã ghi trong chúc thư? Vâng."
            }
        },
        {
            "content": "muốn",
            "type": "verb",
            "example": {
                "en": "I don't think Tom will want to go with us.",
                "vi": "Tôi không nghĩ Tom sẽ muốn đi với chúng ta."
            }
        },
        {
            "content": "di chúc",
            "type": "noun",
            "example": {
                "en": "Come to my hanging, I'll put you in my will.",
                "vi": "Em có thể đến xem tôi bị treo cổ và tôi sẽ thêm tên em vào di chúc."
            }
        },
        {
            "content": "chí",
            "type": "noun",
            "example": {
                "en": "Of course, migration will become even more important.",
                "vi": "Tất nhiên, việc di cư sẽ thậm chí còn trở nên quan trọng hơn nữa."
            }
        },
        {
            "content": "định",
            "type": "verb",
            "example": {
                "en": "Do you think mankind will someday colonize the Moon?",
                "vi": "Bạn thực sự nghĩ rằng con người một ngày nào đó có thể định cư trên Mặt trăng không?"
            }
        },
        {
            "content": "nếu",
            "type": "conjunction",
            "example": {
                "en": "How will poor Dom get on without his mother?",
                "vi": "Làm thế nào Dom tội nghiệp sống được nếu thiếu mẹ nó?"
            }
        },
        {
            "content": "sẵn sàng",
            "type": "adjective",
            "example": {
                "en": "He or she will be willing to talk kindly but openly when needed.",
                "vi": "Người ấy sẽ sẵn sàng nói chuyện một cách nhân từ, nhưng thẳng thắn khi cần."
            }
        },
        {
            "content": "buộc",
            "type": "verb",
            "example": {
                "en": "But, if I won you will have to wear a ponytail for a month.",
                "vi": "Nhưng nếu mình thắng cậu, Cậu phải buộc tóc đuôi ngựa một tháng!"
            }
        },
        {
            "content": "tất nhiên",
            "type": "adverb",
            "example": {
                "en": "I will be resuming my campaign tomorrow and Claire will, of course, be staying here.",
                "vi": "Tôi sẽ tiếp tục chiến dịch của mình vào ngày mai và Claire, tất nhiên, sẽ ở đây."
            }
        },
        {
            "content": "lòng",
            "type": "noun",
            "example": {
                "en": "Will you please advise him to work harder?",
                "vi": "Bạn sẽ vui lòng khuyên anh ấy làm việc chăm chỉ hơn không?"
            }
        },
        {
            "content": "thuận",
            "type": "",
            "example": {
                "en": "Dominic will have no choice but to reach out to make a deal.",
                "vi": "Dominic không còn lựa chọn phải tiếp cận tới ông để thỏa thuận."
            }
        },
        {
            "content": "phi",
            "type": "noun Prefix conjunction verb",
            "example": {
                "en": "You will not speak unless called upon.",
                "vi": "Ngươi không được nói, trừ phi được cho phép."
            }
        },
        {
            "content": "bắt buộc",
            "type": "",
            "example": {
                "en": "I will tell them every day, we must accomplish this.",
                "vi": "Tôi sẽ nói với họ hàng ngày, chúng ta bắt buộc phải hoàn thành sứ mệnh này."
            }
        },
        {
            "content": "bằng lòng",
            "type": "",
            "example": {
                "en": "If you are willing, we can start all over again.",
                "vi": "Nếu như em bằng lòng, mình bắt đầu lại lần nữa."
            }
        },
        {
            "content": "chắc là",
            "type": "",
            "example": {
                "en": "I'm not sure how long this battery will last.",
                "vi": "Em không chắc là pin sẽ trụ được đến lúc nào."
            }
        },
        {
            "content": "có quyết chí",
            "type": "",
            "example": {}
        },
        {
            "content": "có thể",
            "type": "verb",
            "example": {
                "en": "Do you think mankind will someday colonize the Moon?",
                "vi": "Bạn thực sự nghĩ rằng con người một ngày nào đó có thể định cư trên Mặt trăng không?"
            }
        },
        {
            "content": "giá mà",
            "type": "",
            "example": {
                "en": "We will accept 20% less than what the Carney Cattle Company is asking.",
                "vi": "Chúng tôi chấp nhận thấp hơn 20% giá mà công ty gia súc Carney yêu cầu."
            }
        },
        {
            "content": "hẳn là",
            "type": "",
            "example": {
                "en": "When starting a conversation, you will likely have a subject in mind.",
                "vi": "Khi bắt đầu cuộc nói chuyện, chắc hẳn là bạn nghĩ sẵn một đề tài."
            }
        },
        {
            "content": "nghị lực",
            "type": "noun",
            "example": {
                "en": "But good-natured humor and pleasant company can refresh your mind and increase your will to live.",
                "vi": "Nhưng sự dí dỏm và những người bạn vui vẻ có thể làm tâm trí bạn tươi tỉnh và tăng thêm nghị lực sống."
            }
        },
        {
            "content": "nguyện vọng",
            "type": "",
            "example": {
                "en": "Shall be set to purpose by the will of Marcus Crassus alone.",
                "vi": "Nên chúng sẽ nghe theo nguyện vọng của một mình Marcus Crassus này."
            }
        },
        {
            "content": "nhất định sẽ",
            "type": "",
            "example": {
                "en": "Just continue to will definitely sky high sea large",
                "vi": "Chỉ cần tiếp tục tiến lên nhất định sẽ trời cao biển rộng"
            }
        },
        {
            "content": "sự hăng say",
            "type": "",
            "example": {}
        },
        {
            "content": "sự quyết chí",
            "type": "",
            "example": {}
        },
        {
            "content": "sự quyết tâm",
            "type": "",
            "example": {
                "en": "Firstly, I will kill your Captain to demonstrate my resolve.",
                "vi": "Đầu tiên, ta sẽ giết cơ trưởng của ngươi để thể hiện sự quyết tâm của ta."
            }
        },
        {
            "content": "thường vẫn",
            "type": "",
            "example": {}
        },
        {
            "content": "tỏ ý chí",
            "type": "",
            "example": {}
        },
        {
            "content": "tờ di chúc",
            "type": "",
            "example": {
                "en": "However, neither the East India or the King will kill you because of your will.",
                "vi": "Tuy nhiên, Đông Ấn hay nhà Vua cũng sẽ không giết cậu do tờ di chúc của cậu."
            }
        },
        {
            "content": "ý muốn",
            "type": "",
            "example": {
                "en": "I testify that those simple assurances come as His will becomes ours.",
                "vi": "Tôi làm chứng rằng những sự bảo đảm đơn giản đó đến khi ý muốn của Ngài trở thành ý muốn của chúng ta."
            }
        },
        {
            "content": "ý thích",
            "type": "",
            "example": {
                "en": "Are you willing to forgo your personal preferences in your choice of fashion?",
                "vi": "Bạn có sẵn lòng hy sinh ý thích cá nhân trong việc lựa chọn trang phục?"
            }
        },
        {
            "content": "ý định",
            "type": "",
            "example": {
                "en": "He will merely have to turn his attention to the earth for his will to be accomplished.",
                "vi": "Ngài chỉ cần hướng sự chú ý đến trái đất là ý định Ngài sẽ được thực hiện."
            }
        },
        {
            "content": "ước rằng",
            "type": "",
            "example": {
                "en": "But I will have wished for death long before death finds me.",
                "vi": "Nhưng tôi sẽ ước rằng mình đã chết... từ lâu trước khi cái chết tìm ra tôi."
            }
        },
        {
            "content": "ắt là",
            "type": "",
            "example": {
                "en": "But, for a change, stretch out your hand and strike everything he has, and he will surely curse you to your very face.”—Job 1:10, 11.",
                "vi": "Nhưng bây giờ hãy giơ tay Chúa ra, đụng đến hại các vật người có, ắt là người sẽ phỉ-báng Chúa trước mặt”.—Gióp 1:10, 11."
            }
        },
        {
            "content": "Di chúc",
            "type": "",
            "example": {
                "en": "Come to my hanging, I'll put you in my will.",
                "vi": "Em có thể đến xem tôi bị treo cổ và tôi sẽ thêm tên em vào di chúc."
            }
        },
        {
            "content": "di chuùc",
            "type": "",
            "example": {}
        },
        {
            "content": "quyết tâm",
            "type": "",
            "example": {
                "en": "If you will it it will be yours.",
                "vi": "Nếu cháu có quyết tâm. Nó sẽ là của cháu."
            }
        }
    ],
    "hasAudio": 1
}