{
    "word": "wisdom",
    "type": [
        "noun"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ˈwizdəm/",
            "/ˈwɪzdəm/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ˈwɪzdəm/"
        ]
    },
    "meanings": [
        {
            "content": "sự thông thái",
            "type": "",
            "example": {
                "en": "You are revolting against the wisdom of countless solar systems.",
                "vi": "Các anh đang chống lại của sự thông thái của vô số hệ mặt trời."
            }
        },
        {
            "content": "học thức",
            "type": "",
            "example": {
                "en": "A learned man of the first century wrote about him: “Carefully concealed in him are all the treasures of wisdom and of knowledge.”",
                "vi": "Một người có học thức vào thế kỷ thứ nhất đã viết về ngài: “Trong Ngài đã giấu-kín mọi sự quí-báu về khôn-ngoan thông-sáng”."
            }
        },
        {
            "content": "kiến thức",
            "type": "noun",
            "example": {
                "en": "Before you depart, let me give you one more piece of fatherly wisdom.",
                "vi": "Trước khi khởi hành, để ta cho con thêm một phần kiến thức của cha."
            }
        },
        {
            "content": "sự hiểu biết",
            "type": "",
            "example": {
                "en": "I wasn't weighed down by expertise or conventional wisdom.",
                "vi": "Tôi không đặt nặng việc thành thạo hoặc sự hiểu biết thông thường."
            }
        },
        {
            "content": "sự lịch duyệt",
            "type": "",
            "example": {}
        },
        {
            "content": "sự từng tri",
            "type": "",
            "example": {}
        },
        {
            "content": "trí khôn",
            "type": "noun",
            "example": {
                "en": "I thank you for your guidance and wisdom.",
                "vi": "Cám ơn ngài gì sự dẫn dắt và trí khôn của ngài."
            }
        },
        {
            "content": "trí tuệ",
            "type": "",
            "example": {
                "en": "You know I heed your wisdom, but there's no more waiting!",
                "vi": "Nàng hiểu là ta coi trọng trí tuệ của nàng, nhưng không cần phải chờ gì nữa!"
            }
        },
        {
            "content": "tính khôn ngoan",
            "type": "",
            "example": {
                "en": "Does not the intelligent design so obvious in nature reveal to us God’s wisdom?",
                "vi": "Chẳng phải sự thiết kế thông minh trong thiên nhiên cho chúng ta thấy đặc tính khôn ngoan của Đức Chúa Trời sao?"
            }
        },
        {
            "content": "Minh triết",
            "type": "",
            "example": {
                "en": "That was the first time I saw wisdom.",
                "vi": "Đó là lần đầu tiên tôi gặp Minh Triết."
            }
        },
        {
            "content": "minh triết",
            "type": "adjective",
            "example": {
                "en": "These were the avenues to wisdom for Proust.",
                "vi": "Với Proust, đây là những đại lộ đến sự khôn ngoan minh triết."
            }
        },
        {
            "content": "sáng suốt",
            "type": "",
            "example": {
                "en": "Rules and incentives are no substitutes for wisdom.",
                "vi": "Những luật lệ và những phần thưởng không thể thay thế cho sự khôn ngoan và sáng suốt."
            }
        }
    ]
}