{
    "word": "wonder",
    "type": [
        "verb",
        "noun"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ˈwəndər/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ˈwʌndə/"
        ]
    },
    "meanings": [
        {
            "content": "kỳ quan",
            "type": "noun",
            "example": {
                "en": "There are so many wonders in this world.",
                "vi": "Có rất nhiều kỳ quan trên thế giới này."
            }
        },
        {
            "content": "ngạc nhiên",
            "type": "verb",
            "example": {
                "en": "That's a live feed, in case you're wondering.",
                "vi": "Nếu cô đang ngạc nhiên, thì đó là hình trực tiếp đấy."
            }
        },
        {
            "content": "sự ngạc nhiên",
            "type": "",
            "example": {
                "en": "The best stories infuse wonder.",
                "vi": "Những câu truyện hay nhất có trong đó sự ngạc nhiên."
            }
        },
        {
            "content": "tự hỏi",
            "type": "",
            "example": {
                "en": "I wonder when this program will continue till.",
                "vi": "Tôi tự hỏi khi nào chương trình này tiếp tục."
            }
        },
        {
            "content": "kinh ngạc",
            "type": "",
            "example": {
                "en": "Helen looked in wonder and surprise as she felt my hand .",
                "vi": "Helen nhìn với vẻ thắc mắc và kinh ngạc khi cô bé cảm nhận được tay tôi ."
            }
        },
        {
            "content": "kỳ công",
            "type": "",
            "example": {
                "en": "He will lead us to a land of wonder.",
                "vi": "Ngài sẽ dẫn chúng ta đến một vùng đất đầy những kỳ công."
            }
        },
        {
            "content": "lấy làm lạ",
            "type": "",
            "example": {
                "en": "It's no wonder we're losing the war with you, General, at the tiller.",
                "vi": "Không lấy làm lạ lắm khi chúng ta đang thua vì một tên tướng gà mờ, như ngươi."
            }
        },
        {
            "content": "muốn biết",
            "type": "",
            "example": {
                "en": "Tom wondered whether it would be hard to find a job in Boston.",
                "vi": "Tom muốn biết liệu có khó để tìm việc ở Boston hay không."
            }
        },
        {
            "content": "người kỳ diệu",
            "type": "",
            "example": {}
        },
        {
            "content": "sự kinh ngạc",
            "type": "",
            "example": {
                "en": "and I try to incorporate that sense of wonderment",
                "vi": "và tôi cố gắng lồng ghép sự kinh ngạc"
            }
        },
        {
            "content": "thần đồng",
            "type": "",
            "example": {
                "en": "So here he is, the boy wonder.",
                "vi": "Vậy là cậu ta đây rồi, cậu bé thần đồng."
            }
        },
        {
            "content": "vật kỳ diệu",
            "type": "",
            "example": {
                "en": "How do you account for the existence of all the wonderful things that surround us?",
                "vi": "Bạn giải thích thế nào về sự hiện hữu của vạn vật kỳ diệu chung quanh chúng ta?"
            }
        },
        {
            "content": "vật phi thường",
            "type": "",
            "example": {}
        },
        {
            "content": "điều kỳ diệu",
            "type": "",
            "example": {
                "en": "Technology in this day and age allows us to do wonders.",
                "vi": "Công nghệ ngày nay và trong thời đại này cho phép chúng ta làm những điều kỳ diệu."
            }
        },
        {
            "content": "điều kỳ lạ",
            "type": "",
            "example": {
                "en": "And it's no wonder that as we head into the writers' strike, odd things happen.",
                "vi": "Chẳng trách khi chúng ta hướng vào cuộc đình công của nhà văn, những điều kỳ lạ đã xảy ra."
            }
        },
        {
            "content": "điều ngạc nhiên",
            "type": "",
            "example": {
                "en": "Let's try a look... of far-off wonderment.",
                "vi": "Em biết, hãy thử như là anh đang thấy một điều ngạc nhiên gì đó ở xa kia."
            }
        },
        {
            "content": "nghi ngờ",
            "type": "",
            "example": {
                "en": "I'm wondering if state secrets is the best tactic.",
                "vi": "Tôi nghi ngờ liệu bí mật quốc gia có phải là chiến thuật tối ưu không."
            }
        },
        {
            "content": "tò mò",
            "type": "",
            "example": {
                "en": "For days after the launch, Sputnik was a wonderful curiosity.",
                "vi": "Những ngày sau khi phóng tên lửa, Sputnik trở thành niềm tò mò vô hạn."
            }
        }
    ]
}