{
    "word": "writing",
    "type": [
        "verb",
        "noun"
    ],
    "us": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ˈrīdiNG/",
            "/ˈraɪdɪŋ/"
        ]
    },
    "uk": {
        "hasAudio": 1,
        "phoneticSpelling": [
            "/ˈrʌɪtɪŋ/"
        ]
    },
    "meanings": [
        {
            "content": "chữ viết",
            "type": "noun",
            "example": {
                "en": "Unlike all written human languages, their writing is semasiographic.",
                "vi": "Khác với mọi chữ viết của loài người, chữ viết của họ là các hình ảnh biểu tượng."
            }
        },
        {
            "content": "sách",
            "type": "noun",
            "example": {
                "en": "Sorry to interrupt your writing session, sir, But something's happened.",
                "vi": "Xin lỗi vì đã cắt ngang không gian viết sách của ngài, nhưng có chuyện xảy ra."
            }
        },
        {
            "content": "chữ",
            "type": "noun",
            "example": {
                "en": "When drawing kanji be careful of dots and sweeps, write as carefully and quickly as possible.",
                "vi": "Khi viết chữ Hán nên cẩn thận mấy cái chấm và nét quét, viết nhanh và cẩn thận nhất có thể."
            }
        },
        {
            "content": "bài báo",
            "type": "",
            "example": {
                "en": "Can't you read the writing on the wall, Bronson?",
                "vi": "Anh không thể đọc bài báo trên tường hả, Bronson?"
            }
        },
        {
            "content": "bản ghi chép",
            "type": "",
            "example": {
                "en": "In his writings, Tesla describes his method of approaching a complex engineering problem.",
                "vi": "Trong các bản ghi chép của mình, Tesla miêu tả phương pháp của ông để tiếp cận một vấn đề kỹ thuật phức tạp."
            }
        },
        {
            "content": "bản viết tay",
            "type": "",
            "example": {
                "en": "He writes his first drafts by hand, then types them up on a Wanderer'Torpedo'.",
                "vi": "Có khả năng, thường thì ông ta sẽ có một bản viết tay trước."
            }
        },
        {
            "content": "kiểu viết",
            "type": "",
            "example": {}
        },
        {
            "content": "lối viết",
            "type": "",
            "example": {
                "en": "Many have found the clear writing in these journals to be helpful when learning a new language.",
                "vi": "Nhiều người cho rằng lối viết rõ ràng của các tạp chí này rất có lợi cho việc học ngoại ngữ."
            }
        },
        {
            "content": "nghiệp bút nghiên",
            "type": "",
            "example": {}
        },
        {
            "content": "nghề viết sách",
            "type": "",
            "example": {}
        },
        {
            "content": "nghề viết văn",
            "type": "",
            "example": {}
        },
        {
            "content": "sự viết",
            "type": "",
            "example": {
                "en": "but you're really writing about the exceptions.\"",
                "vi": "nhưng cô đang thực sự viết về các trường hợp ngoại lệ.\""
            }
        },
        {
            "content": "sự viết lách",
            "type": "",
            "example": {}
        },
        {
            "content": "sự viết tay",
            "type": "",
            "example": {}
        },
        {
            "content": "thuật sáng tác",
            "type": "",
            "example": {}
        },
        {
            "content": "thuật viết",
            "type": "",
            "example": {
                "en": "Amy and I believe in the lost art of letter-writing.",
                "vi": "Amy và tôi luôn thích nghệ thuật viết thư tay dù cho nó đã lỗi thời."
            }
        },
        {
            "content": "tài liệu",
            "type": "noun",
            "example": {
                "en": "As the need for record-keeping increased, cuneiform writing was developed.",
                "vi": "Khi nhu cầu lưu trữ tài liệu gia tăng, chữ hình nêm đã được phát triển."
            }
        },
        {
            "content": "tác phẩm",
            "type": "",
            "example": {
                "en": "Found writings include treatise on the creation of a time machine.",
                "vi": "Những tác phẩm tìm thấy gồm luận án sáng tạo một cỗ máy thời gian."
            }
        },
        {
            "content": "bài viết",
            "type": "",
            "example": {
                "en": "Shin Cine saw my writing, and offered to make a movie out of it.",
                "vi": "Shin Cine thấy bài viết của tôi, và đề nghị làm một bộ phim ra khỏi nó."
            }
        }
    ]
}